[{"name":"\n  \n    \"16 Bean\" Pasta E Fagioli\n  \n","ingredients":["1 (1-pound) bag Goya 16 Bean Soup Mix","2 tablespoons good olive oil, plus extra for serving","6 ounces pancetta, 1/4-inch-diced","1 large onion, chopped","1 tablespoon minced garlic (3 cloves)","1/2 teaspoon crushed red pepper flakes","1 (28-ounce) can crushed tomatoes, preferably San Marzano","1 cup dry red wine","4 to 6 cups good chicken stock, preferably homemade","Kosher salt and freshly ground black pepper","1 cup miniature pasta, such as ditalini or tubettini","1/2 cup freshly grated Italian Parmesan cheese, plus extra for serving","1 tablespoon good red wine vinegar","Julienned fresh basil leaves, for serving"],"directions":["\n              The day before you plan to make the soup, place the bean mix in a large bowl, add cold water to cover by 2 inches and refrigerate overnight. The next day, drain the beans, rinse under cold running water and drain again. Place the beans in a large pot with 8 cups of cold water. Bring to a boil, lower the heat and simmer for 1 hour. Stir occasionally and skim off any foam that rises to the top. The beans should be very tender and the skin will peel away when you blow on a bean.\n            ","\n              Meanwhile, heat the oil in a medium (10-inch) stockpot or Dutch oven over medium heat. Add the pancetta and onion and saute over medium to medium-high heat for 12 to 18 minutes, until browned. Add the garlic and red pepper flakes and saute for one minute. Add the tomatoes, wine, 4 cups of the chicken stock, 1 tablespoon salt and 1 teaspoon black pepper and turn off the heat.\n            ","\n              Drain the beans and add two-thirds of them to the soup. Pass the remaining beans through a food mill, discarding the skins. Stir the bean puree and the pasta into the soup, bring to a boil, lower the heat and simmer for 20 to 30 minutes, stirring occasionally, until the pasta is tender. Add up to 2 more cups chicken stock if the soup is too thick. Stir in the Parmesan and the vinegar. Ladle the soup into large shallow bowls and add a swirl of olive oil, a sprinkle of Parmesan and some basil. Serve hot with extra Parmesan on the side.\n            "],"source":"https://www.foodnetwork.com/recipes/ina-garten/16-bean-pasta-e-fagioli-3612570"},{"name":"\n  \n    \"16 Bean\" Pasta e Fagioli\n  \n","ingredients":["1 (1-pound) bag 16 Bean Soup Mix","2 tablespoons good olive oil, plus extra for serving","6 ounces pancetta, 1/4-inch-diced","1 large onion, chopped","1 tablespoon minced garlic (3 cloves)","1/2 teaspoon crushed red pepper flakes","1 (28-ounce) can crushed tomatoes","1 cup dry red wine","4 to 6 cups good chicken stock, preferably homemade","Kosher salt and freshly ground black pepper","1 cup miniature pasta, such as ditalini or tubettini","1/2 cup freshly grated Italian Parmesan cheese, plus extra for serving","1 tablespoon good red wine vinegar","Julienned fresh basil leaves, for serving"],"directions":["\n              The day before you plan to make the soup, place the bean mix in a large bowl, add cold water to cover by 2 inches, and refrigerate overnight. The next day, drain the beans, rinse under cold running water, and drain again. Place the beans in a large pot with 8 cups of cold water. Bring to a boil, lower the heat, and simmer for 1 hour. Stir occasionally and skim off any foam that rises to the top. The beans should be very tender and the skin will peel away when you blow on a bean.\n            ","\n              Meanwhile, heat the oil in a medium (10-inch) stockpot or Dutch oven over medium heat. Add the pancetta and onion and saute over medium to medium-high heat for 12 to 18 minutes, until browned. Add the garlic and red pepper flakes and saute for one minute. Add the tomatoes, wine, 4 cups of the chicken stock, 1 tablespoon salt, and 1 teaspoon black pepper and turn off the heat.\n            ","\n              Drain the beans and add two-thirds of them to the soup. Pass the remaining beans through a food mill, discarding the skins. Stir the bean puree and the pasta into the soup, bring to a boil, lower the heat, and simmer for 20 to 30 minutes, stirring occasionally, until the pasta is tender. Add up to 2 more cups chicken stock if the soup is too thick. Stir in the Parmesan and the vinegar. Ladle the soup into large shallow bowls and add a swirl of olive oil, a sprinkle of Parmesan, and some basil. Serve hot with extra Parmesan on the side.\n            "],"source":"https://www.foodnetwork.com/recipes/ina-garten/16-bean-pasta-e-fagioli-1-3753755"},{"name":"\n  \n    \"21\" Apple Pie\n  \n","ingredients":["2 cups all-purpose flour","1/2 teaspoon salt","6 ounces cold, unsalted butter, cut into cubes, plus butter for the pie tin","1/4 to 1/3 cup ice cold water","1 stick (8 tablespoons) unsalted butter","12 large apples such as Granny Smith, peeled, cored, and sliced into eighths (about 14 cups)","Juice of 2 lemons (about 1/4 cup)","1/4 cup loosely packed dark brown sugar","1/4 cup loosely packed light brown sugar","1/4 cup Southern Comfort","1 tablespoon ground cinnamon","1 large egg beaten with 2 tablespoons water"],"directions":["\n              To prepare the dough by hand, combine the flour and salt in a stainless steel bowl and mix well.\n            ","\n              Add the cold butter cubes and, with a pastry blender, blend in the butter until the mixture begins to resemble a mealy mixture where butter forms peas-size nuggets plainly visible in the flour. Add only enough water to pull the dough together. The water should be added to the flour slowly to ensure that only the minimum amount of water is used. Do not over-mix the dough. When the dough has been mixed just sufficiently to combine the ingredients, form it into a ball and wrap in a piece of plastic wrap and refrigerate for several hours.\n            ","\n              To prepare the filling, melt the butter in a large saute pan until it begins to brown. Add the sliced apples and cook over medium heat until they begin to soften, about 2 to 3 minutes.\n            ","\n              In a bowl, combine the lemon juice, sugars, Southern Comfort, and cinnamon. Add this mixture to the apples and cook 2 to 3 minutes over medium-high heat until the apples are completely caramelized and covered with all the sugar. Remove filling from the heal and allow to cool.\n            ","\n              Preheat the oven to 375 degrees.\n            ","\n              When ready to use, remove the dough from the refrigerator, lightly flour a pastry board and a rolling pin, and unwrap the dough. Divide the dough into 2 equal pieces and begin to roll out\n            ","\n              into a circle by rolling evenly outward from the center and turning the dough in small 1/8th turns to keep the rolling even. When the dough is rolled out to an even thickness and is about 12 inches in diameter and 1/8-inch thick, it is ready to be transferred to a 10-inch pie tin. Lightly butter the tin, partially roll the dough up on the rolling pin, lift the dough and center it in the pie tin and unroll.\n            ","\n              Roll the second half of the pie dough into a round slightly larger than the pie pan. Fill the bottom crust with the cooked apples using a slotted spoon to drain the apples. Reserve juices if desired, for sauce. Brush an egg wash coating over the lip of the dough. This is where it will be sealed to the top crust. Cover the apples with the top half of the pie dough. Trim any excess from the top crust before using both hands to crimp the edges of the two crust together to seal. With a sharp knife, make several crosshatch slits in the top crust. Brush with the egg wash and bake for 35 to 40 minutes. Remove from the oven and cool 20 minutes. Serve with vanilla ice cream.\n            ","\n              Reserved juices can be reduced with heavy cream for a sauce for the pie.\n            "],"source":"https://www.foodnetwork.com/recipes/21-apple-pie-recipe-1925900"},{"name":"\n  \n    '21' Traditional Hash Brown Potatoes\n  \n","ingredients":["3 cups peeled, 1/2-inch-dice Idaho potatoes (about 2 pounds)","2 large onions, peeled and cut in 1/2-inch dice","1/4 cup vegetable oil","5 tablespoons unsalted butter","Salt and freshly ground black pepper to taste"],"directions":["\n              Parboil the potatoes approximately 5 to 6 minutes in salted water. Drain and cool to room temperature. Meanwhile, saute the diced onions in the oil plus 1 tablespoon of the butter until richly browned and caramel colored. This step ensures that all of the onion's sweetness is developed. Cool the onions, then mix with the potatoes.\n            ","\n              Preheat the oven to 350 degrees. Melt half the remaining butter in a 10-inch nonstick saute pan over medium heat, and add half the diced potato/onion mixture. Take care to pack the mixture tightly in one neat layer to saute and brown. Using the back of a spoon, form the potato and onion mixture into a rounded cake. When the potatoes and onions begin to adhere and brown, flip them over using a large spatula or the back of a plate. Brown the second side, then transfer the hash-browned potatoes to a cookie sheet and reserve while you cook the second half of the potato/onion mixture. Add the second batch to the cookie sheet and bake 10 minutes. Remove from the oven, season with the salt and pepper, and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/21-traditional-hash-brown-potatoes-1963787"},{"name":"\n  \n    1 S'more for the Road and Kiddie S'mores\n  \n","ingredients":["Nonstick canola oil spray","1 pound marshmallow creme","4 tablespoons unsalted butter, melted and cooled","1/2 cup powdered sugar","1/3 cup miniature chocolate-covered candies, such as M and M's, plus more for garnish","2 tablespoons bourbon","1 teaspoon vermouth","1 teaspoon grenadine","24 whole graham crackers, each broken carefully in half","80 stackable marshmallows (2 bags)","Six 4-ounce bars high-quality semisweet chocolate, chopped","Optional serving suggestions: Manhattan's (for the adults) or chocolate milk (for the kids)"],"directions":["\n              Coat a large microwave-safe bowl with nonstick spray. Add the marshmallow creme and microwave until warmed through and slightly puffed, 30 to 45 seconds. Add the butter and powdered sugar and whip with a hand mixer until light and fluffy, 1 to 2 minutes. Transfer half of the mixture to another bowl coated with nonstick spray and fold in the candies. Set aside until ready to use.\n            ","\n              Add the bourbon, vermouth and grenadine to the remaining marshmallow mixture and whip with a hand mixer until well combined. Set aside until ready to use.\n            ","\n              To build the \"1 s'more for the road\": On a cooling rack over a half baking sheet, lay down 32 of the graham cracker halves. Spread 1 1/2 teaspoons of the \"Manhattan\" marshmallow creme on each graham cracker half. Place 4 stackable marshmallows on 16 of the graham cracker halves. Top with the remaining graham cracker halves.\n            ","\n              To build the kiddie s'mores: On a cooling rack over a half baking sheet, lay down the remaining 16 graham cracker halves. Spread 1 tablespoon of \"kiddie\" marshmallow creme on each graham cracker half. Place 2 stackable marshmallows on 8 of the graham cracker halves. Top with the remaining graham cracker halves.\n            ","\n              In a metal bowl set over a saucepan with about 1 inch of simmering water in it, melt the semisweet chocolate over medium-low heat until completely smooth, stirring constantly, 5 to 7 minutes. Once the chocolate is melted, turn the heat off below the pan. Pour 2 tablespoons of the melted chocolate on top of each s'more, letting the chocolate drip down the sides. Once the s'mores are finished, let the chocolate harden at room temperature for an hour (or if you are in a hurry, then let set up in the refrigerator for 15 minutes). \n            ","\n              Serve with a side of Manhattans for the adults and some chocolate milk for the kids. \n            "],"source":"https://www.foodnetwork.com/recipes/jeff-mauro/1-smore-for-the-road-and-kiddie-smores-recipe-2033028"},{"name":"\n  \n    1-2-3 Jambalaya\n  \n","ingredients":["1 package (13.5 ounces) Johnsonville Andouille Dinner Sausage, cut into ¼ -inch slices","8 ounces raw shrimp, peeled and deveined or 8 ounces boneless, skinless chicken breast, cut into 1-inch pieces","2 teaspoons Cajun Creole seasoning ","1 teaspoons olive oil","1 box (8 ounces) Jambalaya rice mix","1 can (14.5 ounces) diced tomatoes, drained and divided","1 teaspoon Worcestershire sauce","1 teaspoon hot pepper sauce","2 tablespoons chopped fresh parsley"],"directions":["\n              In a bowl, combine sausage, shrimp or chicken with Cajun Creole seasoning; toss to coat.\n            ","\n              In a skillet, heat oil over medium heat. Add sausage, shrimp or chicken, cooking and stirring until shrimp turn pink or chicken is no longer pink, about 3-5 minutes.\n            ","\n              In a saucepan, prepare rice mix according to package directions. In addition, add one-half of the tomatoes into the rice preparation. After 12 minutes of cooking, add remaining tomatoes, Worcestershire sauce, hot pepper sauce and parsley.\n            ","\n              Continue to cook on low, covered, until liquid is absorbed and rice is tender. Add sausage, shrimp or chicken to rice; stir until heated through. Serve\n            "],"source":"https://www.foodnetwork.com/recipes/1-2-3-jambalaya-3362411"},{"name":"\n  \n    1-2-3 Lasagna\n  \n","ingredients":["1 (15-ounce) container ricotta","1 cup grated Parmesan","2 large eggs","2 pounds ground beef","1 pound grated Mozzarella","5 cups Basic Red Sauce, recipe follows","1/2 teaspoon Essence, recipe follows","1/4 teaspoon ground black pepper","1/2 teaspoon salt","12 dried (uncooked) lasagna noodles","2 teaspoons chopped fresh parsley","1 teaspoon dried basil","1/2 teaspoon salt","2 (28-ounce) cans whole peeled tomatoes","2 tablespoons olive oil","Basic Red Sauce:","1/2 teaspoon dried basil","1 1/2 cups chopped yellow onions (1 medium yellow onion)","1 teaspoon minced garlic (about 2 cloves garlic)","1/2 teaspoon dried oregano","1/8 teaspoon ground black pepper","2 (15-ounce) cans tomato sauce","3 tablespoons tomato paste","2 cups water","1 teaspoon sugar","2 1/2 tablespoons paprika","2 tablespoons salt","2 tablespoons garlic powder","1 tablespoon black pepper","1 tablespoon onion powder","1 tablespoon cayenne pepper","1 tablespoon dried leaf oregano","1 tablespoon dried thyme"],"directions":["\n              Preheat the oven to 375 degrees F.\n            ","\n              In a large saucepan, add the ground beef and brown over medium heat. Season with salt, pepper, and Essence. Add the tomato sauce and simmer for 10 minutes.\n            ","\n              In a large bowl fold together the ricotta cheese, eggs, 1/2 cup grated Parmesan, 1/2 cup grated mozzarella, the Essence, salt, parsley, basil, and black pepper.\n            ","\n              Spread 1 cup of the tomato sauce in the bottom of a 3-quart (13 by 9 by 2-inch) casserole. Lay 3 lasagna noodles lengthwise down the dish. The noodles should not touch one another. Spoon 3/4 cup of the ricotta mixture over the noodles, and spread evenly with a rubber spatula. Sprinkle 1 cup of the mozzarella evenly over the ricotta. Repeat with the remaining ingredients, for a total of 4 layers of noodles. Sprinkle the remaining 1 cup of mozzarella over the top layer of tomato sauce, and top with the remaining 1/2 cup of Parmesan.\n            ","\n              Cover the casserole tightly with aluminum foil, and bake, covered, for 1 hour.\n            ","\n              Remove the casserole from the oven, and remove the aluminum foil. Return to the oven and bake, uncovered, for 10 minutes.\n            ","\n              Remove from the oven and let sit for 10 minutes before serving.\n            ","\n              Place the tomatoes in a large bowl and squeeze to break into small pieces. Set aside.\n            ","\n              In a heavy 5-quart pot, heat the olive oil over medium heat. Add the onions, garlic, salt, basil, oregano and black pepper, and cook, stirring, until soft, 5 minutes. Add the tomato sauce, tomato paste, water, sugar and reserved crushed tomatoes, stir well, and bring to a simmer. Lower the heat to medium-low, and simmer uncovered for 45 minutes, stirring occasionally.\n            ","\n              Remove from the heat, and use as needed.\n            ","\n              Combine all ingredients thoroughly and store in an airtight jar or container.\n            ","\n              Recipe from \"New New Orleans Cooking\", by Emeril Lagasse and Jessie Tirsch. Published by William and Morrow, 1993.\n            "],"source":"https://www.foodnetwork.com/recipes/1-2-3-lasagna-3644969"},{"name":"\n  \n    1-Step Chipotle Hummus\n  \n","ingredients":["1 (16-ounce) container store-bought hummus (about 2 cups)","2 tablespoons TABASCO® brand Chipotle Pepper Sauce","Pita chips or raw vegetables"],"directions":["\n              Mix together hummus and TABASCO® Chipotle Sauce until well combined. Serve immediately with pita chips or raw vegetables or refrigerate until ready to use.\n            "],"source":"https://www.foodnetwork.com/recipes/1-step-chipotle-hummus-3416679"},{"name":"\n  \n    10 Minute Apple Sauce\n  \n","ingredients":["3 Golden Delicious apples, peeled, cored, and quartered","3 Fuji apples, peeled, cored, and quartered","1 cup unfiltered apple juice","2 tablespoons cognac or brandy","2 tablespoons butter","3 tablespoons honey","1/2 teaspoon ground cinnamon"],"directions":["\n              In a sealable microwave-safe container, combine apples with all other ingredients. Close lid, leaving one corner of lid open to allow steam to escape. Microwave on high for 10 minutes.\n            ","\n              Using a hand blender or potato masher, blend to desired consistency. Serve hot immediately or chill for later use.\n            "],"source":"https://www.foodnetwork.com/recipes/alton-brown/10-minute-apple-sauce-recipe-1950796"},{"name":"\n  \n    10 Minute Apple Sauce\n  \n","ingredients":["3 Golden Delicious apples, peeled, cored, and quartered","3 Fuji apples, peeled, cored, and quartered","1 cup unfiltered apple juice","2 tablespoons cognac or brandy","2 tablespoons butter","3 tablespoons honey","1/2 teaspoon ground cinnamon"],"directions":["\n              In a sealable microwave-safe container, combine apples with all other ingredients. Close lid, leaving one corner of lid open to allow steam to escape. Microwave on high for 10 minutes.\n            ","\n              Using a hand blender or potato masher, blend to desired consistency. Serve hot immediately or chill for later use.\n            "],"source":"https://www.foodnetwork.com/recipes/alton-brown/10-minute-apple-sauce-recipe2-1938289"},{"name":"\n  \n    10 Minute Fruit Tart\n  \n","ingredients":["1 box vanilla or lemon flavor instant pudding mix","1 orange, zested","1/2 cup seedless raspberry or blackberry preserves","1 prepared graham cracker crust, found on baking aisle","1/2 pint raspberries","1/2 pint blackberries or blueberries, your preference","6 large strawberries, sliced","2 tablespoons chopped fresh mint, optional"],"directions":["\n              Make pudding according to package directions and let stand 5 minutes. Stir orange zest into the pudding. Spread a thin layer of preserves across the bottom of graham cracker crust. Top with pudding. Arrange fruit on pudding, then sprinkle pie with mint, if desired.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/10-minute-fruit-tart-recipe-1941411"},{"name":"\n  \n    10,000 Island Dressing with Layered Salad\n  \n","ingredients":["1 cup mayonnaise","3 tablespoons mustard, preferably Dijon","1/3 cup chili sauce","3 tablespoons capers, drained","1/3 cup piquante peppers, preferably Peppadews, seeded and diced","1 large hard-boiled egg, finely chopped","3 tablespoons finely chopped dill pickles","2 tablespoons finely chopped green onions","1/2 teaspoon kosher salt","1/2 teaspoon freshly cracked black pepper","2 small beets or 1 large","Olive oil, for roasting beets","Kosher salt and freshly cracked pepper","3/4 cup diced bacon","1 head iceberg lettuce, cut into 2-inch chunks","1 head red leaf lettuce, cut into 2-inch chunks","2 avocados, halved, pitted, peeled and sliced","1 red onion, thinly sliced","1 1/2 cups grape tomatoes","3 hard-boiled eggs, chopped","1 English cucumber, peeled, seeded and thinly sliced"],"directions":["\n              Dressing: In a glass bowl, add the mayonnaise, mustard and chili sauce and mix well. Add the capers, peppers, chopped egg, pickles and green onions. Fold everything together and season with the salt and pepper. Transfer to a glass jar or plastic container and refrigerate for 30 minutes to 24 hours.\n            ","\n              Salad: Preheat the oven to 350 degrees F.\n            ","\n              Wash and prepare your vegetables. Trim the ends of the beets, drizzle with olive oil, sprinkle with salt and pepper, to taste, and wrap in foil. Put them on a cookie sheet and roast in the oven until tender, about 1 hour or longer. Remove them from the oven and let cool. Once cooled, peel and cut them into julienne pieces.\n            ","\n              Saute the diced bacon in a small skillet over medium-high heat until just crisp. Remove the bacon from the skillet to a paper towel.\n            ","\n              In a clear glass bowl with slanted sides, layer your salad, starting with 1/3 of the iceberg, then the beets, 1/3 of the red leaf lettuce, then the avocado. Keep going with 1/3 of the iceberg, then the onions, 1/3 of the red leaf lettuce, then the tomatoes. Finish with the final portion of iceberg, then the eggs, the final layer of red leaf, then the cucumber. Top the entire salad with the dressing and garnish with the bacon. Toss at the table and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/guy-fieri/10000-island-dressing-with-layered-salad-recipe-1920098"},{"name":"\n  \n    10-Minute Arrabbiata Sauce\n  \n","ingredients":["2 Tbsp. olive oil","1 Tbsp. finely chopped garlic","1/8 to 1/4 tsp. crushed red pepper flakes","1 jar Bertolli® Tomato & Basil Sauce","1 box (16 oz.) linguine, cooked and drained"],"directions":["\n              Heat olive oil in 2-quart saucepan over medium heat and cook garlic and red pepper flakes 30 seconds. Stir in sauce. Simmer, stirring occasionally, 8 minutes. Serve over hot linguine.\n            ","\n              Smart Choices Program™ approved recipes were developed to bring nutrition to your kitchen with delicious recipes that help you make positive changes in your diet through a variety and balance of food choices from each of the major food groups.\n            "],"source":"https://www.foodnetwork.com/recipes/10-minute-arrabbiata-sauce-2103668"},{"name":"\n  \n    10-Minute Beef-and-Beet Salad with Horseradish Dressing\n  \n","ingredients":["2 slices seeded rye bread","1/4 cup sour cream","3 tablespoons horseradish","2 tablespoons mayonnaise","2 teaspoons Dijon mustard","Kosher salt and freshly ground black pepper","One 5-ounce package baby spinach (about 4 cups)","3 cups coleslaw mix (about 7 ounces)","4 ounces dill Havarti cheese, cut into 1/2-inch cubes","1/2 pound thinly-sliced rare deli roast beef","3/4 cup sliced and drained pickled beets"],"directions":["\n              Toast the rye bread.\n            ","\n              Meanwhile, whisk together the sour cream, horseradish, mayonnaise, mustard, 3 tablespoons water, 3/4 teaspoon salt and 1/4 teaspoon pepper in a large bowl. Add the spinach, coleslaw mix and cheese and toss to combine.\n            ","\n              Cut the toasted bread, crusts and all, into 1/2-inch pieces Divide dressed greens among 4 salad plates and top each with roast beef, beets and rye croutons.\n            ","\n              Copyright 2014 Television Food Network, G.P. All rights reserved.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-beef-and-beet-salad-with-horseradish-dressing-3363096"},{"name":"\n  \n    10-Minute Chicken, Corn and Kimchi Ramen\n  \n","ingredients":["4 cups low-sodium chicken broth","Three 3-ounce packages ramen noodles (flavor packets discarded)","One 5-ounce package baby spinach (about 4 cups)","2 cups leftover shredded rotisserie chicken","2 cups kimchi","1 1/2 cups frozen corn kernels","2 tablespoons low-sodium soy sauce","3 scallions","4 sheets toasted seaweed snack"],"directions":["\n              Combine the chicken broth, 1 cup water, ramen noodles, spinach, chicken, kimchi, corn and soy sauce in a large straight-sided skillet. Cover and bring to a boil over high heat, stirring occasionally, about 6 minutes; boil for 1 minute.\n            ","\n              Meanwhile, slice the scallions and tear the seaweed into bite-size pieces.\n            ","\n              Divide the hot ramen among 4 shallow bowls and top each with scallions and seaweed.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-chicken-corn-and-kimchi-ramen-3363134"},{"name":"\n  \n    10-Minute Green Gazpacho and Smoky Quesadilla\n  \n","ingredients":["1/2 cup sour cream","1 English cucumber roughly chopped (about 8 ounces)","1 small clove garlic, grated","1 scallion, thinly sliced, white and green parts separated","1 scallion, thinly sliced, white and green parts separated ","Fine salt","1 medium green tomato, roughly chopped (about 8 ounces)","1/3 cup extra-virgin olive oil, plus more for drizzling","One 15-ounce can cannellini beans, strained and rinsed","Freshly ground black pepper","Four 8-inch flour tortillas","6 slices smoked gouda cheese (about 6 ounces)","Sliced pickled jalapenos, for serving"],"directions":["\n              Preheat the broiler with a rack set about 4 inches from the heat source.\n            ","\n              Put 1/4 cup of the sour cream, 1/4 cup iced water mixed with ice cubes, the sliced cucumbers, garlic, scallion whites and a large pinch salt in a blender. Blend until mostly smooth, then add the tomatoes. Blend until smooth, then remove the small cap on the lid of the blender and slowly drizzle in 1/4 cup of the oil while the blender is running. Season with additional salt if needed. Place the soup in the freezer while you prepare the quesadillas.\n            ","\n              Place the cannellini beans and a pinch black pepper in a bowl, and roughly mash with the back of a fork. Place 2 of the tortillas on a baking sheet without letting them overlap. Brush one side of the tortillas with some of the remaining olive oil. Flip, so the oiled side is directly on the baking sheet. Divide the mashed cannellini beans between the two tortillas and use a fork or your fingers to spread the mixture evenly on the tortillas, leaving a 1/2-inch border around the edge. Lay 3 pieces of the cheese on top of the beans on each tortilla (it is okay if the cheese overlaps slightly). Top with the remaining 2 tortillas and brush the tops of the tortillas with the remaining oil.\n            ","\n              Place the quesadillas under the broiler and cook until the top tortillas are crisp and lightly golden brown, about 1 minute. Use a spatula to flip the quesadillas and cook until the cheese is completely melted and the tortillas are crisp and lightly golden brown, about 1 additional minute. Cut each into 6 wedges.\n            ","\n              To serve, ladle (or pour directly from the blender carafe) the soup in to 4 chilled bowls and drizzle with additional olive oil and several grindings of freshly ground black pepper and some of the sliced green scallions. Serve 3 pieces of quesadilla on the side of each bowl of soup along with a dollop of the remaining sour cream and some pickled jalapenos.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-green-gazpacho-and-smoky-quesadilla-3363248"},{"name":"\n  \n    10-Minute Ham, White Bean and Kale Salad\n  \n","ingredients":["Two 15-ounce cans white beans, rinsed and drained","1/2 pound sliced deli meat, such as ham or turkey","10 cups baby kale (about 5 ounces)","3/4 cup dried cranberries","2 ounces Manchego cheese","Dinner rolls, for serving","1/2 cup sliced almonds","1/4 cup red wine vinegar","2 tablespoons Dijon mustard","Kosher salt and freshly ground black pepper","1/3 cup extra-virgin olive oil","Toast the almonds in a medium skillet over medium heat, stirring occasionally, until light brown in spots, about 3 minutes."],"directions":["\n              Meanwhile, whisk together the red wine vinegar, mustard, 1/2 teaspoon salt and a few grinds of pepper in a large bowl until combined. Slowly drizzle in the oil while whisking until the mixture is thickened and creamy. Add the beans and toss.\n            ","\n              Roughly chop the meat and add to the salad. Add the baby kale, dried cranberries and almonds. Toss all together and top with the Manchego, shaved with a vegetable peeler. Serve immediately with dinner rolls on the side.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-ham-white-bean-and-kale-salad-3362893"},{"name":"\n  \n    10-Minute Ice Cream Pops\n  \n","ingredients":["8 ounces semi-sweet chocolate","1/2 cup refined coconut oil (see Cook's Note)","1/4 teaspoon pure vanilla extract, optional","2 round cardboard pints of your favorite ice cream"],"directions":["\n              Line a baking sheet with parchment and put in the freezer. Combine the chocolate, coconut oil and vanilla extract in a medium microwave-safe bowl. Microwave for 15 second increments, stirring with a spoon in between, until the chocolate is three-quarters of the way melted. Then stir the mixture until the chocolate melts completely. Set aside.\n            ","\n              Remove the ice cream pints from the freezer and discard the lid. Using a serrated knife, slice off a very thin piece from the side of the container so that it sits flat on a cutting board. With the container on its side, slice crosswise into 3 equal rounds. Remove the cardboard from each round and insert a wooden ice pop stick through the side. Dip into the melted chocolate and lay flat on the chilled baking sheet (see Cook's Note). Let harden in the freezer for 30 seconds and eat, or wrap individually with plastic and freeze for up to 2 weeks.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-ice-cream-pops-3666655"},{"name":"\n  \n    10-Minute White Bean Soup with Toasted Cheese and Tomato\n  \n","ingredients":["1/2 cup dry white wine","2 sprigs fresh rosemary, each about 6 inches long","2 sprigs fresh thyme","2 1/2 cups low-sodium chicken or vegetable broth","Two 15-ounce cans of cannellini or other white beans, strained and rinsed","1 small shallot, peeled, trimmed and halved","1 small garlic clove, peeled, trimmed and halved","1 tablespoon olive oil","1 tablespoon unsalted butter","Kosher salt and freshly ground black pepper","4 slices crusty sourdough bread (each about 1-inch thick; 8 ounces total),","3/4 cup shredded part-skim mozzarella cheese","2 plum tomatoes, seeded and chopped (about 1 cup)","1/4 cup grated Parmesan"],"directions":["\n              Position a rack about 4 inches from the broiler heat source, and preheat. Bring the wine, rosemary, thyme and 2 cups of the chicken broth to a boil in a covered medium saucepan over high heat. Reduce to a bare simmer.\n            ","\n              Puree the beans, shallots, garlic, oil, butter, remaining 1/2 cup chicken broth, 1/2 teaspoon salt, a few grinds of pepper and 1/2 cup of the simmering broth in a blender until completely smooth and emulsified, about 2 minutes.\n            ","\n              Meanwhile, lay the bread slices on a rimmed baking sheet, and top evenly with the mozzarella. Broil until the tops are browned and bubbling, 1 to 2 minutes; remove from the oven. Divide the tomatoes evenly among the toasts, and top with the Parmesan.\n            ","\n              Remove the herb sprigs from the simmering broth; set aside. Whisk the bean puree into the broth, and return it to a gentle boil. Ladle the soup into bowls, and garnish with the reserved herb sprigs and a few grinds of black pepper. Serve with the cheese toasts.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/10-minute-white-bean-soup-with-toasted-cheese-and-tomato-3362867"},{"name":"\n  \n    10-Minute White Pizza\n  \n","ingredients":["1 package thin crust prepared pizza shell or prepared focaccia, 16 ounces","Extra-virgin olive oil, for drizzling","3 large cloves garlic, minced","1 cup shredded mozzarella (found in dairy aisle)","1 cup shredded provolone (found in dairy aisle)","1/4 cup grated Parmigiano Reggiano or Romano (a handful)","1 (15-ounce) can artichoke hearts in water, drained and thinly sliced","1/4 cup chopped parsley"],"directions":["\n              Preheat oven to 500 degrees F.\n            ","\n              Put the pizza shell or focaccia onto a pizza pan or cookie sheet. Drizzle shell with oil and scatter minced garlic over shell to edges. Cover the pie with a layer of all 3 cheeses combined and work all the way to the edge of the shells. Top with artichoke hearts. Cook 6 to 8 minutes, until cheeses have melted and begin to bubble. Remove from oven and garnish with parsley. Cut pie with pizza wheel or knife into bite-size squares and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/10-minute-white-pizza-recipe-1912206"},{"name":"\n  \n    10-inch French Meat Pie\n  \n","ingredients":["5 1/4 ounces all-purpose vegetable shortening","8 1/4 ounces unbleached pastry flour","1/4 cup plus 2 tablespoons cold tap water","Salt","9 ounces 1/2-inch diced potato","1 pound ground beef","9 ounces finely ground pork","9 ounces 1/4-inch diced onion","1 7/8 teaspoons beef soup base, prepared according to package instructions","3 tablespoons, plus 1 1/2 teaspoons instant potato powder","3/8 teaspoon ground cinnamon","1/4 teaspoon ground nutmeg","1/4 teaspoon granulated garlic","1/4 teaspoon ground black pepper","Egg wash, for topping"],"directions":["\n              For the Dough:\n            ","\n              The dough can be made in advance. You will need 1 pound of dough to make this pie. Blend the shortening, flour and cold water together in the bowl of a stand mixer on low speed, using a dough hook. Mix until well blended. Remove the dough from the bowl, wrap in plastic wrap and put it on a sheet pan. The dough can be stored for up to 1 week in the refrigerator, but allow it to come to room temperature before rolling.\n            ","\n              Cut the dough in half and roll out 1 piece of dough to fit into a 10-inch pie plate. Fit the dough circle into the bottom of the pie pan, pushing it snugly against the edges. Roll out the other piece of dough and set aside until ready to use.\n            ","\n              For the Filling:\n            ","\n              Preheat the oven to 350 degrees F.\n            ","\n              Bring a medium pot of salted water to a boil over medium heat. Add the potatoes and blanch until al dente. Drain and set aside to cool.\n            ","\n              In a large skillet over medium heat, add the beef, pork, and the onions. Brown the meat, then discard the grease. Add the potatoes and moisten the mixture with the beef soup base, as needed. Use the instant potato to tighten the mixture, if needed. Season with cinnamon, nutmeg, garlic, black pepper and 1/4 teaspoon salt.\n            ","\n              Pour the filling into the dough-lined pie plate. Level it off and cover with the remaining circle of dough. Pinch the edges of the bottom layer and top layer of dough together and create the knuckle-like pie edge ridges. Trim off any excess dough using a sharp knife.\n            ","\n              Brush the top of the pie with the egg wash. Make a few slits in the top crust to allow the steam to escape.\n            ","\n              Bake until cooked through and the top of the pie is golden brown, about 45 minutes.\n            ","\n              Remove from the oven and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/10-inch-french-meat-pie-recipe-1949403"},{"name":"\n  \n    100-Calorie Ham and Cheese Individual Frittatas\n  \n","ingredients":["Nonstick cooking spray","2 teaspoons olive oil","6 ounces ham steak, cut in 1/4-inch dice (about 1 1/2 cups)","1 1/2 cups 1/8-inch-thick slices red onion","6 whole large eggs","4 large egg whites","3/4 cup shredded reduced-fat sharp Cheddar","1/4 teaspoon kosher salt","1/4 teaspoon dried thyme leaves"],"directions":["\n              Preheat the oven to 350 degrees F. Coat a 12-cup muffin pan with cooking spray.\n            ","\n              Heat 1 teaspoon of the oil in a large nonstick skillet set over medium-high heat. Add the ham and cook until shrunken and somewhat dried, 2 to 3 minutes. Turn and cook another 2 minutes. Transfer to a bowl.\n            ","\n              Add the remaining 1 teaspoon oil and the onions to the pan and reduce the heat to medium-low. Cook, stirring occasionally, until the onions are translucent and very soft, 11 to 12 minutes.\n            ","\n              Meanwhile, lightly beat the whole eggs and egg whites in a large bowl. Add all but 2 tablespoons of the cheese, the salt and thyme, and whisk until well blended. Stir in the ham and onions. \n            ","\n              Scoop about 1/4 cup of the mixture at a time into the prepared muffin pan, and divide the remaining 2 tablespoons of cheese over the tops. Bake in the center of the oven until a toothpick inserted in the center comes out clean, 22 to 25 minutes. Cool slightly before removing from the pan. Serve warm or at room temperature. \n            "],"source":"https://www.foodnetwork.com/recipes/100-calorie-ham-and-cheese-individual-frittatas-3416166"},{"name":"\n  \n    1000 Calorie Beef Wellington\n  \n","ingredients":["1 (3 1/2-pound) beef tenderloin, cleaned and tied with thin strips of bacon, at room temperature","3/4 pound button mushrooms, chopped fine","2 1/2 tablespoons unsalted butter","Salt","Pepper","1/2 cup heavy cream","1/2 pound pate de foie gras, (available at specialty foods shops) at room temperature","1 pound frozen puff pastry, thawed, plus additional for garnish, if desired","1 large egg, separated","1 teaspoon water","1/2 cup Sercial Madeira","2 teaspoons arrowroot dissolved in 1 teaspoon cold water","1/2 cup beef broth","2 tablespoons finely chopped black truffles (available at specialty food shops) if desired","Watercress, for garnish if desired"],"directions":["\n              Preheat oven to 400 degrees F.\n            ","\n              In a roasting pan roast the beef in the middle of the oven for 25 to 30 minutes, or until an instant read thermometer registers 120 degrees F when inserted into the beef. Let the fillet cool completely and discard the bacon and the strings. Skim the fat from the pan juices and reserve the pan juices.\n            ","\n              In a heavy skillet cook the mushrooms in the butter, salt and pepper over moderately low heat, stirring, until all the liquid they give off is evaporated and the mixture is almost dry. Add heavy cream and cook until cream thickens and coats the back of a spoon, about 5 minutes. Let cool completely.\n            ","\n              Spread the fillet evenly with the pate de foie gras, covering the top and sides, and spread the mushrooms evenly over the pate de foie gras. On a floured surface roll 1 pound of the puff pastry into a 20 by 12-inch rectangle, or large enough to enclose the fillet completely. Slightly beat the egg white in a small bowl and set aside. Beat the egg yolk with the water to make an egg wash and set aside. Invert the coated fillet carefully under the middle of the dough, and fold up the long sides of the dough to enclose the fillet brushing the edges of the dough with some of the egg white to seal them. Fold ends of the dough over the fillet and seal them with the remaining egg white.\n            ","\n              Transfer the fillet, seam side down to a jelly-roll pan or shallow roasting pan and brush the dough with some of the egg wash. Roll out the additional dough and cut out shapes with decorative cutters. Arrange the cutouts on the dough decoratively, brush them with the remaining egg wash, and chill the fillet for at least 1 hour and up to 2 hours.\n            ","\n              Bake the fillet in the middle of a preheated 400 degree F oven for 30 minutes. Reduce the heat to 350 degrees F, and bake the fillet for 5 to 10 minutes more, or until the meat thermometer registers 130 degrees F for medium-rare meat and the pastry is cooked through. Let the fillet stand for 15 minutes. In a saucepan boil the reserved pan juices and the Madeira until the mixture is reduced by 1/4. Add the arrowroot mixture, the broth, the truffles, and salt and pepper, to taste, and cook the sauce over moderate heat, stirring, being careful not to let it boil, for 5 minutes, or until it is thickened. Loosen the fillet from the jelly-roll pan, transfer it with 2 spatulas to a heated platter, and garnish it with watercress. Serve the fillet, cut into 3/4-inch-thick slices, with the sauce.\n            "],"source":"https://www.foodnetwork.com/recipes/1000-calorie-beef-wellington-1939256"},{"name":"\n  \n    109 Chestnut Chicken Sandwich\n  \n","ingredients":["5 or 6 boneless, skinless chicken breasts (about 2 pounds)","2 tablespoons vegetable oil ","1/2 teaspoon dried basil ","1/2 teaspoon dried oregano ","1/4 teaspoon granulated garlic ","Kosher salt and freshly ground black pepper","Olive oil ","1 medium yellow onion, sliced ","1/4 teaspoon dried thyme ","2 cups sliced button mushrooms ","1 cup mayonnaise","1 chipotle chile in adobo, plus 1/4 teaspoon sauce from the can","4 loaves crusty French bread, split and toasted ","8 slices provolone cheese"],"directions":["\n              Preheat oven to 350 degrees F.\n            ","\n              On a baking sheet, rub the chicken breasts with the vegetable oil and sprinkle with the basil, oregano, granulated garlic and 1/4 teaspoon each salt and pepper. Bake until the breasts reach an internal temperature of 160 degrees F on an instant-read thermometer, about 20 minutes. Let cool.\n            ","\n              Meanwhile, heat 3 tablespoons olive oil in a saute pan over medium-high heat. When hot, add the onions, thyme, 1/2 teaspoon salt and 1/4 teaspoon pepper. Cook, stirring often, until the onions are caramelized, 8 to 10 minutes.\n            ","\n              In a separate saute pan, heat another 3 tablespoons olive oil. When hot, add the mushrooms and 1/2 teaspoon each salt and pepper. Saute for 7 minutes.\n            ","\n              Pulse the mayonnaise with the chipotle and sauce in a food processor until blended.\n            ","\n              Slice the cooled chicken breasts as thinly as possible.\n            ","\n              On a baking sheet, make four piles of chicken, caramelized onions and mushrooms. Top each pile with 2 slices of provolone and place in the oven until melted. Transfer the stacks to the toasted bread and top with chipotle mayonnaise.\n            "],"source":"https://www.foodnetwork.com/recipes/109-chestnut-chicken-sandwich-5185146"},{"name":"\n  \n    11-Carton Cake\n  \n","ingredients":["Nonstick cooking spray, for the cake pan","One 6-ounce carton vanilla yogurt (reserve the carton for measuring other ingredients)","One 6-ounce carton vegetable oil ","One 6-ounce carton granulated sugar ","2 large eggs, at room temperature","Two 6-ounce cartons cake flour ","One 6-ounce carton unsweetened cocoa ","1 1/2 teaspoons vanilla extract ","1/2 teaspoon baking soda ","1/2 teaspoon baking powder ","One 6-ounce carton milk ","One 6-ounce carton mini semisweet chocolate chips ","Two 6-ounce cartons confectioners' sugar","1 1/2 sticks (12 tablespoons) salted butter, softened","1/2 teaspoon vanilla extract ","One 6-ounce carton mini semisweet chocolate chips "],"directions":["\n              For the cake: Position an oven rack in the middle of the oven and preheat to 350 degrees F. Spray a 10-inch round cake pan with a layer of nonstick cooking spray.\n            ","\n              To a large mixing bowl, add the yogurt, oil and granulated sugar (using the yogurt carton as the measure) and the eggs; beat together with a hand whisk until everything is incorporated and smooth, 1 to 2 minutes.\n            ","\n              Next, add the cake flour and cocoa using the carton as the measure, then the vanilla, baking soda and baking powder; beat together until incorporated, 1 to 2 minutes more. Add the milk and mini chocolate chips (using the carton) and mix until incorporated.\n            ","\n              Pour the batter into the prepared cake pan and bake until a cake tester inserted into the center of the cake comes out clean, 35 to 40 minutes. Let cool in the cake pan for 30 minutes, then remove the cake to a cooling rack and allow it to cool for another 30 minutes.\n            ","\n              For the vanilla buttercream frosting: Add the confectioners' sugar (measured in the carton), butter and vanilla to the bowl of an electric mixer fitted with a paddle attachment and beat until smooth and creamy, 2 to 3 minutes. Spread over the top of the cooled cake in a thick layer and sprinkle with the mini chocolate chips (measure in the carton).\n            "],"source":"https://www.foodnetwork.com/recipes/ree-drummond/11-carton-cake-5399500"},{"name":"\n  \n    123 Asian Dressing\n  \n","ingredients":["3 tablespoons creamy peanut butter","2 tablespoons brown sugar ","1 tablespoon soy sauce ","Squirt of sriracha, plus more if needed","1 lime, zested and juiced, plus more lime juice, if needed ","For serving: red leaf lettuce, romaine, mandarin oranges and crispy wonton noodles"],"directions":["\n              Mix together the peanut butter, brown sugar, soy sauce, sriracha, lime zest and juice and some hot water in a small bowl until the dressing reaches the desired consistency, adding a bit more hot water or lime juice to thin it out if it's too thick. If you want it more spicy, add some more sriracha.\n            ","\n              Serve over red leaf and romaine lettuce with mandarin oranges and crispy wonton noodles.\n            "],"source":"https://www.foodnetwork.com/recipes/jeff-mauro/123-asian-dressing-3470809"},{"name":"\n  \n    14 Layer Bars\n  \n","ingredients":["1/2 pound butter, melted","1/2 cup crushed graham crackers","1/2 cup crushed vanilla wafers","1/2 cup crushed chocolate graham crackers","1/2 cup shredded sweetened coconut","1/2 cup oats","1/2 cup peanut butter chips","1/2 cup butterscotch chips","1/2 cup chocolate chips","1/2 cup chopped pecans","1/2 cup chopped walnuts","1/2 cup chopped hazelnuts","4-ounces cream cheese, softened","1 (8-ounce) can sweetened condensed milk"],"directions":["\n              Preheat oven to 350 degrees F.\n            ","\n              In an 11 by 15-inch baking pan, layer each ingredient in order written. Dollop cream cheese on top of layers and drizzle sweetened condensed milk on top of everything. Bake in the oven for 25 minutes. Remove from oven and allow to cool before slicing into bars.\n            "],"source":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/14-layer-bars-recipe-1940626"},{"name":"\n  \n    15 Minute Green Veggie Breakfast Tacos\n  \n","ingredients":["½ tablespoon butter","15 small stalks fresh asparagus, chopped into 1-inch pieces","4 eggs, whisked in a bowl","4 corn tortillas","½ avocado cut into 4 slices"],"directions":["\n              In a frying pan placed over a medium flame add in butter and allow to melt. Once butter is melted add in asparagus pieces and saute for 3 minutes or until they turn dark green. \n            ","\n              Pour the whisked eggs over the cooked asparagus and allow to cook for 5 minutes. Stirring occasionally. \n            ","\n              Once eggs are cooked remove from flame. \n            ","\n              Over an open flame, or in a microwave, or on a hot comal, heat the corn tortillas using a pair of tongs to flip the tortilla if heating over an open flame.\n            ","\n              Fill the tortillas with an equal amount of cooked egg mixture. \n            ","\n              Top each taco with a slice of avocado. As an option sprinkle with salt and red pepper. Enjoy! \n            "],"source":"https://www.foodnetwork.com/recipes/15-minute-green-veggie-breakfast-tacos-3414710"},{"name":"\n  \n    15-Minute Asian Rice Salad\n  \n","ingredients":["2-inch piece ginger","1/3 cup extra-virgin olive oil","1/3 cup rice wine vinegar","3 tablespoons soy sauce","4 teaspoons toasted sesame oil","Kosher salt and freshly ground black pepper","6 ounces shiitake mushrooms (about 4 cups), stems removed","2 scallions","1 cup frozen shelled edamame, thawed","4 cups store-bought pre-cooked or leftover brown rice","2 breasts from a rotisserie chicken","1 cup shredded carrots","5 ounces baby arugula"],"directions":["\n              Peel the ginger and finely grate it in to a large mixing bowl. Whisk in the olive oil, vinegar, soy sauce and sesame oil. Season with some salt and pepper. Reserve 2 tablespoons of the dressing and set aside. Thinly slice the mushrooms and scallions, keeping the white and green parts of the scallions separate. Add the sliced mushrooms, scallion whites and the edamame to the dressing in the large mixing bowl. Stir to combine and then marinate at room temperature (the mushrooms will become more tender while they sit in the dressing) while you prepare the rest of the ingredients, stirring occasionally. Reserve the sliced scallion greens to use as garnish.\n            ","\n              Place the rice in a glass mixing bowl and break it up using a fork. Place a damp paper towel directly on top of the rice and place in the microwave; cook until just warmed through and softened, about 3 minutes.\n            ","\n              Meanwhile, remove the skin from the chicken and shred the meat in to large bite-size pieces, about 2 cups. Toss the chicken, warm rice and carrots with the mushrooms and edamame. Season with some salt and pepper.\n            ","\n              Toss the baby arugula and reserved dressing in a large mixing bowl. Season lightly with salt and pepper. Divide the arugula among 4 large plates and top each with 2 cups of the salad mixture. Garnish with the reserved scallion greens.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-asian-rice-salad-3362993"},{"name":"\n  \n    15-Minute Bean, Egg and Avocado Tostadas\n  \n","ingredients":["2 jarred roasted red bell peppers","8 tostada shells","1 cup salsa verde","1 cup shredded Mexican blend cheese","Nonstick cooking spray","8 large eggs","Kosher salt","One 16-ounce can refried black beans","1 ripe avocado"],"directions":["\n              Position an oven rack to the center of the oven and preheat the broiler. Meanwhile, coat 8 cups of the muffin tin generously with cooking spray. Crack an egg into each, sprinkle with salt and broil until the tops are golden brown and the egg whites are set but the yolks are still runny, 4 to 5 minutes (a small knife inserted into the egg helps to check doneness). Remove the muffin tin from the oven and set aside.\n            ","\n              While the eggs are cooking, put the refried beans in a small bowl, cover and microwave until hot, about 2 minutes. Dice the avocado. Slice the roasted red peppers into strips.\n            ","\n              Arrange 2 tostadas on each of 4 plates. Spoon and spread some of the beans on each tostada. Use a small off-set spatula or spoon to scoop out the eggs from the muffin tin and place one, browned-side down, on top of each tostada. Spoon salsa verde over each egg and top with roasted pepper, avocado and cheese.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-bean-egg-and-avocado-tostadas-3362981"},{"name":"\n  \n    15-Minute Broiled Salmon and Broccoli\n  \n","ingredients":["One 12-ounce bag broccoli florets","2 tablespoons extra-virgin olive oil","Kosher salt and freshly ground black pepper","2 scallions","1 medium lemon","1/4 cup mayonnaise ","2 tablespoons Dijon mustard","Four 6-ounce center-cut skinless salmon fillets"],"directions":["\n              Preheat the broiler and set a rack 2 inches from the heat.\n            ","\n              On a large sheet tray lined with aluminum foil, toss the broccoli with the olive oil and a large pinch of salt and pepper. Spread the broccoli out into a singer layer. Broil the broccoli while you prepare the salmon.\n            ","\n              Thinly slice the scallions and finely grate the lemon zest, then add them to a small bowl with the mayonnaise, Dijon mustard and a pinch of salt and pepper. Whisk to combine. \n            ","\n              Remove the broccoli from the oven. (Parts of the broccoli should be lightly charred.) Use a spatula to stir the broccoli and move it to the outer edges of the baking sheet. Sprinkle each fillet all over with salt and pepper and place them in the center of the baking sheet. Divide the mayonnaise mixture on top of the fillets, spreading to cover. Broil, rotating the pan halfway through, until the sauce has turned deep golden brown and the salmon is opaque, about 5 minutes. Meanwhile, cut half of the zested lemon into wedges. \n            ","\n              Divide the salmon, broccoli and lemon wedges among 4 plates and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-broiled-salmon-and-broccoli-3676438"},{"name":"\n  \n    15-Minute Cheesy Polenta with Chunky Tomato Ragu\n  \n","ingredients":["1 1/2 cups whole milk","Kosher salt","6 tablespoons extra-virgin olive oil","1/2 pound mild Italian sausage, casings removed","1 small yellow onion","1 1/2 cups baby carrots","2 cloves garlic ","1 cup quick-cooking polenta  ","2 tablespoons unsalted butter","1 1/2 cups shredded Italian cheese blend ","One 28-ounce can diced tomatoes","Pinch crushed red pepper flakes, or more to taste","6 cups spring greens mix","1 small lemon "],"directions":["\n              Place a large high-sided skillet over medium-high heat. Combine the milk, 3 1/2 cups water and a large pinch of salt in a medium saucepan, cover and set it over medium-high heat.\n            ","\n              When the large skillet is hot, add 2 tablespoons of the oil and swirl the pan to coat. Add the sausage and cook, using a wooden spoon to break up the meat, until lightly browned in parts, about 3 minutes. Meanwhile, cut the onion into large chunks. \n            ","\n              Add the onion, carrots and garlic to a food processor and pulse until finely chopped. Add 2 tablespoons of olive oil, the vegetables and a large pinch of salt to the pan with the sausage and cook until the vegetables are slightly softened, about 3 minutes.\n            ","\n              By this time, the milk and water mixture should be at a strong simmer. Whisk in the polenta and lower the heat to medium-low. Cook, stirring frequently, until the polenta is thickened and creamy, about 3 minutes. Stir in the butter and cheese and season with additional salt if needed. Remove from the heat and cover to keep warm. \n            ","\n              When the vegetables are slightly softened, stir in the tomatoes and red pepper flakes. Cook, uncovered, stirring occasionally, until the vegetables are completely tender and the juice from the tomatoes has reduced slightly, 6 to 8 minutes. Season to taste with additional salt and red pepper flakes if desired.  \n            ","\n              Divide the polenta (if the polenta is too thick, whisk in 1/4 to 1/2 cup warm water to thin it out) among 4 bowls and top with the chunky tomato ragu. Toss the greens in a large bowl with the remaining olive oil, a squeeze of lemon juice, and some salt and pepper and serve on the side. \n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-cheesy-polenta-with-chunky-tomato-ragu-3676444"},{"name":"\n  \n    15-Minute Chicken Scaloppini with Artichokes\n  \n","ingredients":["Kosher salt and freshly ground black pepper","1 cup all-purpose flour","4 chicken cutlets (about 4 ounces each)","1/4 cup extra-virgin olive oil","1/2 bunch fresh flat-leaf parsley","8 ounces angel hair pasta","9 ounces frozen artichoke hearts, thawed","2 tablespoons capers in brine","1/2 cup dry white wine","1/2 cup chicken stock","4 tablespoons unsalted butter"],"directions":["\n              Position an oven rack in the center of the oven and preheat to 450 degrees F.\n            ","\n              Place a large saute pan over medium-high heat and fill a second large saute pan halfway with warm water and set over high heat. Add a very large pinch of salt to the water and cover with a lid.\n            ","\n              Put the flour and a large pinch of salt and pepper into a large resealable plastic bag. Sprinkle the chicken cutlets generously with salt and pepper and place them in the bag, then close it tightly and give it a few shakes to coat the chicken completely. \n            ","\n              Pour the olive oil into the hot pan and let it warm up for 30 seconds. Shake excess flour from the cutlets and add them one at a time to the hot oil. Cook until lightly browned on both sides, about 4 minutes total. While the chicken is cooking, tear off the leaves from the parsley and roughly chop; reserve. Transfer the chicken to a baking sheet lined with a rack and place in the oven to finish cooking while you prepare the rest of the meal. \n            ","\n              At this point, the salted water should be at a full boil. Put the pasta into the water and cook, uncovered, until al dente, about 3 minutes.\n            ","\n              Meanwhile, add the artichokes and capers to the same pan that the chicken was cooked in and use a wooden spoon to scrape up any browned bits at the bottom of the pan. Stir in the white wine and chicken stock and cook until the liquid is reduced by almost half, about 3 minutes. Stir in 2 tablespoons of the butter until melted. Turn off the heat and reserve.\n            ","\n              Drain the cooked pasta and add to a large bowl along with the chopped parsley and remaining 2 tablespoons butter. Stir gently until the butter is melted and season to taste with salt and pepper. Transfer the chicken to a serving platter and spoon the artichokes and sauce on top. Serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-chicken-scaloppini-with-artichokes-3676435"},{"name":"\n  \n    15-Minute Chicken, Rice and Grape Salad\n  \n","ingredients":["3 cups store-bought frozen precooked or leftover brown rice","1/2 cup 2 percent Greek yogurt","2 tablespoons olive oil","1 teaspoon lemon zest, plus 2 tablespoons lemon juice","1 tablespoon mayonnaise","1 small shallot, roughly chopped","1 small clove garlic, roughly chopped","Kosher salt and freshly ground black pepper","1/2 cup walnut pieces ","1/2 rotisserie chicken, skin removed and meat shredded (about 3 cups)","2 cups small seedless red grapes","1/2 cup loosely packed flat-leaf parsley leaves","4 cups loosely packed baby spinach"],"directions":["\n              Put the frozen rice in a medium glass mixing bowl, and break it up using a fork. Drape a damp paper towel directly over the rice, and microwave until the rice is warmed through and softened, 2 to 3 minutes.\n            ","\n              Meanwhile, puree the yogurt, oil, lemon zest and juice, mayonnaise, shallots, garlic, 1 1/2 teaspoons salt and a few grinds of pepper in a small food processor or a blender until smooth. Toast the walnuts in a small skillet over medium heat until fragrant and just starting to brown, about 2 minutes.\n            ","\n              Combine the chicken, grapes, parsley and spinach in a large bowl, and toss with half the dressing. Add the warmed rice and toasted walnuts, toss again and serve with the remaining dressing.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-chicken-rice-and-grape-salad-3363103"},{"name":"\n  \n    15-Minute Grilled Skirt Steak with Pesto Butter\n  \n","ingredients":["1 1/2 pounds skirt steak","3 tablespoons canola oil","Kosher salt and freshly ground black pepper","1/4 cup store-bought basil pesto ","4 tablespoons unsalted butter, softened","1 pound thin asparagus (see Cook's Note)"],"directions":["\n              Preheat a large cast-iron grill pan over high heat for 2 minutes. Cut the skirt steak into 4 even pieces, rub with half of the oil and sprinkle liberally with salt and pepper. Cook, turning once, until charred on both sides and at the desired doneness, 6 to 10 minutes for medium-rare (depending on thickness).\n            ","\n              Meanwhile, whisk together the pesto, butter and a pinch of salt and pepper in a small bowl. \n            ","\n              Trim the ends of the asparagus. Toss the asparagus with the remaining oil and a large pinch of salt and pepper. Transfer the steaks to a cutting board to rest for a few minutes. Working in batches if necessary, place the asparagus in a single layer on the grill pan and cook, turning once, until charred in spots and crisp-tender, about 2 minutes.\n            ","\n              Divide the steaks and asparagus among 4 plates; top each steak with a dollop of the pesto butter. Serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-grilled-skirt-steak-with-pesto-butter-3676443"},{"name":"\n  \n    15-Minute Indian Curry with Chicken and Peas\n  \n","ingredients":["1 small yellow onion","2 tablespoons canola oil","Kosher salt ","2 cloves garlic","2 tablespoons tomato paste","1 1/2 teaspoons curry powder","1 1/2 teaspoons garam masala ","1 1/2 cups chicken stock","1 pound chicken tenders ","1 cup frozen peas, thawed","1/2 cup full-fat plain Greek yogurt ","4 pieces naan bread, warmed"],"directions":["\n              Place a large straight-sided skillet over medium-high heat. While the pan heats up, finely chop the onion, about 1 heaping cup. Add the canola oil to the pan and swirl to coat. Add the onion and a large pinch of salt and cook, stirring occasionally, until lightly browned, about 3 minutes. Meanwhile, finely grate the garlic into the tomato paste and add to the onions along with the curry powder, garam masala and 1/4 cup water. Stir to combine and cook for 1 minute, stirring constantly. Stir in the chicken stock and bring to a strong simmer. Cut the chicken tenders in half crosswise, sprinkle liberally with salt and stir into the sauce. Cook, stirring occasionally, until the chicken is just cooked through, about 5 minutes.\n            ","\n              Reduce the heat to a low simmer and stir in the peas and 1/4 cup yogurt. Cook until the peas are just warmed through, about 1 minute. Season to taste with additional salt if needed. Divide among 4 bowls. Top each with the remaining yogurt and serve with warm naan bread.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-indian-curry-with-chicken-and-peas-3676442"},{"name":"\n  \n    15-Minute Meatloaf Melts\n  \n","ingredients":["1 shallot","1 pound meat loaf mix or ground beef","1/2 cup plain breadcrumbs","1/3 cup ketchup","1 large egg, lightly beaten","1 tablespoon Worcestershire sauce","Kosher salt and freshly ground black pepper","4 slices provolone or Swiss cheese","1-pound bag frozen cut green beans","2 tablespoons unsalted butter","4 potato hamburger buns, split","3 tablespoons mayonnaise","4 lettuce leaves"],"directions":["\n              Preheat the broiler.\n            ","\n              Grate the shallot over a large bowl. Add the meat loaf mix, breadcrumbs, half the ketchup, egg, Worcestershire sauce, 1 teaspoon salt and several grinds of pepper. Use your hands to thoroughly combine the mixture, then divide it into 4 equal balls and shape each into a patty a little less than 1/2 inch thick. Arrange on a baking sheet and broil until the tops of the patties begin to firm up and brown, 3 to 4 minutes. Flip the patties with a metal spatula and continue to broil until cooked through, 2 to 3 minutes more.\n            ","\n              Brush each patty with some of the remaining ketchup and top each with a slice of cheese. Continue to broil until the cheese melts, about 30 seconds more.\n            ","\n              While the patties broil, put the green beans, butter, 1 tablespoon water, 1/2 teaspoon salt and a few grinds of pepper in a medium microwave-safe bowl. Cover and microwave until hot, 4 to 5 minutes.\n            ","\n              Open the buns and spread the cut sides with mayonnaise. Place a lettuce leaf and patty in each. Serve each sandwich with a small bowl of green beans.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-meat-loaf-melts-3362996"},{"name":"\n  \n    15-Minute Shrimp Tacos with Spicy Chipotle Slaw\n  \n","ingredients":["1 pound medium (26/30) peeled and deveined shrimp, tails removed","2 teaspoons chili powder","Kosher salt","2 tablespoons canola oil","4 scallions, thinly sliced","One 15-ounce can black beans, drained and rinsed well","1/3 cup prepared chipotle mayonnaise ","2 limes, 1 zested and juiced and 1 cut into wedges ","One 14-ounce bag store-bought coleslaw mix (about 6 cups)","1 bunch fresh cilantro, leaves and soft stems roughly chopped","Sour cream or Mexican crema, for serving","8 corn tortillas, warmed "],"directions":["\n              Heat a large cast-iron skillet over medium-high heat. Combine the shrimp, chili powder and a large pinch of salt in a medium bowl and stir to combine. Add the canola oil to the hot skillet and swirl to coat. Add the shrimp and cook until the shrimp is no longer opaque and just cooked through, turning only once, about 2 minutes. Transfer the shrimp to a serving bowl and cover loosely with foil to keep warm.\n            ","\n              Stir 2 tablespoons of water into the skillet with the dripping, using a wooden spoon or heat-proof spatula to scrape up any browned bits at the bottom of the skillet. Reserve 1 tablespoon scallions for garnish and add the rest to the skillet. Cook until the scallions are slightly softened, stirring frequently, about 1 minute. Add the beans and a large pinch of salt and cook until warmed through, about 1 minute. Turn off the heat and reserve.\n            ","\n              In a large bowl, stir together the chipotle mayonnaise, lime zest and juice and a large pinch of salt. Add the coleslaw mix and half of the cilantro and stir to combine.\n            ","\n              Serve the shrimp alongside the beans, coleslaw, remaining cilantro, scallions, sour cream or Mexican crema, lime wedges and warm tortillas.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-shrimp-tacos-with-spicy-chipotle-slaw-3676441"},{"name":"\n  \n    15-Minute Stir-fried Steak Tacos\n  \n","ingredients":["1 pound skirt steak","1 tablespoon chili powder","1/2 teaspoon dried oregano","1/4 teaspoon sugar","Kosher salt and freshly ground black pepper","Eight 6-inch corn tortillas","1 tablespoon vegetable oil","1 medium red onion, halved and cut into 1/4-inch-thick slices ","Sour cream, guacamole, salsa verde, pico de gallo and shredded Mexican-blend cheese, for serving"],"directions":["\n              Cut the steak along the grain into 3-inch pieces, then slice each piece across the grain into 1/3-inch-thick strips. Toss the steak in a medium bowl with the chili powder, oregano, sugar, 3/4 teaspoon salt and a few grinds of pepper.\n            ","\n              Heat a large nonstick skillet over high heat. Meanwhile, wrap the tortillas in a clean dishtowel, and microwave at 100 percent for 1 minute. Let sit, wrapped in the dishtowel, until ready to serve.\n            ","\n              When the skillet is hot, add the oil. Add the seasoned steak in an even layer. Don't stir for 2 minutes, then give the steak a good stir and let cook until browned, about 1 1/2 minutes more. Transfer the steak to a medium bowl. Immediately add the onions to the skillet, and stir until brown and slightly softened, about 1 1/2 minutes; transfer to the bowl with the steak, and stir to combine.\n            ","\n              Set up a taco bar with the steak and onions, wrapped tortillas, sour cream, guacamole, salsa verde, pico de gallo and cheese.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-stir-fried-steak-tacos-3362965"},{"name":"\n  \n    15-Minute Tofu and Vegetable Stir-Fry\n  \n","ingredients":["4 cups frozen cooked brown rice","1-inch piece ginger","1/4 cup low-sodium soy sauce","1 to 2 tablespoons garlic chili sauce","1 tablespoon toasted sesame oil","12 ounces baked tofu","3 tablespoons canola oil","One 3.5-ounce package sliced shiitake mushrooms (about 2 cups)","One 1-pound package fresh stir-fry vegetable mix (not frozen)","Kosher salt","1/2 cup roasted and salted cashew halves and pieces"],"directions":["\n              Prepare the rice according to the package directions. Peel and finely grate the ginger and put it into a small baking dish or medium bowl along with the soy sauce, garlic chili sauce and sesame oil. Whisk to combine.\n            ","\n              Place a large saute pan over medium-high heat. Cut the baked tofu into 1-inch-by-1/2-inch pieces and add to the marinade. Stir to combine and reserve. Fill a small measuring cup or bowl with cold water and keep by the stovetop.\n            ","\n              Add the canola oil to the hot pan and swirl to coat. Add the shiitake mushrooms and cook until tender and browned in spots, stirring frequently, about 2 minutes. Add the stir-fry vegetable mix and a large pinch of salt. Cook until crisp tender, 3 to 5 minutes (the cooking time will depend on the size of the vegetables in the mix). If at any time the pan seems too hot, stir in 1 to 2 tablespoons water. Add the marinated tofu to the vegetables along with 2 tablespoons water. Cook until the tofu is warmed through, 1 to 2 minutes. \n            ","\n              Transfer the stir-fry to a large platter. Scatter the cashews on top and serve alongside the rice.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/15-minute-tofu-and-vegetable-stir-fry-3676440"},{"name":"\n  \n    16 Min-estrone\n  \n","ingredients":["Kosher salt","2 quarts low-sodium chicken stock ","2 tablespoons olive oil ","1 1/2 pounds boneless, skinless chicken breasts, cut into 1/2- to 1-inch pieces ","Freshly ground black pepper ","8 ounces ditalini pasta","2 stalks celery, finely diced","1 yellow bell pepper, finely diced","1 onion, finely diced","1 carrot, finely diced","1 zucchini, diced","1 teaspoon red pepper flakes ","One 28-ounce can diced tomatoes, with the juice ","One 15-ounce can white beans, drained and rinsed ","One 15-ounce can kidney beans, drained and rinsed ","1 teaspoon dried basil ","1 teaspoon dried oregano ","Chopped fresh parsley, for serving","Jarred pesto, for serving","Grated Parmesan, for serving "],"directions":["\n              Add water and salt to a pot for pasta and bring to a boil. Add the stock to a pot and heat over medium-high heat until hot.\n            ","\n              Put a large pot over medium heat and add the olive oil. Add the chicken, sprinkle with salt and pepper and cook, stirring, until the chicken begins to brown, 2 to 3 minutes.\n            ","\n              Meanwhile, add the pasta to the boiling water and cook according to the package instructions.\n            ","\n              Add the celery, bell pepper, onion, carrot and zucchini to the pot with the chicken. Add the red pepper flakes and season with salt and pepper. Cook until the vegetables begin to soften, 2 to 3 minutes. Add the tomatoes, beans, basil, oregano and hot stock. Bring to a boil and simmer for 5 minutes. Taste and adjust the seasoning with salt and pepper.\n            ","\n              Drain the pasta and add it to the soup. Stir in the chopped parsley. Serve with a dollop of pesto and a sprinkling of Parmesan.\n            "],"source":"https://www.foodnetwork.com/recipes/ree-drummond/16-min-estrone-5617669"},{"name":"\n  \n    16-Minute Greek Feast To Go\n  \n","ingredients":["1/2 cup extra-virgin olive oil","1/4 cup red wine vinegar ","1 teaspoon sugar ","1 teaspoon dried oregano ","1/2 teaspoon red pepper flakes ","Kosher salt and freshly ground black pepper","2 boneless, skinless chicken breasts, cut into strips ","1 English cucumber, peeled, seeded and sliced ","1 pint cherry tomatoes, sliced in half ","1/2 red onion, finely sliced ","4 ounces feta cheese, cut into cubes ","1 cup kalamata olives, for serving","4 pita breads, for serving","Roasted Red Pepper Hummus, recipe follows","Three 14.5-ounce cans chickpeas, rinsed and drained","1/3 cup plus 1 tablespoon tahini ","1/2 teaspoon ground cumin, or more to taste ","3 cloves garlic, chopped, or more to taste ","2 jarred roasted red peppers ","1/2 lemon, juiced ","Kosher salt","1 tablespoon olive oil "],"directions":["\n              Soak the skewers in water and heat a grill pan over medium to medium-high heat while you make the dressing.\n            ","\n              In a jar, add the olive oil, vinegar, sugar, oregano, red pepper flakes and some salt and pepper. Shake to combine. Pour half the dressing over the chicken strips in a bowl and stir to combine.\n            ","\n              In another bowl, add the cucumber, tomatoes and red onion. Pour the remaining dressing over and stir gently.\n            ","\n              Thread the chicken strips onto the skewers. Grill until cooked through and charred, 3 to 4 minutes per side. Remove and let cool.\n            ","\n              Top the salad with the feta cheese. Serve with the chicken skewers, olives, pita bread and Roasted Red Pepper Hummus.\n            ","\n              Add the chickpeas to a food processor with the tahini, cumin, garlic, red peppers, lemon juice and some salt. Pulse until the mixture is smooth and combined but do not overmix. Add 3 to 5 tablespoons water as necessary to facilitate blending. At the end, add the olive oil and pulse no more than 3 times to incorporate.\n            "],"source":"https://www.foodnetwork.com/recipes/ree-drummond/16-minute-greek-feast-to-go-3355691"},{"name":"\n  \n    1770 House Meatloaf\n  \n","ingredients":["1 pound ground veal (preferably naturally-raised)","1 pound ground pork (preferably naturally-raised Berkshire)","1 pound ground beef (preferably naturally-raised)","1 tablespoon chopped, fresh chives, plus 1 teaspoon for the sauce","1 tablespoon chopped, fresh thyme leaves, plus 1 teaspoon for the sauce","1 tablespoon chopped, fresh Italian parsley, plus 1 teaspoon for the sauce","3 large eggs (preferably organic)","1 1/3 cups finely ground Panko","2/3 cup whole milk (preferably hormone- and antibiotic-free)","2 tablespoon kosher salt","1 tablespoon freshly ground black pepper","Olive oil","2 stalks of celery, finely diced","1 large Spanish onion, finely diced","2 cups chicken or beef stock","8 to 10 cloves roasted garlic","3 tablespoons butter, at room temperature"],"directions":["\n              Preheat the oven to 350 degrees.\n            ","\n              Place the veal, pork, beef, chives, thyme, parsley, eggs, Panko, milk, salt and pepper in a large mixing bowl.\n            ","\n              Heat a medium saute pan over medium-high heat and film it with extra-virgin olive oil. When the oil is hot, add the celery and onion to the pan and cook, stirring, until softened. Remove the celery and onion from the pan and let cool. When the mixture is cool, add it to the mixing bowl with the other ingredients.\n            ","\n              Using clean hands, mix the ingredients until well combined and everything is evenly distributed. Place a piece of parchment paper on a sheet pan (it should have sides at least 1 1/2 inches high to prevent grease runoff from the pan). Place the meat on the sheet pan and pat it and punch it down to remove any air pockets. Shape the meat into a loaf (about 14 1/2 inches long by 5 inches wide by 2 inches high). Place the sheet pan in the oven and bake 40 to 50 minutes or until a meat thermometer indicates an internal temperature of 155 to 160 degrees. Remove the meatloaf from the oven and let it rest for 10 minutes.\n            ","\n              Meanwhile, for the sauce, combine the broth, roasted garlic and butter over medium-high heat and simmer for about 10 to 15 minutes, or until lightly thickened. Add 1 teaspoon of each of the chopped thyme, chives and parsley. Slice the meatloaf into serving portions and spoon the hot sauce over the meatloaf and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/1770-house-meatloaf-recipe-2012775"},{"name":"\n  \n    1770 House Meatloaf\n  \n","ingredients":["2 tablespoons good olive oil","2 cups chopped Spanish onion (1 large)","1 1/2 cups small-diced celery (2 stalks)","1 pound ground beef","1 pound ground veal","1 pound ground pork","1 tablespoon chopped fresh flat-leaf parsley","1 tablespoon chopped fresh thyme leaves","1 tablespoon chopped fresh chives","3 extra-large eggs, lightly beaten","2/3 cup whole milk","2 tablespoons kosher salt","1 tablespoon freshly ground black pepper","2 1/2 cups panko (Japanese bread flakes)","Garlic Sauce, recipe follows","3/4 cup good olive oil","10 garlic cloves, peeled","2 cups chicken stock, preferably homemade","3 tablespoons unsalted butter, at room temperature","Kosher salt and freshly ground black pepper"],"directions":["\n              Preheat the oven to 350 degrees F. \n            ","\n              Heat the olive oil in a large (12-inch) saute pan over medium heat. Add the onion and celery and cook for 5 to 7 minutes, stirring occasionally, until the onion is translucent but not browned. Set aside to cool slightly. \n            ","\n              Place the beef, veal, pork, parsley, thyme, chives, eggs, milk, salt and pepper in a large mixing bowl. Put the panko in a food processor fitted with the steel blade and process until the panko is finely ground. \n            ","\n              Add the onion mixture and the panko to the meat mixture. With clean hands, gently toss the mixture together, making sure it's combined but not compacted. \n            ","\n              Place a piece of parchment paper on a sheet pan. Pat the meat into a flat rectangle and then press the sides in until it forms a cylinder down the middle of the pan (this will ensure no air pockets). Bake for 40 to 50 minutes, until a thermometer inserted in the middle reads 155 degrees F to 160 degrees F. Remove from the oven and allow to rest for 10 minutes. Slice and serve hot with the Garlic Sauce.\n            ","\n              Combine the oil and garlic in a small saucepan and bring to a boil. Lower the heat and simmer for 10 to 15 minutes, until lightly browned. Be careful not to burn the garlic or it will be bitter. Remove the garlic from the oil and set aside. (I save the oil for vinaigrettes.) \n            ","\n              Combine the chicken stock, butter and cooked garlic in a medium saucepan and bring to a boil. Lower the heat and cook at a full boil for 35 to 40 minutes, until slightly thickened. Mash the garlic with a fork, whisk in 1/2 teaspoon salt and 1/4 teaspoon pepper, and taste for seasonings. Spoon the warm sauce over the meatloaf.\n            "],"source":"https://www.foodnetwork.com/recipes/ina-garten/1770-house-meatloaf-recipe-2109034"},{"name":"\n  \n    18th Century recipes for Onion Pie and French Canadian Pea Soup\n  \n","ingredients":["Yeast dough, for crust homemade or store bought","4 cups diced onions","3 tablespoons butter or safflower oil","2/3 cup diced slab bacon","4 large eggs","1 cup sour cream or yogurt","1 teaspoon caraway seeds","1 pound yellow peas","1/2 pound salt pork or ham bone","2 3/4 quarts water","3 onions","2 carrots, diced into small cubes","2 to 3 bay leaves","1 teaspoon savory","Salt and pepper"],"directions":["\n              Prepare yeast dough and let rise. Put onions and oil in heavy pot or skillet, cover, and cook over medium heat until soft and beginning to brown (about 15 minutes). Fry bacon, drain, and reserve.\n            ","\n              Preheat oven to 375 degrees F.\n            ","\n              Press down raised crust dough and roll out to 1/4-inch thick. Line an 8 1/2 by 14-inch pan with the dough. Roll the edges down and tuck under to form an even 2-inch rim. Let crust recover about 15 minutes. Then spread bacon and onions evenly over the bottom. Beat the eggs until lemon colored and combine with sour cream. Spread over onions. Scatter caraway seeds on top. Bake for 30 to 40 minutes.\n            ","\n              For the French Canadian Pea Soup: Soak peas overnight and drain. Put all ingredients into the pot. Bring to a boil for 2 minutes. Remove and let stand 1 hour. Put back onto the heat and bring to a boil. Lower heat, cover, and simmer 1 hour or more until peas are tender. Add salt and pepper. Reheat before serving. Usually tastes better second time around.\n            "],"source":"https://www.foodnetwork.com/recipes/18th-century-recipes-for-onion-pie-and-french-canadian-pea-soup-recipe-1939999"},{"name":"\n  \n    1905 Salad\n  \n","ingredients":["1/2 head iceberg lettuce, shredded","2 ripe tomatoes, cut in eighths","2 stalks celery, sliced","1/2 cup Swiss cheese, cut in julienne strips","1/2 cup ham, cut in julienne strips (or turkey or shrimp)","1/4 cup green Spanish olives, pitted","4 cloves garlic, minced","1 teaspoon oregano","1 teaspoon Worcestershire sauce","1/2 cup extra-virgin Spanish olive oil","1/8 cup white wine vinegar","2 teaspoons lemon juice","Salt and pepper, to taste","2 teaspoons grated Romano"],"directions":["\n              In a large bowl, mix together the iceberg lettuce, cut tomatoes, celery stalks, Swiss cheese, ham, and Spanish olives.\n            ","\n              Mix garlic, oregano, and Worcestershire sauce in a bowl. Beat until smooth with a wire whisk. Add olive oil, gradually beating to form an emulsion. Stir in vinegar and lemon juice and season with salt and pepper. Add dressing to salad and toss well. Add Romano and toss again.\n            "],"source":"https://www.foodnetwork.com/recipes/bobby-flay/1905-salad-recipe-1910304"},{"name":"\n  \n    1946 Apple Buckwheat Pancakes\n  \n","ingredients":["2 cups of your favorite pancake mix","1/4 cup buckwheat pancake mix","1 1/4 cups water","1 Granny Smith apple, diced","Butter and maple syrup"],"directions":["\n              Heat pan or griddle. Stir together pancake mixes and water and let stand for 5 minutes. Ladle about 3 ounces of batter on griddle and distribute apple over exposed side. Turn when bubbles start to break, taking care not to pat the pancakes. Cook until they spring back when touched. Serve with butter and your favorite maple syrup.\n            "],"source":"https://www.foodnetwork.com/recipes/1946-apple-buckwheat-pancakes-recipe-1913312"},{"name":"\n  \n    19th Hole Nectarines with Lemon Cream\n  \n","ingredients":["1/2 cup brandy","6 nectarines, skin left on, halved, pit removed","1 tablespoon sugar, to flambe","1/2 cup milk","1/2 cup heavy cream","1 vanilla pod or 3 teaspoons vanilla extract","1 tablespoon lemon liqueur or 3 teaspoons lemon extract (recommended: Limoncello)","1/4 cup sugar, for lemon cream","4 egg yolks","1 tablespoon finely grated lemon zest","1 pint blackberries"],"directions":["\n              Pour brandy over nectarines and soak for about 30 minutes.\n            ","\n              For the lemon cream: Pour the milk and heavy cream into a heavy bottomed saucepot and add vanilla and lemon liqueur. Add half the sugar to the pot and bring to a simmer (just below a boil). In a small bowl whisk together the egg yolks and the rest of the sugar and temper it by adding a small amount of the heated milk mixture to the bowl while whisking constantly (known as a liaison). Now pour the liaison (egg mixture) into the milk pot, stirring constantly. You are only heating it. Do not boil. Do not cook. The idea of a liaison is to incorporate the eggs and avoid making them into scrambled eggs! You want the mixture to begin to thicken so it will coat the back of a spoon. Remove from heat and whisk in lemon zest, and allow to cool, then remove vanilla pod and discard, and refrigerate until chilled.\n            ","\n              Place nectarines cut side up in a pan and sprinkle with 1 tablespoon sugar. Spoon brandy around nectarines, cover and heat nectarines and brandy briefly. Then remove cover and spoon warmed brandy over nectarines. * Remove from the heat and ignite with a long match to flambe. Alternatively, you can grill the brandy soaked nectarines until they begin to caramelize. Allow nectarines to cool to room temperature.\n            ","\n              Place 2 nectarines on each serving dish, and top with lemon cream and blackberries.\n            "],"source":"https://www.foodnetwork.com/recipes/robert-irvine/19th-hole-nectarines-with-lemon-cream-recipe-1949689"},{"name":"\n  \n    2 Alarm Tofu Dip\n  \n","ingredients":["1 pint silken tofu","1/2 small shallot, minced","1 teaspoon curry powder, or to taste","Dash hot pepper sauce","Pita chips as an accompaniment"],"directions":["\n              In a small bowl stir together the tofu, shallot, curry powder and hot pepper sauce. Refrigerate for at least 1 hour. Serve with pita chips.\n            "],"source":"https://www.foodnetwork.com/recipes/2-alarm-tofu-dip-recipe-1965139"},{"name":"\n  \n    2 Terrific Salad Sides: 3 Bean Salad and Potato Salad with Sweet Red Pepper and Onion\n  \n","ingredients":["16 new red potatoes","Coarse salt, for boiling water","1 red bell pepper, seeded and chopped","1/2 red onion, chopped","1/4 cup chopped fresh mint, a couple of handfuls","1/4 cup chopped flat-leaf parsley, a couple of handfuls","3 tablespoons red wine vinegar, eyeball the amount","1/3 cup extra virgin olive oil, eyeball the amount","Salt and freshly ground black pepper","1/2 pound fresh green beans, washed and cut into 1/3","2 rounded teaspoons Dijon mustard","2 teaspoons sugar","1/4 cup red wine vinegar, eyeball the amount","1/2 cup extra-virgin olive oil, eyeball the amount","1 (15-ounce) cans red kidney beans, rinsed and drained","1 (15-ounce) can garbanzo beans, rinsed and drained","1/4 cup flat-leaf parsley, chopped","Salt and freshly ground black pepper"],"directions":["\n              Place red potatoes in a pot and cover with water. Place pot on stove, cover and bring to a boil. Liberally salt water with coarse salt. Place a colander over boiling pot. Take your first ingredient from the bean salad, 1/2 pound cut fresh green beans, and place them in the colander. Cover the colander with pot lid. Steam beans 5 minutes while potatoes boil below. Remove beans and cold shock under running water. Drain green beans and set aside.\n            ","\n              When the potatoes are just tender, about 12 minutes, remove from heat, turn off burner, drain potatoes and cold shock them under running water until just cool enough to handle. Coarsely chop potatoes and return them to the warm pot. Add peppers, onions, mint, parsley and vinegar to the pot. Toss to allow the vinegar to absorb into the potatoes. Add oil and stir the potatoes until they mash up a bit and salad has a spoonable consistency. Season with salt and pepper, to taste, and transfer to a serving bowl.\n            ","\n              In a bowl, combine mustard, sugar and vinegar. Whisk in oil. Add kidney beans, garbanzo beans, green beans and parsley to the bowl and toss to coat bean salad evenly with dressing. Season salad with salt and pepper, to taste, and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/2-terrific-salad-sides-3-bean-salad-and-potato-salad-with-sweet-red-pepper-and-onion-recipe-1940761"},{"name":"\n  \n    2 Tomato Basil Bruschettas\n  \n","ingredients":["1 thick baguette, about 22-inches long, end trimmed, loaf angle cut into 36 1/2-inch slices","1/3 cup olive oil","2 large ripe tomatoes, about 1 pound total, trimmed, seeded and diced (1/4-inch)","1/4 cup finely chopped fresh basil","2 tablespoons drained small (nonpareil) capers","1 tablespoon cold pressed extra virgin olive oil","1 tablespoon minced lemon zest","2 garlic cloves, peeled and crushed through a press","Salt and freshly ground pepper","2 large ripe yellow tomatoes, (1 pound), trimmed, seeded and diced (1/4-inch)","3 ounces smoked mozzarella, diced (1/4-inch), at room temperature","1/4 cup chopped drained pimento stuffed green olives","1/4 cup chopped fennel bulb","1/4 cup finely chopped fresh basil","1 tablespoon cold pressed extra virgin olive oil","2 garlic cloves, peeled and crushed through a press","Salt and freshly ground black pepper"],"directions":["\n              Adjust the seasoning on both tomato mixtures. Serve them, accompanied by the grilled bread slices, letting guests top their bruschettas to taste.;\n            "],"source":"https://www.foodnetwork.com/recipes/2-tomato-basil-bruschettas-recipe-1965152"},{"name":"\n  \n    2 for 1 Pork and Ginger Potstickers\n  \n","ingredients":["2 cups chopped napa cabbage","1/2 tablespoon salt","1/2 pound ground pork (Don't get lean pork, the fat is good for juicy and flavorful dumplings)","2 tablespoons minced ginger","1 1/2 tablespoons minced garlic","2 tablespoons thin soy sauce","3 tablespoons sesame oil","1 egg","1 to 2 cups chicken stock or water","4 cups all-purpose flour","1/2 teaspoon salt","1 1/2 to 1 3/4 cups boiling water"],"directions":["\n              For the filling: Sprinkle cabbage with the 1/2 tablespoon of salt and let stand for 30 minutes. Place the cabbage on a clean dishtowel or cheesecloth and squeeze out any water. The dryer the cabbage the better. In a large bowl thoroughly mix the cabbage with all of the other ingredients, except the chicken stock. Cook a tester to check the seasoning.\n            ","\n              For the dough: In a stainless steel bowl mix flour and salt. Slowly add hot water to flour in 1/4 cup increments. Mix with chopsticks until a ball is formed and the dough is not too hot to handle. On a floured surface, knead dough until it becomes a smooth, elastic ball. Place back in bowl and cover with a damp cloth. Allow to rest for at least 1 hour. Working on a floured surface with floured hands, roll out dough to form a long 'noodle', 1-inch in diameter. Cut 1/2-inch pieces and turn them over so the cut sides are facing up. Flatten with your palm and roll out thin using a rolling pin. The dumpling wrapper should end up about 3 inches in diameter. \n            ","\n              Making the dumplings: Place a small mound of filling in the middle of the wrapper. (Be very careful not to touch the edges with the filling as this will impede proper sealing of the dumplings. Nothing is worse than dumplings breaking during cooking.) Fold the wrapper in half to form a half-moon shape. Starting on one end fold/pinch the wrapper tightly together. Proceed with this fold/pinch method until the dumpling is completely sealed. There will be approximately 10 to 14 folds per dumpling. Rest the dumplings with the folded edges straight up. \n            ","\n              Cooking the dumplings: In a hot saute pan coated well with oil, place pot stickers flat side down and cook until the bottom is browned. Have pan cover ready and add 1 cup of chicken stock, cover immediately. Be careful, the liquid will splatter! The stock will steam the pot stickers. Check them in 5 minutes as more stock may be needed. The trick here is that once the dumplings are firm and fully cooked the stock will evaporate and the bottoms will crisp up again.\n            "],"source":"https://www.foodnetwork.com/recipes/2-for-1-pork-and-ginger-potstickers-recipe-1965036"},{"name":"\n  \n    2 in 1 Gravy and Sausage-Stuffed Stuffing\n  \n","ingredients":["8-ounce pack spicy sausage (recommended: Bob Evans)","2 cups canola oil, plus 1/4 cup","1 cup all-purpose flour, divided","3 cups chicken stock","1 (6-ounce) box chicken flavored bread stuffing mix (made according to package instructions)","1 tablespoon chopped parsley leaves, plus more for garnish","1 tablespoon chopped thyme leaves","2 tablespoons chopped scallions"],"directions":["\n              Heat a large skillet over medium heat and drop dime-sized dollops of sausage into the pan. Cook until golden brown, approximately 12 to 15 minutes. Remove from the pan to a plate and set aside.\n            ","\n              After removing sausage add a 1/4 cup of canola oil to the pan and stir in 1/2 cup of flour. Stir to create a roux, and cook for approximately 3 to 4 minutes. Slowly add the chicken stock, stirring while you pour and let simmer, stirring frequently, until it thickens, approximately 6 to 8 minutes.\n            ","\n              In a separate saucepan heat 2 cups of canola oil on medium-high heat until it reaches 350 degrees F.\n            ","\n              In a large bowl combine the stuffing, parsley, thyme, and scallions and mix together. Take quarter-sized or 1 tablespoon of stuffing mix and wrap it around the individual sausage balls. Cover the sausage completely and set aside\n            ","\n              Once all of the sausage balls have been coated in stuffing, dredge them in the remaining 1/2 cup of flour. When all the balls are lightly coated in flour, carefully drop them into the hot oil and fry until golden brown, about 2 to 3 minutes. Remove them from the oil, to a paper towel lined plate to drain. Once all of the balls have been fried and drained turn off the heat to the gravy and add the fried sausage stuffing balls. Stir gently to coat the balls with the gravy and transfer to a serving bowl or platter. Garnish with chopped parsley and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/aaron-mccargo-jr/2-in-1-gravy-and-sausage-stuffed-stuffing-recipe-1949121"},{"name":"\n  \n    2-Step Potato-Chorizo Hors d'Oeuvres\n  \n","ingredients":["2 1/2 pounds baby red potatoes","3 tablespoons olive oil","1 teaspoon dried oregano, crumbled","1 teaspoon salt","1 teaspoon freshly ground black pepper","1 pound chorizo","1 lime, quartered","1 recipe Avocado Salsa"],"directions":["\n              In a saucepan of actively boiling lightly salted water, blanch the potatoes for 8 to 10 minutes, or until the tines of a fork will just pierce the surface. Drain and, when cool enough to handle, cut them in half and score the cut side of each with the tines of a fork.\n            ","\n              Preheat the oven to 375 degrees and heat a large cast-iron skillet over medium heat.\n            ","\n              In a bowl, combine the potatoes with the olive oil, oregano, salt, and pepper and toss together until evenly coated. Transfer the potatoes to the hot skillet and spread them out into an even layer so they are hardly touching each other. Heat until sizzling, then transfer the skillet to the hot oven. Toast, turning over every 10 minutes, for about 30 minutes, until very crisp and golden.\n            ","\n              While the potatoes are roasting, heat a large non-stick skillet over medium-high heat and add 2 tablespoons water. Cook the sausages for about 20 minutes, turning occasionally and pouring off the fat as it accumulates. Drain the sausages briefly on a double thickness of paper towels and slice them 3/4 thick.\n            ","\n              Place a slice of sausage on top of each roasted potato half and secure with a toothpick. Assemble the hors d'oeuvres on a platter and squeeze a little lime juice over them. Serve, accompanied by Avocado Salsa.\n            "],"source":"https://www.foodnetwork.com/recipes/2-step-potato-chorizo-hors-doeuvres-recipe-1970880"},{"name":"\n  \n    2-Tier Lemon Raspberry Cake\n  \n","ingredients":["3 boxes (18.25 ounces each) lemon cake mix","3 3/4 cups grape juice","1 (1-ounce) bottle Champagne extract*","3 containers (12 ounces each) fluffy white or lemon frosting","1 jar raspberry jam","1 1/3 cups lemon curd, stirred to loosen","Several bunches mini green grapes","Powdered sugar","1 (14-inch diameter) round cake pan with-3-inch high sides","1 (10-inch diameter) round cake pan with 3- inch high sides","1 (6-inch diameter) round cake pan with 3-inch high sides","3 cardboard cake rounds (1 (14-inch), 1 (10-inch) and 1 (6-inch))","3/8-inch diameter plastic dowel rods","Parchment paper"],"directions":["\n              Cake Preparation: Preheat oven to 350 degrees F. Spray each cake pan with non-stick cooking spray, line with parchment paper and spray again. Follow directions on cake mix boxes to create 3 cakes of each size, but substitute grape juice for water in cake recipes. Bake each cake as per directions on box or until toothpick inserted into center of cake comes out clean. Cool cakes in pans on cooling racks and cool completely. After removing cakes from pans and parchment paper, cut each cake in half horizontally and level off tops of each section by slicing thin layer off top.\n            ","\n              Filling and Frosting Preparations: In a large bowl, combine frosting with a few drops of Champagne extract, stirring well. For each size cake, place bottom layer atop cardboard round of matching diameter. Pipe a ring of lemon frosting around top edges of bottom layer. Fill in center with raspberry jam. Stack next layer of cake atop this and repeat ring of frosting. Fill in center with lemon curd. Stack top layer of cake atop this with smooth edges facing upward. Spread icing over entirety of cake. Repeat this process to create a 14-inch cake, a 10-inch cake, and a 6-inch cake, which will make up finished wedding cake. Stack layered cakes atop one another from largest to smallest.\n            ","\n              To Assemble: Without removing the cardboard rounds from underneath the cakes, place the 14 inch cake onto serving platter. Cut dowel rods into 5 sections the height of the 14 inch cake, and 5 sections the height of the 10 inch cake. Carefully insert 4 dowel rods around the middle perimeter of the 14-inch cake and 1 in the middle. Stack the 10-inch cake atop the 14-inch cake. Repeat dowel insertion process for the10-inch cake. Stack the 6-inch cake atop the 10-inch cake. Cover up cardboard by piping icing around perimeter base of each cake. Dust mini green grapes liberally with powdered sugar and adorn cakes with them. Further adorn cake with white ribbon. Find mate, wed, serve.\n            ","\n              *Champagne extract is available at most specialty baking and cake decorating stores. .\n            "],"source":"https://www.foodnetwork.com/recipes/sandra-lee/2-tier-lemon-raspberry-cake-recipe-2047108"},{"name":"\n  \n    2-Timing Lobster Deviled Eggs\n  \n","ingredients":["2 dozen eggs","2 (1 1/4 pound) lobsters, steamed, shelled, and chopped","1 tablespoon of mustard","3 shallots","2 tablespoons of mayonnaise","2 tablespoons of capers","1 bunch of minced chives"],"directions":["\n              Simmer eggs in lightly salted water for 12 to 15 minutes. Run under cold water until eggs are cool, then crack and peel cleanly. Split eggs neatly and remove yolks. In a large mixing bowl blend lobster, mustard, shallots, mayonnaise, capers and chives. Season with salt and pepper. Fill eggs with lobster salad and garnish with chives.\n            "],"source":"https://www.foodnetwork.com/recipes/2-timing-lobster-deviled-eggs-recipe-1965028"},{"name":"\n  \n    2-for-Tea Individual Yorkshire Puddings with Rare Roast Beef\n  \n","ingredients":["1 cup plus 2 tablespoons milk","2 large eggs","1 large egg yolk","1 cup all purpose flour","1 teaspoon salt","Freshly ground black pepper to taste","3/4 cup vegetable oil","3/4 cup sour cream","1 tablespoon plus 1 teaspoon drained bottled horseradish","1 teaspoon chopped fresh flat-leafed parsley leaves, (wash and dry before chopping)","1/2 pound cooked rare roast beef, sliced 3/8-inch thick and slices cut into 1-inch pieces","36 small fresh flat-leafed parsley leaves"],"directions":["\n              Make batter: In a blender blend batter ingredients until smooth and transfer to a bowl. Let batter stand, covered, 1 hour.\n            ","\n              Preheat oven to 425 degrees.\n            ","\n              Put 2 mini-muffin pans (each containing twelve 1 3/4 by 1-inch cups) on 1 baking sheet and spoon 1 teaspoon oil into each cup. Put the baking sheet in middle of oven 3 minutes to heat oil in cups. Working quickly, pour 2 teaspoons batter into hot oil in each cup and bake in middle of oven 18 minutes, or until pudding shells are golden and puffed. Remove shells from cups with tongs and cool on racks. Repeat procedure with remaining batter. Shells may be made 3 days ahead and chilled, covered, or 1 month ahead and frozen in airtight containers. Bring shells to room temperature and recrisp in a 300 degree oven 10 minutes.\n            ","\n              In a small bowl stir together sour cream, horseradish, and parsley and transfer to a small pastry bag fitted with 1/8-inch plain tip.\n            ","\n              Fold a few beef slices into each shell and pipe 1 teaspoon horseradish cream onto each pudding. Garnish puddings with parsley.\n            "],"source":"https://www.foodnetwork.com/recipes/2-for-tea-individual-yorkshire-puddings-with-rare-roast-beef-recipe-1965163"},{"name":"\n  \n    2-to-Tango Oysters on the Half Shell\n  \n","ingredients":["6 shallots, peeled and sliced","3/4 cup red wine vinegar","36 fresh oysters"],"directions":["\n              In a blender puree shallots with the red wine vinegar until smooth. Set aside. Shuck oysters. Shucked oysters may be kept, covered with a wet towel, in the refrigerator up to an hour. Spoon about 1 teaspoon of sauce over each oyster to cover with a thin layer. Serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/2-to-tango-oysters-on-the-half-shell-recipe-1970842"},{"name":"\n  \n    20 Clove Brisket\n  \n","ingredients":["4 tablespoons Worcestershire sauce","2 tablespoons canola oil","1 tablespoons garlic oil","1 tablespoon oriental dry hot mustard","1 tablespoon salt","1 teaspoon black peppercorns","20 cloves garlic","2 (1 1/2-pound) cuts beef brisket","6 (1/2-inch) thick onion slices","2 cups beef broth (approximate)","2 cups Merlot red wine (approximate)","1 cup baby carrots","1 stalk celery, chopped"],"directions":["\n              Preheat oven to 300 degrees F.\n            ","\n              In a large plastic bag add Worcestershire sauce, oils, dry hot mustard, salt, peppercorns and garlic. Mix and add brisket then seal making sure marinade covers all parts of the meat. Marinate for 2 hours. In a Dutch oven or roasting pan place 3 of the onion rings in a circle to form a trivet for the brisket (if using a roasting pan place all onion rings out in a single layer). Place the garlic in the spaces not occupied by the rings, then add one slab of brisket making sure to place it evenly on top of the rings. Add another layer of onion rings then the second slab of brisket (if using roasting pan, place brisket side by side in single layer on top of onons). Pour over the remaining marinade, the broth and wine in equal parts until the meat is just covered. Cover and cook for 3 hours adding the carrots and celery 30 minutes before the end of cooking. Check the brisket a few times while cooking and add salt, as needed, and broth and wine in equal parts if the level of the liquid falls below the meat. The brisket is done when it is tender to the fork and easy to pull apart.\n            "],"source":"https://www.foodnetwork.com/recipes/sunny-anderson/20-clove-brisket-recipe-2103428"},{"name":"\n  \n    20 Clove of Garlic Roasted Game Hens\n  \n","ingredients":["2-1 1/2 pound cornish game hens","6 tablespoons softened butter","8 fresh sage leaves","2 teaspoons grated lemon zest","40 cloves of garlic","!/2 cup white wine","1 cup chicken stock","2 tablespoons arrowroot","2 tablespoons water"],"directions":["\n              Preheat oven to 400 degrees.\n            ","\n              In a pot of boiling water blanch garlic cloves for 30 seconds. Remove to ice bath to stop cooking. Remove skins\n            ","\n              In a small bowl, combine softened butter, lemon zest, salt and pepper. Loosen the skin of the hens by slipping your fingers between the meat and skin of the breast and legs. Rub the butter mixture under the skin of each hen. Place a fresh sage leaf under the skin on each breast half and at each leg.\n            ","\n              Place hens, head to toe, in roasting pan. Place garlic cloves inside the cavities and surrounding each hen.\n            ","\n              Roast hens for 25 to 30 minutes at 400 degrees, until juices run clear when thigh is pierced.\n            ","\n              Remove hens and garlic from roasting pan to platter. Pour off fat and juices into defatting cup.\n            ","\n              Place roasting pan over heat. Pour in 1/2 cup white wine to deglaze. Reduce until almost evaporated, scraping up the brown bits from the bottom of pan. When reduced, add 1 cup chicken stock and any juices that have settled in the defatting cup and from the platter. Mix together 2 tablespoons arrowroot and 2 tablespoons water. Add to sauce and bring to a boil to achieve full thickening power.\n            ","\n              Cut hens in half down breast bone and back bone. Serve half a hen per guest. Serve pan sauce on side.\n            "],"source":"https://www.foodnetwork.com/recipes/20-clove-of-garlic-roasted-game-hens-1938961"},{"name":"\n  \n    20 Cloves of Garlic Roasted Game Hens\n  \n","ingredients":["2 to 1 1/2 pound cornish game hens","6 tablespoons softened butter","8 fresh sage leaves","2 teaspoons grated lemon zest","40 cloves of garlic","1/2 cup white wine","1 cup chicken stock","2 tablespoons arrowroot","2 tablespoons water"],"directions":["\n              Preheat oven to 400 degrees.\n            ","\n              In a pot of boiling water blanch garlic cloves for 30 seconds. Remove to ice bath to stop cooking. Remove skins\n            ","\n              In a small bowl, combine softened butter, lemon zest, salt and pepper. Loosen the skin of the hens by slipping your fingers between the meat and skin of the breast and legs. Rub the butter mixture under the skin of each hen. Place a fresh sage leaf under the skin on each breast half and at each leg.\n            ","\n              Place hens, head to toe, in roasting pan. Place garlic cloves inside the cavities and surrounding each hen.\n            ","\n              Roast hens for 25 to 30 minutes at 400 degrees, until juices run clear when thigh is pierced.\n            ","\n              Remove hens and garlic from roasting pan to platter. Pour off fat and juices into defatting cup. Place roasting pan over heat. Pour in 1/2 cup white wine to deglaze. Reduce until almost evaporated, scraping up the brown bits from the bottom of pan. When reduced, add 1 cup chicken stock and any juices that have settled in the defatting cup and from the platter. Mix together 2 tablespoons arrowroot and 2 tablespoons water. Add to sauce and bring to a boil to achieve full thickening power.\n            ","\n              Cut hens in half down breast bone and back bone. Serve half a hen per guest. Serve pan sauce on side.\n            "],"source":"https://www.foodnetwork.com/recipes/20-cloves-of-garlic-roasted-game-hens-1965031"},{"name":"\n  \n    20-Minute Bolognese\n  \n","ingredients":["8 ounces uncooked spaghetti","1 tablespoon olive oil","1 small yellow onion, chopped fine","2 cooked burgers (3 ounces each), crumbled","One 28-ounce can crushed or pureed tomatoes","1 tablespoon butter, optional","Salt and pepper, to taste","6 large, fresh basil leaves, torn"],"directions":["\n              Cook the spaghetti according to the package directions. Drain and set aside. \n            ","\n              Heat the olive oil in a deep skillet over medium heat. Add the onions, and saute until lightly golden, 2 to 3 minutes. Add the meat, tomatoes and butter, if using. Bring to a boil. Season with the salt and pepper. Stir in the basil leaves. Reduce the heat to low, and cook for 20 minutes. \n            ","\n              Add the cooked pasta to the skillet, and toss well to coat. Divide among deep bowls to serve.\n            "],"source":"https://www.foodnetwork.com/recipes/20-minute-bolognese-3416694"},{"name":"\n  \n    20-Minute Chicken Cutlets with Charred Escarole Salad\n  \n","ingredients":["1 head escarole (about 1 pound)","2 tablespoons red wine vinegar","Pinch of crushed red pepper","Kosher salt and freshly ground black pepper","1/4 cup extra-virgin olive oil, plus 1 teaspoon, plus 3 tablespoons , plus more for drizzling","1/4 cup golden raisins","1/4 cup panko","1/4 cup sliced almonds","1 1/2 pounds thin chicken breast cutlets"],"directions":["\n              Position an oven rack about 5 inches from the broiler element and preheat the broiler.\n            ","\n              Cut the head of escarole lengthwise through the stem-end into 4 wedges. Discard any discolored or wilted leaves. Wash the escarole wedges under cold water, being sure to wash away any dirt or grit between the leaves. Give each wedge a good shake to remove excess water and place upside down to drain in a colander.\n            ","\n              Meanwhile, whisk together the vinegar, crushed red pepper, 1/4 teaspoon salt and a few grinds of pepper in a large bowl. Slowly drizzle in 1/4 cup of the oil, whisking constantly, until blended. Stir in the raisins.\n            ","\n              Spread the panko and almonds together on a baking sheet. Toss with 1 teaspoon of the oil and a pinch of salt. Place under the broiler and toast until lightly browned, 20 to 30 seconds. Toss together and broil until golden brown, another 10 to 20 seconds. Transfer to a small bowl.\n            ","\n              Wipe off the baking sheet and drizzle generously with oil. Arrange the four escarole wedges, cut-side up, on the baking sheet. Drizzle the wedges with 1 tablespoon of the oil and sprinkle with salt and pepper. Broil until the top is browned and charred in places but the escarole is still raw underneath, 1 to 2 minutes.\n            ","\n              Drizzle a second baking sheet with oil. Arrange the chicken cutlets on the baking sheet in one layer. Sprinkle both sides with salt and pepper. Drizzle the tops of the cutlets with the remaining 2 tablespoons oil. Place in the broiler and broil until cooked through, 3 to 4 minutes.\n            ","\n              Divide the cutlets and escarole wedges among 4 plates. Spoon the raisin vinaigrette over each wedge, then top with the toasted panko and almonds.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-chicken-cutlets-with-charred-escarole-salad-3362742"},{"name":"\n  \n    20-Minute Chicken Thighs and Couscous with Dill\n  \n","ingredients":["1 teaspoon unsalted butter","Kosher salt","1 1/4 cups couscous","1 cup loosely packed dill fronds, chopped","8 boneless, skinless chicken thighs, trimmed","1 cup grape tomatoes, each pierced halfway through with a paring knife","Zest of 2 lemons, plus juice of 3 lemons, plus 1 medium lemon, cut into 4 wedges","2 tablespoons olive oil","1/2 teaspoon dried oregano","Freshly ground black pepper","2 medium Persian cucumbers, quartered and cut into 1/2-inch chunks","1/2 cup 2 percent Greek yogurt"],"directions":["\n              Position an oven rack about 4 inches away from the broiler heat source, and preheat. Bring 1 1/2 cups water, the butter and 1/2 teaspoon salt to a simmer in a covered medium saucepan over medium-high heat. Remove from the heat, quickly stir in the couscous and let stand, covered, for 5 minutes. Fluff the couscous with a fork, stir in the dill, cover and set aside.\n            ","\n              Meanwhile, toss the chicken, tomatoes, lemon zest and juice, olive oil, 1 teaspoon salt, oregano and 1/2 teaspoon pepper together on a rimmed baking sheet. Unfold the chicken thighs so they're covered with the marinade, and lay them as flat as possible. Broil until the chicken is cooked through and browned, 10 to 12 minutes, rotating the pan and flipping the tomatoes and chicken halfway through.\n            ","\n              Transfer two chicken thighs and a few tomatoes to each plate. Stir the pan juices into the dilled couscous. Place 1 1/4 cups of couscous on each plate, and top with a scoop of chopped cucumbers, a dollop of yogurt and a lemon wedge.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-chicken-thighs-and-couscous-with-feta-and-dill-3362737"},{"name":"\n  \n    20-Minute Crispy Pierogies with Broccoli and Sausage\n  \n","ingredients":["3 tablespoons olive oil","One 12.84-ounce box frozen mini potato-cheese pierogies","1/2 pound sweet Italian sausage (about 3 links)","2 cloves garlic, smashed and roughly chopped","Pinch red pepper flakes","1 pound frozen broccoli spears, thawed (split any spears that are very large)","1 cup low-sodium chicken broth","2 tablespoons grated Parmesan, plus more for serving"],"directions":["\n              Heat 2 tablespoons of the oil in a large nonstick skillet over medium-high heat. Arrange the pierogies snugly flat-side down in the skillet (there may be some overlapping). Cook until the bottoms just begin to brown, about 3 minutes. Pour in 1/2 cup of water and simmer until the pierogi dough is tender and the water has completely evaporated, 4 to 5 minutes. Lower the heat to medium and continue cooking until the bottoms are golden brown, 2 to 3 minutes more; watch carefully as they can go from golden to burnt quickly. Remove from the heat.\n            ","\n              While the pierogies cook, heat the remaining 1 tablespoon oil in a large skillet over medium heat. When the oil is shimmering, squeeze the sausage out of the casings into the skillet. Cook the sausage, stirring frequently and breaking it up into bite-size pieces, until browned, 5 to 6 minutes. Add the garlic and pepper flakes and stir until the garlic begins to brown, about 30 seconds. Stir in the broccoli. Stir in the broth, scraping the bottom of the pan to release any browned bits. Sprinkle with the Parmesan. Reduce the heat and simmer, uncovered, until the liquid is reduced by half and the broccoli is tender, 4 to 5 minutes. Remove from the heat.\n            ","\n              Transfer the pierogies to a large, shallow serving dish and top with the sausage and broccoli mixture. Toss everything to combine and sprinkle with extra Parmesan.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-crispy-pierogies-with-broccoli-and-sausage-3363184"},{"name":"\n  \n    20-Minute Grilled Pizza with Smoked Salmon and Mixed Greens\n  \n","ingredients":["8 ounces whipped cream cheese, at room temperature","Zest and juice of 1 small lemon","1/4 cup fresh dill, roughly chopped, plus more fronds for garnish","Kosher salt and freshly ground black pepper","1 pound frozen pizza dough, thawed","All-purpose flour, for sprinkling","1/4 cup extra-virgin olive oil, plus more for oiling the grill grates","1/2 pound smoked salmon, thinly sliced","1 Persian cucumber, very-thinly sliced","2 radishes, very-thinly sliced","5 ounces mesclun mix"],"directions":["\n              Prepare a grill for medium-high heat.\n            ","\n              Line a baking sheet with parchment paper. Stir together the cream cheese, lemon zest, 1 tablespoon of the lemon juice, the chopped dill, a large pinch of salt and several grinds of pepper in a small mixing bowl. Set aside.\n            ","\n              Divide the pizza dough into 2 balls. Sprinkle the flour on a clean flat surface and roll each ball into an elongated crust, approximately 16 inches long and 6 inches wide. Transfer the crusts to the prepared baking sheet. Brush both sides of both crusts with 2 tablespoons of the oil and lightly sprinkle with salt.\n            ","\n              Lightly oil the grill grates. Grill the crusts until they start to puff and distinct grill marks appear, about 2 minutes. Flip and cook until just cooked through, an additional 1 to 2 minutes. Discard the used parchment paper and put the finished crusts on the baking sheet.\n            ","\n              Smear each crust with the cream cheese mixture. Shingle the smoked salmon on top making sure that each bite will have a piece of salmon. Scatter the sliced cucumbers and radishes on top of the salmon and garnish with dill fronds.\n            ","\n              Whisk together the remaining lemon juice, remaining 2 tablespoons oil and a large pinch of salt and pepper in a large bowl. Add the mesclun mix and toss to combine. Serve the pizzas family-style or cut each pizza in half and serve as individual pizzas for 4 people, with some salad on the side.\n            ","\n              Copyright 2014 Television Food Network, G.P. All rights reserved.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-grilled-pizza-with-smoked-salmon-and-mixed-greens-3362670"},{"name":"\n  \n    20-Minute Hoisin Skillet Salmon\n  \n","ingredients":["One 15.5-ounce can low-sodium black beans, drained and rinsed","2 tablespoons hoisin sauce","1/4 teaspoon red pepper flakes","2 cloves garlic, crushed","4 cups medium broccoli florets (about 8 ounces)","Four 5-ounce salmon fillets, skin removed","Juice of 1/2 lemon","2 tablespoons roughly chopped fresh cilantro, optional","Kosher salt"],"directions":["\n              Combine the beans, 3/4 cup water, hoisin sauce, red pepper flakes and garlic in a large skillet. Top with the broccoli, nestle in the salmon and bring to a simmer over medium heat. Once simmering, cover the skillet and cook until the salmon is flaky and just cooked through and the broccoli is crisp-tender, 5 to 6 minutes. Drizzle with lemon juice and sprinkle with cilantro if using. Add salt to taste and serve. \n            ","\n              Serves:4; Calories 297; Total Fat 9 grams; Saturated Fat 2 grams; Protein 36 grams; Total Carbohydrates 20 grams; Sugar 3 grams; Fiber 6.5 grams; Cholesterol 64 milligrams; Sodium 529 milligrams\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-hoisin-skillet-salmon-recipe-2040831"},{"name":"\n  \n    20-Minute Shrimp and Couscous With Yogurt-Hummus Sauce\n  \n","ingredients":["1 cup whole wheat couscous","1/4 cup dried apricots, chopped (or golden raisins)","2 tablespoons olive oil","1/2 cup 2-percent plain Greek yogurt","1 tablespoon prepared hummus","2 tablespoons chopped fresh mint or dill","Kosher salt","1 1/4 pounds medium shrimp, peeled and deveined, tails removed","1 cup cherry tomatoes, halved","1/4 to 1/2 teaspoon hot paprika","Juice of 1/2 lemon"],"directions":["\n              Preheat the broiler to high. Combine the couscous, apricots and 1 tablespoon of the olive oil in a bowl. Add 1 1/4 cups very hot water, cover with plastic wrap and let sit until all of the water is absorbed and the couscous is tender, about 5 minutes. \n            ","\n              Stir together the yogurt, hummus, mint and 1 to 2 tablespoons water in another bowl. Season with salt and set aside. \n            ","\n              Toss the shrimp, tomatoes, the remaining 1 tablespoon olive oil and paprika together. Spread out on a baking sheet and broil until the shrimp is opaque and cooked through, about 4 minutes. Drizzle with the lemon juice. \n            ","\n              Fluff the couscous with a fork. Divide the shrimp and couscous among 4 plates. Scrape any of the drippings from the baking sheet into the yogurt-hummus sauce. Serve the shrimp and couscous with the sauce. \n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-shrimp-and-couscous-with-yogurt-hummus-sauce-recipe-2120505"},{"name":"\n  \n    20-Minute Shrimp and Grits with Peas and Butter Sauce\n  \n","ingredients":["3/4 cup instant grits","Kosher salt and freshly ground black pepper","5 tablespoons unsalted butter","2 tablespoons grated Parmesan","1 1/4 pounds large peeled, deveined shrimp","2 tablespoons olive oil","1/2 cup dry white wine","6 ounces frozen peas (about 1 1/2 cups)","1 cup grape tomatoes, halved","4 scallions, sliced"],"directions":["\n              Bring 3 cups of water to a boil in a medium covered saucepan over high heat. Uncover and slowly whisk in the grits, 1 teaspoon salt and 1/2 teaspoon pepper. Reduce the heat to medium low and cook, uncovered, stirring occasionally, until thickened, about 5 minutes. Remove from the heat, stir in 1 tablespoon of the butter and the Parmesan and season with salt and pepper. Cover to keep warm.\n            ","\n              Meanwhile, sprinkle the shrimp with salt and pepper. Heat the oil in a large skillet over medium-high heat. Once the oil is hot, add the shrimp in a single layer and cook until the shrimp just start to turn bright pink on the bottom, 2 to 3 minutes. Add the wine and the peas, scraping up any browned bits on the bottom of the skillet. Bring to a simmer and cook, stirring occasionally, until the shrimp are opaque and cooked through and the peas are tender, 2 to 3 minutes (if the pan gets too dry, add water 1 tablespoon at a time). Add the tomatoes and scallions and toss with the shrimp and peas. Add the remaining 4 tablespoons butter and swirl the pan until there's a thick sauce.\n            ","\n              Serve the grits on a large platter and top with the shrimp, vegetables and butter sauce.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/20-minute-shrimp-and-grits-with-peas-and-butter-sauce-3362939"},{"name":"\n  \n    21 Burger\n  \n","ingredients":["2 stalks celery, finely chopped","3 tablespoons butter, divided","2 pounds ground sirloin","1/4 cup bread crumbs","1 (1-ounce) packet au jus gravy mix (recommended: McCormick)","4 hamburger buns, toasted"],"directions":["\n              Preheat oven to 400 degrees F.\n            ","\n              In a large, oven-proof skillet, over medium heat, saute celery in 1 tablespoon butter, about 4 minutes. Remove celery and let cool.\n            ","\n              In a medium bowl, stir to combine ground sirloin, bread crumbs, au jus mix, and sauteed celery. Form into 4 patties.\n            ","\n              Melt remaining butter in skillet. Carefully place patties in skillet and cook 2 to 3 minutes, or until browned on 1 side. Flip patties and place in preheated oven. Cook for 12 to 15 minutes for medium doneness.\n            ","\n              Serve hot on toasted buns with desired condiments.\n            "],"source":"https://www.foodnetwork.com/recipes/sandra-lee/21-burger-recipe-1948116"},{"name":"\n  \n    221 Meat Loaf\n  \n","ingredients":["3 1/2 pounds hamburger","2 eggs","1 cup oatmeal","1 small onion, diced","1 small green pepper, diced","1/2 cup ketchup","1 1/2 cups beef broth","1 tablespoon salt","1 tablespoon black pepper","1 tablespoon garlic powder","1 tablespoon onion powder"],"directions":["\n              Preheat the oven to 350 degrees F.\n            ","\n              Mix all ingredients well. Place in a loaf pan and bake for 1 1/2 hours.\n            "],"source":"https://www.foodnetwork.com/recipes/221-meat-loaf-recipe-1940945"},{"name":"\n  \n    24 Inches of Eggplant\n  \n","ingredients":["Kosher salt and freshly cracked black pepper","1 large eggplant, peeled and sliced into 1/2-inch rounds ","All-purpose flour, for dredging ","4 large eggs, beaten ","3 cups Italian breadcrumbs ","1 cup grated Parmesan","Canola oil, for frying","16 ounces burrata cheese ","One 2-foot Italian bread loaf, sliced in half lengthwise ","One 12-ounce jar roasted red peppers ","Balsamic Vinaigrette, recipe follows","3/4 cup balsamic vinegar","2 cloves garlic, smashed and chopped ","1/2 shallot, minced ","1 tablespoon honey ","1 teaspoon dried Italian seasoning ","Kosher salt and freshly cracked black pepper ","1/2 cup olive oil, plus more if needed"],"directions":["\n              Sprinkle salt on both sides of the eggplant slices and arrange in a single layer on a triple layer of paper towels on a baking sheet. Place another triple layer of paper towels on top. If there are additional slices, arrange them on top of the paper towels in a single layer, then top them with another triple layer of towels. Let the salt do the work for 30 to 45 minutes.\n            ","\n              Firmly press on the eggplant slices to remove as much liquid as possible, then wipe off any excess salt. Pepper both sides of the eggplant. Preheat the oven to 175 degrees F.\n            ","\n              Set up a standard breading station with 3 pie plates or small baking dishes. Add some flour to one, the beaten eggs to another and the breadcrumbs stirred together with the Parmesan to the third. Season each station lightly with salt and pepper.\n            ","\n              Dredge each eggplant slice first in the flour, then shake off the excess. Dip in the egg, letting any excess drip, and then coat in the breadcrumbs. Set aside on a wire rack and repeat with the remaining eggplant slices.\n            ","\n              Heat 1/2 inch of canola oil in 2 large, straight-sided saute pans over medium heat until hot. Line a baking sheet with paper towels.\n            ","\n              Working in small batches, fry a few eggplant slices in each pan, turning once, until golden brown, 4 to 5 minutes per side. Using tongs, transfer to the towel-lined baking sheet to drain. Fit another baking sheet with a wire rack to hold the eggplant warm in the oven while you finish frying the remaining slices.\n            ","\n              To build the sandwich: slice the burrata into disks (try to keep its shape) and arrange in a single layer on the bottom portion of the loaf. Put a single layer of the warm, crispy eggplant on top, then top with the roasted red peppers and drizzle with the Balsamic Vinaigrette. Use toothpicks to secure the top, then slice and serve.\n            ","\n              Put the vinegar in a small saucepan with the garlic and shallots and bring to a simmer over medium heat. Simmer, uncovered, until the vinegar reduces to about 1/2 cup. Let cool for about 5 minutes.\n            ","\n              In a blender, pulse together the vinegar mixture, honey, Italian seasoning and some salt and pepper. While the machine is running, slowly drizzle in the olive oil until the dressing is combined and emulsified. Adjust the seasoning if necessary, or add more oil if you want it less acidic.\n            "],"source":"https://www.foodnetwork.com/recipes/jeff-mauro/24-inches-of-eggplant-3230076"},{"name":"\n  \n    24 Karrot Gold Cupcakes\n  \n","ingredients":["2 cups flour","1 teaspoon baking soda","1 teaspoon ground cinnamon","1/2 teaspoon baking powder","1 teaspoon salt","1/2 teaspoon ground nutmeg","2 large eggs","1 cup sugar","1/2 cup packed brown sugar","1 cup canola oil","1 teaspoon vanilla extract","2 cups grated carrots (about 5)","1 cup chopped walnuts","1/2 stick unsalted butter","8 ounces cream cheese","3 1/2 cups powdered sugar","3/4 teaspoon vanilla extract","1/2 teaspoon cinnamon","Edible gold glitter stars, for serving, optional"],"directions":["\n              Preheat the oven to 350 degrees F.\n            ","\n              Whisk together the flour, baking soda, cinnamon, baking powder, salt, and nutmeg in a medium bowl. In another medium bowl, with an electric mixer on medium speed, beat the eggs, sugar, brown sugar, and canola oil until light and thick. Reduce speed to low and add the flour mixture, beating just until blended. Stir in the vanilla, carrots, and walnuts until well blended.\n            ","\n              Line 12 cup cupcake or muffin pan 2/3-full with batter. Bake until the cupcakes are puffed and a toothpick inserted into the center comes out clean, about 20 minutes. Cool the cupcakes completely.\n            ","\n              For the frosting: Beat butter and cream cheese at medium speed until creamy (2-3 minutes). Reduce speed to low and add powdered sugar in 2 parts incorporating vanilla extract 1/2 way through and mix until incorporated (scraping down walls with rubber spatula each time). Add cinnamon and fold by hand into frosting. Serve within 24 hours.\n            ","\n              To assemble:\n            ","\n              Generously frost each cupcake with pastry bag and cut 1/2-inch off the tip. Add edible gold glitter stars if desired.\n            "],"source":"https://www.foodnetwork.com/recipes/24-karrot-gold-cupcakes-recipe-1923043"},{"name":"\n  \n    25-Minute Cheesy Sausage and Butternut Squash Casserole\n  \n","ingredients":["3 tablespoons extra-virgin olive oil","1 medium red onion","1 pound spicy Italian sausage, casings removed","10 ounces frozen diced butternut squash (about 1 1/2 cups)","One 15-ounce can crushed tomatoes","Kosher salt and freshly ground black pepper","One 16-ounce tube ready-made polenta","1 tablespoon unsalted butter, cut into small pieces, plus more for greasing the dish","5 ounces fontina cheese, thinly sliced (1 1/4 cups)","1 ounce grated Parmesan (about 1/4 cup)","5 ounces baby spinach (about 6 cups)","2 teaspoons balsamic vinegar"],"directions":["\n              Position an oven rack about 5 inches from the broiling element, and preheat the broiler.\n            ","\n              Heat 2 tablespoons of the oil in a large high-sided skillet over medium-high heat. While the pan is heating, thinly slice the onion; set aside about 1/3 cup for the salad.\n            ","\n              Add the sausage to the pan, and break it up into smaller chunks with a wooden spoon. Stir periodically until it is brown all over, about 5 minutes. Add the remaining onion and the squash. Stir for a minute, then add the tomatoes, 2 tablespoons water, 3/4 teaspoon salt and a few grinds of pepper. Cover partially, and let simmer vigorously, stirring occasionally, until reduced and thick, about 10 minutes.\n            ","\n              Meanwhile, slice the polenta into 1/4-inch rounds. Butter the flameproof baking dish, and shingle the rounds in one layer. Dot the polenta with the pieces of butter. Place the dish under the broiler, and broil the polenta until it is hot and soft, about 4 minutes.\n            ","\n              When the sauce is ready, spread it over the broiled polenta. Top with the fontina and grated Parmesan. Return the casserole to the broiler, and broil until the top is browned and bubbly, about 3 minutes.\n            ","\n              Meanwhile, toss the spinach in a large bowl with the reserved onion, the remaining 1 tablespoon olive oil, the balsamic vinegar, and salt and pepper to taste. Serve the casserole with the spinach salad on the side.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/25-minute-cheesy-sausage-and-butternut-squash-casserole-3362813"},{"name":"\n  \n    25-Minute Cod with Lentils\n  \n","ingredients":["3 stalks celery, trimmed, peeled and thinly sliced on the bias, plus 1/2 cup loosely packed leaves","Kosher salt and freshly ground black pepper","Four 6-ounce skinless cod fillets","2 tablespoons olive oil","1 tablespoon unsalted butter","4 slices bacon, cut into matchsticks","1/2 medium red onion, thinly sliced","1 clove garlic, finely chopped","1/2 cup red wine","Two 15-ounce cans brown lentils, strained and rinsed","1/2 cup low-sodium chicken broth","1/4 teaspoon red pepper flakes"],"directions":["\n              Cook the bacon in a medium saucepan over high heat, stirring frequently, until just brown, 2 to 3 minutes. Add the onion and garlic, and stir constantly until fragrant, about 1 minute. Add the wine, bring to a boil and cook, stirring, to scrape up any bacon and browned bits, for about 1 minute. Stir in the lentils, chicken broth and pepper flakes, and return to a boil. Cover and cook, stirring occasionally and reducing the heat if necessary to maintain a medium boil, until saucy but not watery, about 3 minutes. Remove from the heat, and stir in the celery, celery leaves, 1/2 teaspoon salt and a few grinds of pepper.\n            ","\n              Season the fillets all over with 1/2 teaspoon each salt and pepper. Heat the oil in a large nonstick skillet over medium-high heat. Once the oil shimmers, add the fillets skinned-side down and cook, undisturbed, until crisped and browned, 3 to 4 minutes (the fish should be opaque between the large natural flakes). Flip the fillets, and cook until just beginning to flake, 1 to 2 minutes. Remove the fillets from the skillet, and turn off the heat. Add the butter to the skillet, and allow it to melt and brown.\n            ","\n              Divide the lentils among 4 bowls or soup plates, top each with a fillet and drizzle with browned butter.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/25-minute-cod-with-lentils-3363037"},{"name":"\n  \n    25-Minute Flank Steak with Charred Vidalia Onion Salad\n  \n","ingredients":["2 medium Vidalia onions or other sweet onions (about 1 pound)","2 tablespoons toasted sesame oil","Kosher salt and freshly ground black pepper","1 tablespoon fish sauce","4 medium radishes, very thinly sliced (use a mandoline if you have one)","1 large bunch watercress, rinsed and dried","1/2 cup fresh cilantro leaves","1 pound flank steak"],"directions":["\n              Preheat a very large cast-iron skillet over medium-high heat until it just begins to smoke.\n            ","\n              While the pan is heating, slice the onions into 1/4-inch-thick rings and toss with 1 tablespoon of the oil, 1/4 teaspoon salt and a few grinds of pepper in a medium bowl. Add the onions to the skillet and cook, undisturbed, until they char slightly, about 2 minutes. Stir occasionally with a wooden spoon until they are further charred and slightly softened but still crunchy, 3 to 4 minutes more. Transfer to a plate.\n            ","\n              Stir together the remaining 1 tablespoon oil and the fish sauce in the medium bowl that the onions were in. Add the radishes, watercress, cilantro and cooked onions and toss until well coated. Allow the mixture to sit at least 5 minutes, so the juices from the onion combine with the dressing.\n            ","\n              Wipe out the skillet the onions cooked in and return it to medium-high heat. Sprinkle the steak with 3/4 teaspoon salt and a few grinds of pepper and put it into the hot skillet. Cook until well browned on one the bottom, 4 to 5 minutes; flip and cook until medium rare, 4 to 5 minutes more. Transfer to a cutting board and allow the steak to rest for a few minutes, then slice thinly against the grain.\n            ","\n              Divide the salad mixture among 4 bowls. Top each bowl with slices of steak.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/25-minute-flank-steak-with-charred-vidalia-onion-salad-3363094"},{"name":"\n  \n    25-Minute Grilled Pork Chops with Succotash\n  \n","ingredients":["2 medium yellow tomatoes, cut into 1/2-inch thick wedges (about 1 pound)","Kosher salt and freshly ground black pepper","1/2 cup sour cream","Zest and juice of 1 lime","1/4 teaspoon cumin","1/4 cup extra-virgin olive oil, plus more for oiling the grill grates","4 bone-in pork chops, 1-inch thick (about 3 pounds)","4 ears yellow corn, shucked","1 large red onion, sliced into 1/2-inch rounds (about 8 ounces)","One 15-ounce can black-eyed peas, drained and rinsed","1/2 cup roughly-chopped fresh parsley"],"directions":["\n              Prepare a grill or large grill pan for medium-high heat.\n            ","\n              Put the tomatoes into a large mixing bowl. Sprinkle with salt and pepper and let sit at room temperature while you prepare the rest of the ingredients.\n            ","\n              Put the sour cream, lime zest and juice, cumin and a pinch of salt and pepper in a small bowl and whisk to combine. Reserve.\n            ","\n              Lightly oil the grill grates. Brush the pork all over with 2 tablespoons of the oil and sprinkle liberally with salt and pepper. Arrange the pork on one side of the grill (leave room for grilling the vegetables) and cook until lightly charred on both sides and an instant-read thermometer inserted into the deepest part of a chop registers 140 degrees F, about 5 minutes per side. Remove from the grill and let rest for 5 minutes before serving.\n            ","\n              Meanwhile, brush the corn and onion liberally with the remaining 2 tablespoons oil, sprinkle with salt and pepper and arrange them on the grill. Cook the corn until lightly charred, 6 to 8 minutes, rotating the ears so that they cook evenly. Cook the onion until charred and tender, 6 to 8 minutes, flipping as needed. Transfer the vegetables to a cutting board and cool for 2 to 3 minutes. When cool enough to handle, cut the corn away from the cobs and quarter the onion rounds. Add the corn, onion, black-eyed peas and half of the parsley to the same large bowl with the tomatoes. Gently toss to combine. Season to taste with salt and pepper.\n            ","\n              Divide the succotash among 4 large dinner plates and top with a dollop of the reserved sour cream mixture. Place 1 pork chop on each plate next to the succotash. Garnish the succotash with the reserved parsley and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/25-minute-grilled-pork-chops-with-succotash-3362932"},{"name":"\n  \n    25-Minute Unstuffed Pork Chops\n  \n","ingredients":["2 1/2 cups store-bought seasoned croutons (not mini)","3 tablespoons unsalted butter, cut into small pieces","4 scallions, thinly sliced","6 dried apricots, roughly chopped","2 cups low-sodium chicken broth","Kosher salt and freshly ground black pepper","Four 11- to 12-ounce bone-in pork loin chops, about 1-inch thick (2 3/4 to 3 pounds total)","1 tablespoon olive oil","2 tablespoons sour cream","1 tablespoon Dijon mustard","4 side salads, for serving"],"directions":["\n              Position an oven rack in the middle of the oven and preheat the broiler.\n            ","\n              Put the croutons, butter, scallions, apricots, 1 cup of the chicken broth, 1/4 teaspoon salt and a few grinds of pepper in a large bowl and toss to combine. Set aside to let the croutons soak up the broth.\n            ","\n              Pat the pork dry and season all over with 3/4 teaspoon of salt and few grinds of pepper. Heat the oil in a large non-stick skillet over medium high heat. Arrange the pork in the skillet in a single layer (it's okay if the chops are touching) and cook until nicely browned and almost cooked through, 4 minutes per side. Remove the skillet from the heat and transfer the pork chops to a baking sheet. Pack and pile 1/4 of the stuffing on top of each chop. Broil until the stuffing is golden brown, about 4 minutes.\n            ","\n              Meanwhile, return the skillet to medium-high heat, add the remaining 1 cup of chicken broth and bring to a simmer until slightly reduced, about 2 to 3 minutes. Whisk in the sour cream and Dijon until smooth, about 1 minute. Season the sauce with a few grinds of pepper. Spoon the sauce onto 4 plates. Transfer a pork chop onto each pool of sauce. Serve with the side salads.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/25-minute-unstuffed-pork-chops-3362760"},{"name":"\n  \n    3 Meat, 3 Bean, 3 Chili Chili\n  \n","ingredients":["2 pounds chuck roast, cut into small cubes","Kosher salt and freshly ground black pepper ","2 tablespoons vegetable oil ","2 pounds ground beef ","1 pound fresh chorizo","8 cloves garlic, minced ","1 large onion, chopped ","1 jalapeno, minced ","Two 12-ounce bottles pale lager beer ","One 14-ounce can chopped tomatoes ","1/2 cup tomato paste ","2 guajillo chiles ","2 tablespoons chili powder ","1 tablespoon ground cumin ","1 tablespoon Mexican oregano ","2 bay leaves ","Two 15-ounce cans pinto beans, drained and rinsed ","Two 15-ounce cans red kidney beans, drained and rinsed ","Two 15-ounce cans black beans, drained and rinsed ","1/4 cup masa harina","Diced tomatoes","Cubed avocado ","Grated Cheddar cheese","Sour cream ","Lime wedges ","Fresh cilantro leaves "],"directions":["\n              Heat a Dutch oven over medium heat. Season the chuck roast with salt and pepper. Add the oil to the pot and sear the chuck roast until browned, 7 to 8 minutes. Remove from the pot. Add the ground beef and chorizo and cook until browned, 7 to 8 minutes; drain off excess fat if necessary. Add the garlic, onion and jalapeno and cook for 2 minutes, then return the chuck roast back to the pot with the beer, tomatoes and tomato paste.\n            ","\n              Using scissors, snip the guajillo chiles into small strips. Add to the pot and bring to a boil. Mix in the chili powder, cumin, oregano, bay leaves and 2 tablespoons salt. Reduce to a simmer and simmer for 1 1/2 hours.\n            ","\n              Remove the bay leaves. Add the beans to the pot. Combine the masa and 1/2 cup water in a small bowl, then stir the mixture into the pot. Continue to simmer until the chili thickens slightly, an additional 15 minutes.\n            ","\n              Serve with fixins: diced tomatoes, cubed avocado, grated Cheddar, sour cream, lime wedges and cilantro leaves.\n            "],"source":"https://www.foodnetwork.com/recipes/ree-drummond/3-meat-3-bean-3-chili-chili-4708868"},{"name":"\n  \n    3 Mix-Ins to Customize Store-Bought Gelato\n  \n","ingredients":["1 bunch mint leaves, lightly chopped, about 1/2 cup","1/4 cup sugar","2 tablespoons water","2 cups strawberries, stemmed and quartered","1/4 cup balsamic vinegar","1/4 cup superfine sugar","Salt and freshly ground black pepper","8 ounces bittersweet chocolate, coarsely chopped","1 cup heavy cream","1 teaspoon instant espresso powder","1/2 cup chopped toasted hazelnuts","1 pint vanilla gelato, softened"],"directions":["\n              For the mint pesto: Mix the sugar and mint in a mortar, grinding well with the pestle. Add the water and mix. Chill if not using immediately.\n            ","\n              For the strawberries balsamic sauce: Put the strawberries into a bowl and sprinkle the balsamic vinegar and sugar over them. Add a pinch each of salt and pepper. Toss gently and marinate for 2 to 3 minutes.\n            ","\n              For the chocolate espresso ganache: Put the chocolate into a medium heatproof bowl. Bring the cream and the espresso powder to a boil in a small saucepan over medium heat. Immediately pour the boiling cream over the chopped chocolate and let it sit for 1 minute. Using a spatula, slowly stir in a circular motion until all the chocolate is melted, do not stir in too much air. Add in the chopped toasted hazelnuts and allow the mixture to cool. The ganache may be covered and stored in the refrigerator for up to 2 weeks.\n            ","\n              To serve: Blend each mix-in into 1 pint softened vanilla gelato. Put back into the freezer to harden.\n            "],"source":"https://www.foodnetwork.com/recipes/michael-chiarello/3-mix-ins-to-customize-store-bought-gelato-recipe-2040261"},{"name":"\n  \n    3 Pea Fried Rice\n  \n","ingredients":["1 tablespoon minced garlic","1 tablespoon minced ginger","4 cups cooked long grain rice, usually day old","3 eggs scrambled","2 tablespoons chive batons","1 cup blanched English peas","Salt and pepper to taste","1 cup blanched snow peas","1 cup blanched snap peas","Citrus Vinaigrette (recipe follows)","Juice of 1 lemon","Juice of 1 lime","Juice of 1 orange","1/4 cup extra virgin olive oil","Salt and black pepper to taste"],"directions":["\n              In a wok, coat with canola oil and add garlic and ginger. Cook until soft and add rice. Mix well then add eggs, chives and English peas. Heat thoroughly. Check for seasoning. Toss snow and snap peas with vinaigrette. Check for seasoning.\n            ","\n              Mix all ingredients well.\n            "],"source":"https://www.foodnetwork.com/recipes/3-pea-fried-rice-recipe-1920247"},{"name":"\n  \n    3 Pepper Lobster Stir-fry\n  \n","ingredients":["1/4 cup canola oil","3 cups flour","3 tablespoons salt","1 large white onion, thinly sliced into rings","Two 1 1/4-pound lobsters, par-cooked and cleaned","4 ounces 3 Pepper Lobster Stir-fry Sauce, recipe follows","Lemon wedge","2 cilantro sprigs","1/2 cup canola oil","4 onions, diced","1 cup minced garlic","3/4 cup Thai fish sauce","1 1/4 cups balsamic vinegar","4 tablespoons black pepper","1 teaspoons white pepper","3 1/4 tablespoons Szechuan pepper","2 1/4 cups sugar","1 tablespoon salt"],"directions":["\n              Preheat a fryer or a deep pot halfway filled with oil to 325 degrees F.\n            ","\n              Combine flour and salt. Toss the onions in salted flour, shaking off excess flour. Fry the onions until golden brown. Reserve.\n            ","\n              Chop the lobsters into several pieces, then deep fry the heads and save for garnish. In a hot wok, add oil and stir-fry the lobster pieces for 3 minutes. Add sauce and reduce until it is a glaze. Pile lobster onto a platter and garnish with fried onions, lemon and cilantro.\n            ","\n              Combine all of the ingredients in a saucepot. Bring to a simmer over medium heat and cook until the sugar has dissolved.\n            "],"source":"https://www.foodnetwork.com/recipes/3-pepper-lobster-stir-fry-recipe-1913460"},{"name":"\n  \n    3 Tasty Tapas: Sherry-Garlic Beef, Sherry-Garlic Mushrooms, Grilled Chorizo\n  \n","ingredients":["1/2 cup parsley leaves, a couple of handfuls","8 cloves garlic, cracked away from skins","1 pound chorizo sausage, casings removed","1/4 cup extra-virgin olive oil","1 1/2 pounds tenderloin or sirloin of beef, well trimmed, cut into bite sized pieces","Coarse salt and pepper","24 medium to large mushroom caps","1 cup dry sherry"],"directions":["\n              Preheat a grill pan over medium high heat.\n            ","\n              Place parsley and garlic in food processor and chop.\n            ","\n              Heat a large, heavy skillet over high heat.\n            ","\n              Cut chorizo on an angle in 1/2-inch slices. Grill 2 minutes on each side. Transfer to a serving dish.\n            ","\n              To the hot skillet, add about 2 tablespoons extra-virgin olive oil, 2 turns of the pan. Add meat and sear the pieces on all sides to caramelize it evenly. Add half of the garlic and parsley mixture to the pan. Turn to coat the meat. Season meat with salt and pepper. Add 1/2 cup sherry and turn the meat in the wine as it deglazes the pan. Transfer to a serving dish and cover with loose foil to keep warm. Return pan to heat.\n            ","\n              Repeat the same process with the mushrooms: add extra-virgin olive oil to the pan, 2 tablespoons or 2 turns of the pan. Add mushrooms, cook 3 or 4 minutes to char edges and soften, add parsley and garlic, then salt and pepper, then sherry. Reduce sherry while scraping up pan drippings and remove to serving dish.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/3-tasty-tapas-sherry-garlic-beef-sherry-garlic-mushrooms-grilled-chorizo-recipe-1942324"},{"name":"\n  \n    3-Bean Salad with Lemon Vinaigrette\n  \n","ingredients":["2 cloves garlic","1/3 cup lemon juice ","1 teaspoon ground cumin ","1 teaspoon honey ","1 teaspoon Dijon mustard ","2/3 cup extra-virgin olive oil ","Salt and pepper","3 stalks celery, finely chopped","1 bunch green onions, green parts only, finely chopped ","One 15-ounce can black beans, drained ","One 15-ounce can red kidney beans, drained ","One 15-ounce can white beans, drained ","Salt and pepper","3 tablespoons chopped fresh parsley "],"directions":["\n              For the lemon vinaigrette: Using a rasp grater, grate the garlic into a bowl. Add the lemon juice, cumin, honey and Dijon. Whisk in the olive oil and season with salt and pepper.\n            ","\n              For the 3-bean salad: Mix the celery, green onions, black beans, kidney beans and white beans in a large bowl.\n            ","\n              Dress the salad with 1/4 cup of the vinaigrette and toss well. Season with salt and pepper and toss with the parsley.\n            "],"source":"https://www.foodnetwork.com/recipes/trisha-yearwood/3-bean-salad-with-lemon-vinaigrette-3865260"},{"name":"\n  \n    3-Cheese Macaroni and Cheese\n  \n","ingredients":["1 tablespoon salt, plus more for pasta water","1 pound large elbow macaroni","6 tablespoons butter","6 tablespoons all-purpose flour","3 cups milk","1 cup heavy cream","1 tablespoon freshly ground black pepper","1 pound white Cheddar, shredded","4 ounces Romano, shredded","4 ounces Asiago, shredded","2 cups bread crumbs (suggested: panko (Japanese) available at most markets)","2 tablespoons chopped fresh parsley, for garnish"],"directions":["\n              Preheat oven to 325 degrees F.\n            ","\n              In large pot filled with water add 3 pinches of salt and the macaroni and place over high heat. Bring to a boil and let cook until al dente, about 8 minutes. Drain. Set aside.\n            ","\n              In a large saucepan, melt butter. Sprinkle flour over butter and cook 2 to 3 minutes on medium heat, whisking until a roux or paste forms. Add cold milk and whisk vigorously until dissolved. Cook sauce on medium-low heat until thick and bubbly. Add heavy cream, all cheeses, 1 tablespoon of salt, and 1 tablespoon pepper. Cook until cheeses are fully melted, stirring occasionally.\n            ","\n              Add cooked macaroni to cheese mixture and mix thoroughly. Place macaroni mixture in a 13 by 9 baking dish and top with breadcrumbs. Place in the oven and bake for 12 to 15 minutes or until golden brown. Top with fresh parsley and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/3-cheese-macaroni-and-cheese-recipe-1948199"},{"name":"\n  \n    3-Cheese Slow Cooker Macaroni and Cheese\n  \n","ingredients":["cooking spray","2 cups shredded cheddar and Monterey jack cheese blend ","2 cups shredded sharp cheddar cheese","4 eggs","3 cups 2% milk","2 12 oz. cans evaporated milk","1/4 teaspoon ground cayenne pepper","2 teaspoons dry mustard","1/2 teaspoon ground nutmeg","2 teaspoons salt","1 teaspoon freshly ground pepper","1 pound uncooked macaroni noodles","1 teaspoon ground paprika"],"directions":["\n              1. Spray slow cooker lightly with cooking spray.\n            ","\n              2. In large bowl, combine cheeses and set aside.\n            ","\n              3. In another large bowl, whisk eggs lightly. Add evaporated milk, milk, dry mustard, cayenne, nutmeg, salt, and pepper. Whisk to combine.\n            ","\n              4. Add 3 cups of cheese mixture and uncooked macaroni noodles to egg mixture. Stir to combine.\n            ","\n              5. Pour into slow cooker. Top with remaining cheese.\n            ","\n              6. Sprinkle with paprika.\n            ","\n              7. Cook on LOW for 4 hours.\n            "],"source":"https://www.foodnetwork.com/recipes/3-cheese-slow-cooker-macaroni-and-cheese-recipe-2105487"},{"name":"\n  \n    3-Cheese and Herb Garlic Bread\n  \n","ingredients":["4 tablespoons unsalted butter, room temperature","2 cloves garlic, smashed and chopped ","2 tablespoons grated Asiago cheese ","2 tablespoons grated Parmesan cheese ","2 tablespoons grated Romano cheese ","2 tablespoons chopped parsley ","1 large baguette, cut into 1 1/2-inch slices on a bias "],"directions":["\n              Preheat the oven to high broil. Mix the butter, garlic, Asiago, Parmesan, Romano and parsley in a medium bowl until completely combined. Spoon some of the mixture on one side of the bread slices and put on a baking sheet, butter side up.\n            ","\n              Broil until bread is toasted and cheese mixture is bubbling, 3 to 5 minutes. Serve hot.\n            "],"source":"https://www.foodnetwork.com/recipes/nancy-fuller/3-cheese-and-herb-garlic-bread-3557725"},{"name":"\n  \n    3-Color Salad with Maple Vinaigrette\n  \n","ingredients":["2 pounds carrots","2 pounds snow peas","1 pound roasted peppers","1 cup Maple Vinaigrette, recipe follows","1/2 pound sunflower seeds","9 ounces old-fashioned mustard","38 1/2 ounces maple syrup","19 ounces cider vinegar","1 1/2 ounces sea salt","29 ounces sunflower seed oil"],"directions":["\n              Peel carrots and cut into sticks 4 inches by 1/2-inch. Cook snow peas and carrots for 1 minute in the steamer and cool in cold water. Cut the roasted peppers into slivers. Mix together vegetables with Maple Vinaigrette and sunflower seeds.\n            ","\n              Mix together mustard, maple syrup, vinegar, and salt, process in blender. To emulsify, add oil in a fine stream while continuing to process in the blender.\n            "],"source":"https://www.foodnetwork.com/recipes/3-color-salad-with-maple-vinaigrette-recipe-2012003"},{"name":"\n  \n    3-D Dog Cake\n  \n","ingredients":["1 recipe Chocolate or Vanilla Cake, recipes follow","2 recipes American Buttercream, recipe follows","Gel food coloring of your choice, for dyeing American Buttercream","Small piece white fondant","Small piece black fondant","Small piece pink fondant","Nonstick cooking spray","5 1/2 cups all-purpose flour, plus more for the pans","2 1/2 teaspoons baking powder","2 teaspoons salt","2 sticks (1 cup) unsalted butter, at room temperature","4 cups granulated sugar","1 cup vegetable oil","10 large eggs, at room temperature","2 tablespoons pure vanilla extract","2 cups milk","Nonstick cooking spray","4 cups all-purpose flour, plus more for the pans","2/3 cup cocoa powder","2 teaspoons baking soda","2 teaspoons salt","4 sticks (2 cups) butter, softened","4 cups granulated sugar","6 extra-large eggs","1 cup sour cream","1 tablespoon vanilla","2 cups hot water","1 tablespoon instant espresso powder","4 sticks (2 cups) butter, softened","6 cups powdered sugar","1 to 2 teaspoons pure vanilla extract (or any other flavor you want, or none)","Pinch kosher salt","1/4 cup whole milk"],"directions":["\n              Cut and assemble the cake on a 13-by-9-inch cake board according to the diagram, using American Buttercream frosting to adhere the cake pieces together. (Click the link at the bottom of the recipe for the diagram). Frost the entire cake with a thin and even coating of American Buttercream. Refrigerate so the frosting can set, about 1 hour.\n            ","\n              Dye the remaining American Buttercream using gel food coloring in the color you would like your dog to be. Place into a pastry bag fitted with a large grass tip and pipe \"fur\" all over the cake. Roll the white fondant into two 2-inch discs. Roll the black fondant into two small balls, then flatten each slightly and place 1 into the center of each white disc (adhere with a dab of water). Stick to the cake where you want to place the eyes. Make a teardrop with a 2-inch round of the black fondant, pinching to create nostrils; stick to the cake. Finish with an oval shape with the pink fondant, using the back of a paring knife to create a center line in the tongue' stick to the cake board coming from the dog's mouth.\n            ","\n              For the vanilla cake: Preheat the oven to 350 degrees F. Spray the bottom and sides of four 8-inch round cake pans with nonstick cooking spray; dust with flour, and tap out the excess. Line 3 regular muffin cups and 1 mini muffin cup with paper liners.\n            ","\n              Whisk together the flour, baking powder and salt in a medium bowl; set aside. Beat the butter, sugar and oil in a large bowl with an electric mixer on medium-high speed until light in color and fluffy, about 5 minutes. Beat in the eggs, one at a time. Beat in the vanilla until combined.\n            ","\n              Transfer the creamed mixture to a very large mixing bowl, then alternate folding in the flour mixture and the milk with a spatula, adding the flour in 3 additions and the milk in 2, starting and ending with the flour, just until smooth. Fill the 3 muffin cups and 1 mini muffin cup halfway with batter. Divide the remaining batter evenly among the prepared cake pans.\n            ","\n              Bake, rotating the cake pans halfway through, until a toothpick comes out clean, 8 minutes for the mini cupcake, 11 minutes for the regular, and 30 to 35 minutes for the cakes. Cool the cakes in the pans on a rack for 10 minutes, then remove the cakes to the rack to cool completely.\n            ","\n              For the chocolate cake: Preheat the oven to 350 degrees F. Spray four 8-inch cake pans with nonstick cooking spray and dust with flour, then line the bottoms with parchment. Line 3 regular muffin cups and 1 mini muffin cup with paper liners.\n            ","\n              Whisk together the flour, cocoa, baking soda and salt together in a large bowl.\n            ","\n              Beat together the butter and sugar until light and fluffy, 1 to 2 minutes. Add the eggs, one at time, and beat until incorporated. Add the sour cream and continue to beat until fully incorporated. Add the vanilla. Transfer the mixture to a large mixing bowl.\n            ","\n              Stir together the hot water and instant espresso powder in a spouted measuring cup. Whisk the dry ingredients by hand into the wet ingredients in 2 additions, alternating with the espresso and mixing just until fully incorporated.\n            ","\n              Fill the 3 muffin cups and 1 mini muffin cup halfway with batter. Divide the remaining batter evenly among the 4 prepared cake pans. Bake until a toothpick comes out clean, 8 minutes for the mini cupcake, 11 minutes for the regular cupcakes and 30 to 35 minutes for the cakes (rotate the pans halfway through). Cool the cakes in the pans on a rack for 10 minutes, then remove the cakes to the rack to cool completely.\n            ","\n              In the bowl of a stand mixer fitted with the whisk attachment, combine the butter, powdered sugar, vanilla, salt and milk. Whip the mixture on low speed for a while. When the sugar is incorporated, turn the mixer speed up and whip until the buttercream is smooth. Add milk until desired consistency is reached.\n            "],"source":"https://www.foodnetwork.com/recipes/3-d-dog-cake-3521760"},{"name":"\n  \n    3-Ingredient Banana Icebox Cake\n  \n","ingredients":["2 1/2 cups heavy cream, cold","4 bananas, plus 1 for garnish","3 cups animal crackers, plus more for garnish"],"directions":["\n              Line the bottom and sides of a 9-inch round cake pan with long pieces of plastic wrap. Whip the cream to stiff peaks in a large bowl with a mixer. Slice the bananas about 1/4 inch thick.\n            ","\n              Spread one-third of the whipped cream on the bottom of the pan. Cover with half of the banana slices in concentric circles, then top with half of the animal crackers in concentric circles. Repeat with another layer of whipped cream, bananas and crackers. Finish with the remaining whipped cream. Wrap up the cake and refrigerate overnight to let the crackers soften.\n            ","\n              To serve, unwrap the cake and invert it onto a plate. Thinly slice the remaining banana. Garnish the cake with the banana slices arranged around the edge and a few animal crackers in the middle.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-ingredient-banana-icebox-cake-3363782"},{"name":"\n  \n    3-Ingredient Banana Petit Fours\n  \n","ingredients":["2 bananas","1/2 cup peanut butter or chocolate-hazelnut spread, such as Nutella","1 cup trail mix or freeze-dried raspberries, crushed"],"directions":["\n              Cut the bananas into 1 1/2-inch pieces. Spread each piece with about 1/2 teaspoon of the peanut butter or chocolate-hazelnut spread, and dip in your favorite trail mix or crushed freeze-dried raspberries.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-ingredient-banana-petit-fours-3363589"},{"name":"\n  \n    3-Ingredient Banana Pudding\n  \n","ingredients":["1/2 cup chocolate almond milk","4 bananas, plus banana slices, for topping","2 tablespoons chia seeds"],"directions":["\n              Blend the chocolate almond milk and bananas in a blender until smooth. Stir in the chia seeds. Refrigerate in an airtight container for at least 4 hours (to give the seeds enough time to plump up) and up to overnight.\n            ","\n              Serve with banana slices on top.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-ingredient-banana-pudding-3363475"},{"name":"\n  \n    3-Ingredient Banana, Raspberry and Coconut \"Ice Cream\"\n  \n","ingredients":["2 very ripe bananas","1 tablespoon extra-virgin coconut oil","3 tablespoons raspberry jam"],"directions":["\n              Peel the bananas and cut into 1-inch pieces. Freeze until completely solid, preferably overnight.\n            ","\n              Pulse the banana chunks, coconut oil and 2 tablespoons of the raspberry jam in a food processor to begin breaking the bananas up. Stop, scrape down the sides and stir the mixture up a few times to help it along. Keep pulsing until the mixture is smooth like ice cream.\n            ","\n              To serve, swirl the remaining tablespoon of jam into the mixture. Eat right away, or freeze in an airtight container for up to 3 days.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-ingredient-banana-raspberry-and-coconut-ice-cream-3363425"},{"name":"\n  \n    3-Ingredient Gluten-Free Banana Pancakes\n  \n","ingredients":["2 large eggs","1 large banana","1/4 teaspoon pumpkin pie spice"],"directions":["\n              Blend the eggs, banana and pumpkin pie spice in a blender until smooth.\n            ","\n              Heat a large nonstick skillet or griddle over medium-low heat. Working in batches, drop silver-dollar portions of the batter (about 1 tablespoon) onto the skillet and cook until golden brown, 1 to 2 minutes per side.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-ingredient-gluten-free-banana-pancakes-3363581"},{"name":"\n  \n    3-Layer Sour Cream Cake with Cream Cheese Frosting\n  \n","ingredients":["Nonstick cooking spray, for greasing the pans","2 cups all-purpose flour ","2 teaspoons baking powder ","Pinch salt ","1 1/2 sticks unsalted butter, at room temperature ","1 1/2 cups granulated sugar ","3 large eggs ","1 1/2 teaspoons vanilla extract ","1/2 cup milk ","3/4 cup sour cream ","One 8-ounce package cream cheese, at room temperature","1 stick (8 tablespoons) unsalted butter, at room temperature ","1 cup powdered sugar ","1 teaspoon vanilla extract ","1/2 lemon, juiced "],"directions":["\n              For the sour cream cake: Preheat the oven to 350 degrees F. Grease three 6-inch cake pans with cooking spray.\n            ","\n              Combine the flour, baking powder and salt in a large bowl. Reserve.\n            ","\n              Combine the butter and granulated sugar in the bowl of a stand mixer fitted with the paddle attachment. Beat until light and fluffy. Turn the mixer off and scrape down the sides of the bowl.\n            ","\n              Beat in the eggs, one at a time. Slowly add the vanilla, milk and sour cream. Scrape down the sides of the bowl as needed. With the mixer on medium speed, gradually mix in the flour.\n            ","\n              Divide the batter evenly among the cake pans and bake until a toothpick inserted into the middle of a cake comes out clean, about 20 minutes. Let cool completely on a wire rack.\n            ","\n              For the cream cheese icing: Beat together the cream cheese, butter, powdered sugar, vanilla and lemon juice in a stand mixer or with a hand mixer until light and fluffy. Spread icing on each layer, stack layers and cover with icing.\n            "],"source":"https://www.foodnetwork.com/recipes/anne-burrell/3-layer-sour-cream-cake-with-cream-cheese-frosting-5424407"},{"name":"\n  \n    3-Peppercorn Bison with Tennessee Whiskey Sauce\n  \n","ingredients":["Four 8-ounce sirloin bison steaks, well trimmed","1/4 cup olive oil","1/2 cup mixed peppercorns, black, green and pink, coarsely ground","2 tablespoons kosher salt","2 tablespoons minced shallots","1 tablespoon minced garlic","2 tablespoons butter","1 cup Tennessee Whiskey (Recommended: Jack Daniels)","1 cup veal stock","1/2 cup cream","Salt","Pepper"],"directions":["\n              One hour prior to cooking, coat the steaks with oil and season liberally with the peppercorn mixture and salt. Grill or saute over high heat to your desired doneness, approximately 4 minutes on each side for medium rare.\n            ","\n              For the sauce: Sweat the shallots and garlic in the butter in a heavy-bottomed saucepan on medium heat. Add the whiskey and reduce by half. Add the stock and cream and simmer for 5 minutes. Season, to taste, with salt and pepper.\n            "],"source":"https://www.foodnetwork.com/recipes/3-peppercorn-bison-with-tennessee-whiskey-sauce-recipe-1951708"},{"name":"\n  \n    3-Salad Chef's Salad Plate\n  \n","ingredients":["1/2 cup sour cream","2 round tablespoons prepared horseradish, Gold's preferred brand","1/2 lemon, juiced","About 2 teaspoons Worcestershire sauce, Lea and Perrins preferred brand","A handful chives, finely chopped","A handful dill, finely chopped ","1 1/2 teaspoons (1/2 a palm full) coarse black pepper ","About 1 pound deli roast beef, leftover roast, pot roast or steaks ","Watercress or arugula, to serve ","1 pound deli sliced prosciutto cotto (cooked ham)","2 small ribs celery with leafy tops","1/2 red onion ","2 cloves garlic","2 tablespoons thyme ","1 tablespoon cayenne pepper sauce, Frank's Red Hot preferred brand, plus more to taste ","About 1 tablespoon Worcestershire sauce ","About 2 round tablespoons yellow mustard ","3 tablespoons good-quality pickle relish, Wickle's preferred brand","Gem romaine or Bibb lettuce, to serve ","1 pound cooked rotisserie chicken PLUS all the fat and drippings from its container","2 small ribs celery ","1 large shallot ","1 large clove garlic, crushed ","4 sprigs tarragon ","Salt and pepper","1/2 lemon ","2 round tablespoons Dijon mustard ","Gem romaine or Bibb lettuce","About 2 tablespoons nonpareil (small) capers ","Chopped cornichons, for serving","8 slices white sandwich bread, Pepperidge Farm preferred brand","4 store-bought hard-boiled eggs, Eggland's Best in pouch preferred brand","3/4 to 1 pound cheese, 2 rounds of aged goat cheese, Fontina val d'Aosta or Comte, or cheeses of choice "],"directions":["\n              Gather your ingredients.\n            ","\n              For the beef salad: In a mixing bowl, combine sour cream, horseradish, lemon juice, Worcestershire sauce, chives, dill and black pepper. Chop the beef and combine with sauce. When you serve, arrange watercress or arugula under and/or around rounded scoops of the salad, about 4 ounces per platter.\n            ","\n              For the deviled ham: Tear ham into coarse pieces. Add to a food processor and finely chop the ham by pulsing it 10 to 12 times. Add to a mixing bowl and return processor bowl to base. Coarsely chopped celery and onion, crush garlic and finely chop thyme and add to ham. Season the ham with cayenne pepper sauce, Worcestershire sauce, mustard and relish then stir salad with rubber spatula. Rinse processor blade and bowl and return to base. To serve, arrange a small bed of lettuce leaves under rounded scoops of deviled ham, about 4 ounces per portion.\n            ","\n              For the chicken salad: Preheat broiler.\n            ","\n              Separate the skin and bones from chicken and place meat in food processor with fat. Pulse the processor to finely chop the chicken and transfer to a mixing bowl. Add processor bowl back to base, coarsely chop the celery, shallot, crushed garlic and tarragon leaves and pulse to finely chop. Add to the chicken and season with salt and pepper. Add lemon juice and Dijon mustard and stir well with rubber spatula. To serve, arrange the chicken salad on a bed of a few leaves of lettuce and top with capers and chopped cornichons.\n            ","\n              To serve: Cut edges of bread, arrange the bread on a baking sheet and lightly toast on both sides under broiler. Cut toasts from corner to corner. Quarter the eggs lengthwise. Cut cheese into portions.\n            ","\n              Arrange platter: ham salad, hard-boiled eggs, beef salad, portion of cheese or cheeses of choice, chicken salad, 4 toast points per person.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/3-salad-chefs-salad-plate-5639192"},{"name":"\n  \n    3-Shot Cocktail (\"Bandera and Sangrita\")\n  \n","ingredients":["Tequila, 1-ounce per serving","Fresh lime juice, 1-ounce (about 2 tablespoons) per serving","Red part (Sangrita)* (See Cook's Note)","3/4 cups orange juice","3/4 cups regular or spicy tomato juice","1/4 cup fresh lime juice","1 medium jalapeno chile, stemmed, seeded and coarsely chopped","Pinch salt"],"directions":["\n              White part: Fill tequila shot glasses with tequila.\n            ","\n              Green part: Fill tequila shot glasses with lime juice.\n            ","\n              Red part: Put all of the ingredients for the sangrita in a blender and process until smooth. Fill tequila shot glasses with sangrita.\n            ","\n              Each guest is served 1 shot of each part or color to sip.\n            "],"source":"https://www.foodnetwork.com/recipes/marcela-valladolid/3-shot-cocktail-bandera-and-sangrita-recipe-2172318"},{"name":"\n  \n    3-Way Onion Burger with Applewood Bacon and Aged Smoked Cheddar on Kaiser Roll\n  \n","ingredients":["1/2 stick butter","3 tablespoons minced garlic","8 ounces tomato paste","2 1/2 cups water","1 small can chipotle peppers in adobo sauce, seeds removed and chopped","1 tablespoon Worcestershire sauce","2 tablespoons red wine vinegar","3 tablespoons yellow mustard","1/4 cup ketchup","1/4 cup dark brown sugar","1 teaspoon paprika","3 tablespoons molasses","2 tablespoons honey","1/4 cup black cherry preserves","2 teaspoons ground cumin","4 large Spanish red onions","1/2 stick butter","Minced garlic","Sea salt and freshly cracked black pepper","1 cup Chipotle BBQ Sauce","2 bunches scallions, for grilling","Olive oil","1 pound lean ground chuck","Sea salt and freshly ground black pepper","Applewood smoked bacon","4 slices aged smoked Cheddar","*Toasted Kaiser rolls","Oil, for frying","2 large sweet Vidalia onions","1/2 cup all-purpose flour","1/2 cup blue cornmeal","Salt","2 eggs"],"directions":["\n              Melt butter in large saucepan. Add the garlic, tomato paste and water. Stir until tomato paste dissolves. Add the chopped chipotle peppers (seeds removed), peppers and sauce to the pan. Stir to combine. Add the remaining ingredients and simmer for about 30 minutes.\n            ","\n              Strain and set aside.\n            ","\n              Caramelized Onions:\n            ","\n              Thinly slice the red onions. Melt butter in skillet and add garlic, onions and salt and pepper, to taste. Cook stirring occasionally until wilted. Add 1 cup Chipotle BBQ sauce simmer for 30 minutes.\n            ","\n              Beef Patties:\n            ","\n              Cut the root ends off the scallions. Brush with olive oil and place on grill. Grill both sides until grill marks appear. Remove from the grill to a cutting board. Chop and set aside.\n            ","\n              Place ground beef in a bowl and add chopped scallions, about 1 tablespoon salt and 1 tablespoon ground pepper. Mix together and form into patties about 1/2-inch thick.\n            ","\n              Wrap 1 slice applewood bacon around each patty and place on grill, about 5 to 6 minutes on each side for medium-well. Top burgers with cheese the last minute of cooking. Place on platter, cover with foil and set aside.\n            ","\n              Heat oil in a deep-fryer to 350 degrees F. Cut the onions into 1/4-inch thick slices and place in large bowl. Put flour, cornmeal, and 2 tablespoons salt in another bowl. Whisk the eggs in a small bowl, add to the onions and stir to evenly coat. In batches, place the onions in flour mixture and toss until well coated.\n            ","\n              Fry in oil until golden brown and set aside on paper towels to drain. Sprinkle with salt.\n            ","\n              Assemble burger:\n            ","\n              Toast kaiser rolls. Place 1/4 cup caramelized onions on bottom bun. Add burger patty and top with fried onion rings.\n            "],"source":"https://www.foodnetwork.com/recipes/3-way-onion-burger-with-applewood-bacon-and-aged-smoked-cheddar-on-kaiser-roll-recipe-2014178"},{"name":"\n  \n    3-in-1 Sugar Cookies\n  \n","ingredients":["2 1/2 cups all-purpose flour","1/2 teaspoon baking powder","1/4 teaspoon fine salt","1 cup (2 sticks) unsalted butter, at room temperature","3/4 cup granulated sugar","3/4 cup confectioners' sugar","2 large egg yolks","1 teaspoon pure vanilla extract","1/4 teaspoon finely grated orange zest","Coarse sugar, aka sanding or crystallized sugar","Royal Icing, recipe follows","5 tablespoons meringue powder (egg white powder)","6 tablespoons water","1 pound confectioners' sugar (about 3 3/4 to 4 cups or 1 box)","Food coloring, as desired"],"directions":["\n              Whisk the flour, baking powder, and salt in a medium bowl.\n            ","\n              Beat the butter and both sugars in another medium bowl with an electric mixer on medium-high speed until light and fluffy, about 30 seconds. Add the egg yolks, vanilla and orange zest mixing until fully incorporated. Slowly add the flour mixture, and continue beating until the dough comes together, stopping and scraping down the sides of the bowl as needed.\n            ","\n              For rolled cookies: Roll about a tablespoon of dough by hand into a ball. Dip 1 side of the balls into some coarse sugar and place them sugar-side-up on an ungreased baking sheet, leaving about 1-inch between cookies.\n            ","\n              For sliced cookies: Divide dough in half, roll by hand into 2-inch-wide logs, wrap in plastic wrap and refrigerate until firm, at least 2 hours.\n            ","\n              Cut the logs into 1/4-inch-thick cookies and place them on ungreased baking sheets, leaving about 1-inch between cookies.\n            ","\n              For cutout cookies: Divide dough in half, pat into disks, wrap in plastic wrap and refrigerate until firm, at least 2 hours.\n            ","\n              Roll dough between lightly floured parchment, or waxed paper, until about 1/3-inch thick. Transfer sheets to a baking sheet and refrigerate until firm, about 30 minutes. Cut into desired shape using a cookie cutter, place them on ungreased baking sheets, leaving about 1-inch between cookies. (Gather the dough scraps together, pat into a disk, chill and reroll.)\n            ","\n              Refrigerate cookies while preheating the oven to 375 degrees F, for at least 30 minutes.\n            ","\n              Bake the cookies, until the bottoms are golden, about 10 to 15 minutes depending on shape. Cool on sheets until firm enough to transfer to a rack to cool. Decorate as desired and serve, or store in an airtight container at room temperature for up to 1 month.\n            ","\n              Combine all the ingredients, except the food coloring, in the bowl of a standing mixer fitted with the paddle attachment. Mix slowly until stiff enough to form peaks. The icing should be pure white and thick, but not fluffy and bubbly. If the frosting is overbeaten, it will get aerated which makes it harder to work with. If this happens, let the frosting sit to settle, then use a rubber spatula to vigorously beat and smooth out the frosting.\n            ","\n              Alternatively, combine ingredients in a large bowl, and beat with hand beaters on low speed until the frosting thickens to stiff peaks.\n            ","\n              Add up to 1 tablespoon food coloring and mix with a rubber spatula until the color is uniform. (Adding too much color reduces the sheen of the frosting and can break down the consistency of the frosting over a couple of days.) Store icing, covered, with plastic film on the surface of the icing.\n            ","\n              Yield: 1 pound royal icing (1 2/3 cup)\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/3-in-1-sugar-cookies-recipe-1928137"},{"name":"\n  \n    30 - Minute Chili\n  \n","ingredients":["1 pound ground chuck beef (80% lean)","3/4 cup chopped yellow onion","1 pkg (1.25 oz each) chili seasoning mix","1 can (16 oz each) beans in chili seasoned sauce, undrained","1 can (14.5 oz each) Hunt's® Diced Tomatoes, undrained","1 can (10 oz each) Ro*Tel® Original Diced Tomatoes & Green Chilies, undrained","1 can (8 oz each) Hunt's® Tomato Sauce","1 cup water"],"directions":["\n              1. Cook beef and onion in large saucepan over medium-high heat 5 minutes or until beef is crumbled and no longer pink, stirring occasionally; drain. \n            ","\n              2. Stir in seasoning mix. Add remaining ingredients; bring to a boil. Reduce heat to medium; simmer 10 minutes, stirring several times.\n            "],"source":"https://www.foodnetwork.com/recipes/30-minute-chili-recipe-2108794"},{"name":"\n  \n    30 Minute Garlic-Parsley Chicken-Under-a-Brick\n  \n","ingredients":["4 large cloves garlic, cracked away from skin","1 cup flat-leaf parsley, a few generous handfuls","1/2 cup Marcona almonds (Spanish peeled, toasted nuts available in bulk section of many markets) or, toasted slivered almonds","1 lemon, grate 1 tablespoon zest then cut into wedges","4 bone-in, skin-on chicken breasts or thighs","2 tablespoons grill seasoning blend (recommended: Montreal Steak Seasoning by McCormick)","Extra-virgin olive oil, for liberal drizzling"],"directions":["\n              Preheat a heavy bottomed skillet over medium-high to high heat and preheat oven to 400 degrees F.\n            ","\n              Combine the garlic, parsley, almonds and lemon zest in food processor and pulse to grind into a dry paste. Loosen skin on chicken and layer 1/4 of the mixture under the skin on each piece of chicken. Wash your hands, grease the breasts with a liberal drizzle of extra-virgin olive oil and season with grill seasoning. Place skin side of the breasts down in the skillet and top with another, smaller skillet. Weight the pan with a brick. Cook to crisp skin, 6 to 8 minutes. Transfer the pan to hot oven and roast for 15 minutes.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/30-minute-garlic-parsley-chicken-under-a-brick-recipe-1952352"},{"name":"\n  \n    30 Minute Shepherd's Pie\n  \n","ingredients":["2 pounds potatoes, such as russet, peeled and cubed","2 tablespoons sour cream or softened cream cheese","1 large egg yolk","1/2 cup cream, for a lighter version substitute vegetable or chicken broth","Salt and freshly ground black pepper","1 tablespoon extra-virgin olive oil, 1 turn of the pan","1 3/4 pounds ground beef or ground lamb","1 carrot, peeled and chopped","1 onion, chopped","2 tablespoons butter","2 tablespoons all-purpose flour","1 cup beef stock or broth","2 teaspoons Worcestershire, eyeball it","1/2 cup frozen peas, a couple of handfuls","1 teaspoon sweet paprika","2 tablespoons chopped fresh parsley leaves"],"directions":["\n              Boil potatoes in salted water until tender, about 12 minutes. Drain potatoes and pour them into a bowl. Combine sour cream, egg yolk and cream. Add the cream mixture into potatoes and mash until potatoes are almost smooth.\n            ","\n              While potatoes boil, preheat a large skillet over medium high heat. Add oil to hot pan with beef or lamb. Season meat with salt and pepper. Brown and crumble meat for 3 or 4 minutes. If you are using lamb and the pan is fatty, spoon away some of the drippings. Add chopped carrot and onion to the meat. Cook veggies with meat 5 minutes, stirring frequently. In a second small skillet over medium heat cook butter and flour together 2 minutes. Whisk in broth and Worcestershire sauce. Thicken gravy 1 minute. Add gravy to meat and vegetables. Stir in peas.\n            ","\n              Preheat broiler to high. Fill a small flameproof rectangular casserole with meat and vegetable mixture. Spoon potatoes over meat evenly. Top potatoes with paprika and broil 6 to 8 inches from the heat until potatoes are evenly browned. Top casserole dish with chopped parsley and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/30-minute-shepherds-pie-recipe-1913518"},{"name":"\n  \n    30 Minute Shepherd's Pie\n  \n","ingredients":["2 pounds potatoes, such as russet, peeled and cubed","2 tablespoons sour cream or softened cream cheese","1 large egg yolk","1/2 cup cream, for a lighter version substitute vegetable or chicken broth","Salt and freshly ground black pepper","1 tablespoon extra-virgin olive oil, 1 turn of the pan","1 3/4 pounds ground beef or ground lamb","1 carrot, peeled and chopped","1 onion, chopped","2 tablespoons butter","2 tablespoons all-purpose flour","1 cup beef stock or broth","2 teaspoons Worcestershire, eyeball it","1/2 cup frozen peas, a couple of handfuls","1 teaspoon sweet paprika","2 tablespoons chopped fresh parsley leaves"],"directions":["\n              Boil potatoes in salted water until tender, about 12 minutes. Drain potatoes and pour them into a bowl. Combine sour cream, egg yolk and cream. Add the cream mixture into potatoes and mash until potatoes are almost smooth.\n            ","\n              While potatoes boil, preheat a large skillet over medium high heat. Add oil to hot pan with beef or lamb. Season meat with salt and pepper. Brown and crumble meat for 3 or 4 minutes. If you are using lamb and the pan is fatty, spoon away some of the drippings. Add chopped carrot and onion to the meat. Cook veggies with meat 5 minutes, stirring frequently. In a second small skillet over medium heat cook butter and flour together 2 minutes. Whisk in broth and Worcestershire sauce. Thicken gravy 1 minute. Add gravy to meat and vegetables. Stir in peas.\n            ","\n              Preheat broiler to high. Fill a small rectangular flameproof casserole with meat and vegetable mixture. Spoon potatoes over meat evenly. Top potatoes with paprika and broil 6 to 8 inches from the heat until potatoes are evenly browned. Top casserole dish with chopped parsley and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/30-minute-shepherds-pie-recipe2-1956652"},{"name":"\n  \n    30 Minute Southern Classic: Country Captain Chicken\n  \n","ingredients":["2 3/4 cups water","1 tablespoon butter","1 1/2 cups white and wild rice or long grain rice","2/3 cup flour, eyeball it","1 rounded tablespoon sweet paprika","4 pieces, 6 ounces each, boneless, skinless chicken breast","3 boneless, skinless chicken thighs","Salt and freshly ground black pepper","2 tablespoons extra-virgin olive oil, 2 turns of the pan","2 tablespoons butter","1 green bell pepper, seeded and chopped","1 red bell pepper, seeded and chopped","1 medium onion, chopped","2 or 3 large cloves garlic, smashed","1 tablespoon curry powder or mild curry paste","1 cup chicken stock","1 can diced tomatoes in puree or chunky style crushed tomatoes","1/4 cup golden raisins or currants, a couple of handfuls","2 ounces, 1 small pouch, sliced almonds, lightly toasted","3 scallions, chopped, for garnish"],"directions":["\n              Bring water to a boil in a medium saucepan. Add butter and rice and return water to a boil. Reduce heat to low and cover the pot. Cook rice 20 minutes or until tender. Turn off heat and fluff rice with a fork.\n            ","\n              Combine flour and paprika in a shallow dish. Season chicken with salt and pepper. Cut each chicken breast and thigh in 1/2 on an angle. Coat chicken pieces in paprika seasoned flour. Wash your hands and chicken work surfaces thoroughly.\n            ","\n              Heat a large skillet over medium high heat. Add oil to the pan. Brown chicken pieces, 3 minutes on each side, and remove from the skillet. Add butter to the pan, then stir in peppers, onions and garlic. Season the veggies with salt and pepper and saute them 5 to 7 minutes to soften. Add curry, stock, tomatoes and raisins. Slide chicken back into the skillet and simmer over moderate heat for 5 minutes to combine flavors and finish cooking the chicken through. Place skillet on a trivet and serve the chicken from the pan. Garnish the Country Captain's chicken with sliced almonds. Transfer rice to a serving dish and garnish with chopped scallions.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/30-minute-southern-classic-country-captain-chicken-recipe-2013490"},{"name":"\n  \n    30-Mile Pot Pie\n  \n","ingredients":["6 1/2 cups 'hearty' chicken stock or broth","Six 6-ounce boneless skinless chicken breasts, diced","1 stick butter","2 1/2 cups diced onions","2 1/4 cups diced carrots","1 3/4 cups diced celery","1/2 pound medium mushrooms, quartered","1 cup all-purpose flour","1 bay leaf","1 teaspoon salt","1/4 teaspoon white pepper, or 1/2 teaspoon black pepper","3/4 cup heavy whipping cream, warmed","Store-bought puff pastry or pie dough","2 egg whites"],"directions":["\n              Preheat oven to 375 degrees F.\n            ","\n              In a medium saucepan, bring stock or broth to a simmer. Add chicken and poach until just cooked through. With a spider or slotted spoon, remove chicken and set aside. Set stock aside for later use.\n            ","\n              In a 10-quart saucepot, melt butter over medium heat and then add onions, carrots, and celery and saute for a couple of minutes. Add mushrooms and continue to cook until onions are about transparent, being careful not to brown. Add flour and gently mix well. Cook this mixture over low heat for 6 to 8 minutes, stirring occasionally and gently so as not to break up the vegetables. Scrape the bottom of the pan often with a wooden spoon so that the roux doesn't burn. Increase the heat and add the chicken stock in 3 additions, whisking well after each so that no lumps appear and returning to a brief simmer each time.\n            ","\n              Add bay leaf, salt, and pepper, and cook over low heat for about 10 more minutes. Add poached chicken and warm heavy cream, and stir well. Spoon equal portions into 6 individual (16-ounce) ovenproof casserole dishes or bowls. Top with your favorite pie dough or puff pastry.\n            ","\n              In a small bowl, whisk together 2 egg whites with a little water. Brush dough with egg wash. Place casseroles on a sheet pan and bake until golden brown on top. Remove from the oven and let cool for 5 to 10 minutes before serving.\n            "],"source":"https://www.foodnetwork.com/recipes/30-mile-pot-pie-recipe-1942654"},{"name":"\n  \n    30-Minute Chili\n  \n","ingredients":["1 pound ground chuck beef (80% lean)","¾ cup chopped yellow onion","1 pkg (1.25 oz each) chili seasoning mix","1 can (16 oz each) beans in chili seasoned sauce, undrained","1 can (14.5 oz each) Hunt's® Diced Tomatoes, undrained","1 can (10 oz each) Ro*Tel® Original Diced Tomatoes & Green Chilies, undrained","1 can (8 oz each) or 1 cup Hunt's® Tomato Sauce","1 cup water"],"directions":["\n              Cook beef and onion in large saucepan over medium-high heat 5 minutes or until beef is crumbled and no longer pink, stirring occasionally; drain. \n            ","\n              Stir in seasoning mix. Add remaining ingredients; bring to a boil. Reduce heat to medium; simmer 10 minutes, stirring several times. \n            ","\n              This recipe was shared by Hunt's.\n            "],"source":"https://www.foodnetwork.com/recipes/30-minute-chili-3416182"},{"name":"\n  \n    30-Minute Chili\n  \n","ingredients":["1 pound ground chuck beef (80% lean)","¾ cup chopped yellow onion","1 pkg (1.25 oz each) chili seasoning mix","1 can (16 oz each) beans in chili seasoned sauce, undrained","1 can (14.5 oz each) Hunt's® Diced Tomatoes, undrained","1 can (10 oz each) Ro*Tel® Original Diced Tomatoes & Green Chilies, undrained","1 can (8 oz each) or 1 cup Hunt's® Tomato Sauce","1 cup water"],"directions":["\n              Cook beef and onion in large saucepan over medium-high heat 5 minutes or until beef is crumbled and no longer pink, stirring occasionally; drain. Stir in seasoning mix. Add remaining ingredients; bring to a boil. Reduce heat to medium; simmer 10 minutes, stirring several times. This recipe was shared by Hunt's.\n            "],"source":"https://www.foodnetwork.com/recipes/30-minute-chili0-3416482"},{"name":"\n  \n    30-Minute Cod with Lemony Braised Fennel\n  \n","ingredients":["2 large bulbs fennel","1/4 cup plus 2 tablespoons olive oil","Kosher salt and freshly ground black pepper","Four 6-ounce cod fillets, each 1 to 1 1/2 inches thick","1 lemon","1/2 cup panko breadcrumbs","1/2 cup pitted kalamata olives"],"directions":["\n              Trim the tops and bottoms from the fennel bulbs, reserving a handful of the fronds for garnish. Quarter the bulbs. Set each quarter on its side and slice off most of the core. Cut the quarters into wedges about 1-inch thick (don't worry if some pieces fall off the wedge-use those too).\n            ","\n              Put 1/4 cup oil in a large skillet with a tight-fitting lid. Place over medium-high heat until almost smoking. Add the fennel and cook without stirring until fennel is brown on the bottom, about 5 minutes. Stir and let the fennel continue to cook until some more pieces brown, 1 to 2 minutes.\n            ","\n              Add 1/2 cup water to the skillet, scraping up any browned bits from the bottom. Sprinkle with 1/2 teaspoon of salt and several grinds of pepper. Lower the heat to medium, cover the skillet, and cook 5 minutes.\n            ","\n              Sprinkle the cod with salt and pepper and place on top of the fennel. Cover the pan again and simmer, adding more liquid occasionally if the pan is dry, until the fennel is very tender and the cod is cooked through, 5 to 7 minutes.\n            ","\n              Meanwhile, chop the reserved fennel fronds (you should have about 1 1/2 to 2 tablespoons) and remove the zest from the lemon. Heat the remaining 2 tablespoons of oil in a medium skillet over medium-high heat. Add the breadcrumbs and cook, stirring frequently, until the breadcrumbs brown, 2 to 3 minutes. Remove from the heat, season with salt and pepper, and allow to cool. Mix the fennel fronds and lemon zest into the breadcrumbs until combined.\n            ","\n              Juice the lemon. Roughly chop the olives.\n            ","\n              When the cod and fennel are done, stir in the lemon juice and the olives. Remove from the heat and let stand for about 1 minute to warm the olives. Transfer the fennel and cod to serving bowls and top the fish with the toasted breadcrumbs. Pour any remaining pan juices over the fennel.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-cod-with-lemony-braised-fennel-3362795"},{"name":"\n  \n    30-Minute Coq au Vin\n  \n","ingredients":["4 slices thick-cut bacon, cut into 1/2 inch strips (about 4 1/2 ounces)","10 ounces cremini mushrooms, halved or quartered","Kosher salt and freshly ground black pepper","2 cloves garlic, minced","1 1/2 tablespoons all-purpose flour","2 teaspoons tomato paste","1 1/2 cups chicken broth","1 cup red wine","1 1/2 cups frozen pearl onions","2 sprigs fresh thyme or pinch dried thyme","2 tablespoons cold unsalted butter, cut into 4 pieces","Pinch sugar, optional","1 cooked rotisserie chicken, cut into 8 pieces","1 teaspoon chopped fresh parsley, for garnish"],"directions":["\n              Put the bacon into an unheated large, high-sided skillet and cook over medium heat, stirring periodically, until the bacon is browned and crisp, about 8 minutes. Transfer the bacon to a small bowl with a slotted spoon; set aside.\n            ","\n              Discard all but 2 tablespoons of the bacon fat in the pan. Increase the heat to medium-high. Add the mushrooms, 1/4 teaspoon salt and several grinds of pepper and cook until browned, 2 to 3 minutes. Stir in the garlic, flour and tomato paste and cook, stirring, until the tomato paste darkens a little, about 1 minute. Add the chicken broth, wine, onions, thyme, 1/2 teaspoon salt and more pepper. Bring to a boil, then let simmer until thickened, about 4 minutes.\n            ","\n              Turn the heat down to medium, and whisk in the butter a little at a time. If the sauce tastes a little too acidic, add the sugar. Nestle the chicken and cooked bacon into the sauce, and simmer gently until the chicken is heated through, 6 to 7 minutes. (This could take up to 10 minutes if the chicken is cold, or as little as 3 minutes if it is warm.) Spoon the sauce over the chicken pieces periodically to coat completely. Toss the chicken in the sauce, remove the thyme stems, sprinkle with the parsley and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-coq-au-vin-3362586"},{"name":"\n  \n    30-Minute Grilled Chicken Thighs with Watermelon and Feta Salad\n  \n","ingredients":["5 large garlic cloves, 4 grated, 1 whole","1/2 cup plus 2 tablespoons extra-virgin olive oil, plus more for oiling the grill grates","Zest and juice of 2 lemons","1 tablespoon dried oregano","4 large bone-in, skin-on chicken thighs (about 2 pounds)","1/2 of a medium watermelon (about 3 pounds)","1 garden cucumber, peeled (8 ounces)","One 4-ounce block feta","1/2 cup pitted Kalamata olives","Kosher salt and freshly ground black pepper","1/2 baguette, halved length-wise","1/2 cup fresh mint leaves, torn into large pieces"],"directions":["\n              Prepare a grill for medium heat.\n            ","\n              Put the grated garlic into a large resealable bag. Add 1/4 cup oil, the lemon zest and juice, oregano and the chicken. Seal the bag tightly and use your hands to vigorously massage the marinade into the chicken, making sure that the chicken is evenly coated. Marinate for at least 10 minutes at room temperature.\n            ","\n              Meanwhile, remove the rind from the watermelon, cut the fruit into 1-inch cubes and put in a large mixing bowl. (You should have about 6 cups total.) Quarter the cucumber lengthwise and cut into 1-inch pieces. Place on top of the watermelon in the mixing bowl. Cut the feta into 1/2-inch cubes, put on top of the cucumber and top with the Kalamata olives. (Do not mix yet.) Reserve.\n            ","\n              Remove the chicken from the marinade and place on a platter. Lightly oil the grill grates. Sprinkle the chicken liberally with salt and pepper and arrange the pieces skin-side down on the grill, leaving some space between the pieces. Cook until the skin is lightly charred and releases itself from the grill, about 2 minutes. Then rotate the chicken about 90 degrees so that the skin won't burn and cook another 2 minutes. Flip and cook for an additional 5 minutes. Cover the grill and cook until an instant-read thermometer inserted into the deepest part of each chicken thigh reads 165 degrees F, about 5 more minutes. Transfer to a platter and rest for at least 5 minutes before serving.\n            ","\n              While the chicken is resting, brush the cut sides of the baguette halves with 2 tablespoons oil and sprinkle with salt and pepper. Arrange the bread cut-side down on the grill until lightly charred and warmed through, about 2 minutes. Halve the remaining garlic clove and lightly rub the cut sides of the garlic onto the hot bread. Halve each piece of baguette.\n            ","\n              Scatter most of the mint over the watermelon mixture. Add the remaining 1/4 cup extra-virgin olive oil and a large pinch of salt and pepper and gently stir to combine.\n            ","\n              Divide the watermelon salad among 4 large dinner plates along with a piece of chicken and some bread. Garnish with the remaining mint and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-grilled-chicken-thighs-with-watermelon-and-feta-salad-3362885"},{"name":"\n  \n    30-Minute Pan-Seared Salmon with Baby Bok Choy and Shiitake Mushrooms\n  \n","ingredients":["3/4 cup basmati rice","Kosher salt","4 heads baby bok choy","1/4 pound shiitake mushrooms, stems removed","3 to 4 tablespoons vegetable oil","4 scallions, white parts thinly sliced and the green parts cut in 1-inch lengths","Freshly ground black pepper","1 tablespoon low-sodium soy sauce, plus more for drizzling","1/2 teaspoon rice wine vinegar","Four 6-ounce pieces salmon fillet, skin removed"],"directions":["\n              Combine 1 1/2 cups of water, the rice and 1/2 teaspoon salt in a small saucepan and bring to a boil. Reduce the heat, cover and simmer until the rice is tender and most of the water is absorbed, about 15 minutes. Remove from heat and let rest. Fluff with a fork right before serving.\n            ","\n              Meannwhile, quarter the bok choy through the stem ends. Halve the mushroom caps (or quarter them if they are large) by stacking them and cutting them in batches.\n            ","\n              Heat 2 large nonstick skillets with 1 tablespoon oil in each over medium-high heat. Divide the bok choy between the two pans, placing it cut-side down. Cook, undisturbed, until charred in spots, 2 to 3 minutes. By this time, the leaves will be fairly wilted, and there will be enough room to transfer all of the bok choy into just one skillet to finish cooking. Place the bok choy so that the other cut side faces down. Cook until charred in spots, about 2 minutes. Add the mushrooms, scallion whites, 1/2 teaspoon salt and a few grinds of pepper. Continue to cook, stirring, until the bok choy and mushrooms are soft, about 4 minutes (if the skillet looks dry add 1 more tablespoon of oil). Stir in the scallion greens, then remove the skillet from the heat. Stir in the soy sauce and vinegar.\n            ","\n              While the bok choy cooks, pat the fish dry with paper towels and sprinkle with 1/2 teaspoon salt and a few grinds of pepper. Wipe out the other skillet and add 1 tablespoon vegetable oil. Put the salmon into the hot skillet, flesh-side down, and cook until golden brown and crisp, about 4 minutes. Flip with a spatula and cook the other side to the desired level of doneness, 2 to 3 minutes more.\n            ","\n              Divide the vegetables and rice between 4 plates and top each with a piece of salmon. Drizzle with a little extra soy sauce.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-pan-seared-salmon-with-baby-bok-choy-and-shiitake-mushrooms-3362897"},{"name":"\n  \n    30-Minute Roasted Pork with Grapes and Couscous\n  \n","ingredients":["3 cups mixed black and green seedless grapes","10 to 12 fresh sage leaves","3 tablespoons extra-virgin olive oil","Kosher salt and freshly ground black pepper","1 pork tenderloin, trimmed and patted dry (about 1 1/4 pounds)","1/2 cup couscous","2 tablespoons walnuts, chopped"],"directions":["\n              Position 2 oven racks in the top and middle position, and preheat to 450 degrees F. Toss the grapes and sage leaves with 2 tablespoons of the oil, 1 teaspoon salt and a few grinds of pepper on a rimmed baking sheet. Bake on the top rack until the grapes have shriveled and softened and the skins have browned, 15 to 20 minutes. Pull out some of the sage leaves to use as garnish.\n            ","\n              Meanwhile, season the pork all over with 1/2 teaspoon salt and a few grinds of pepper. Heat the remaining tablespoon of oil in a large ovenproof skillet over high heat. Add the pork and cook, turning as needed, until well-browned on all sides, about 5 minutes. Transfer the skillet to the middle rack of the oven, and roast the pork until an instant-read thermometer inserted in the center registers 145 degrees F, 11 to 12 minutes. Set aside to rest.\n            ","\n              While the grapes and pork roast, put the couscous in a medium bowl. Add just enough hot water to cover the couscous, cover with plastic wrap and let sit until all the liquid is absorbed and the couscous is tender, about 5 minutes. Fluff with a fork.\n            ","\n              Slice the pork. Put the couscous on a serving platter, and top with the pork and grapes. Sprinkle with the walnuts and reserved sage leaves.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-roasted-pork-with-grapes-and-couscous-3362775"},{"name":"\n  \n    30-Minute Spicy Pork and Sweet Potato Stew\n  \n","ingredients":["1 cup canned unsalted diced tomatoes","1 medium white onion, quartered","2 cloves garlic","1/2 chipotle in adobo sauce, plus 1 tablespoon of the sauce","2 tablespoons vegetable oil","1 large pork tenderloin, trimmed and cut into 1-inch chunks (about 1 1/2 pounds)","Kosher salt and freshly ground black pepper","1 tablespoon chili powder","One 8-ounce sweet potato, peeled and cut into 1/2-inch chunks","2 cups low-sodium chicken broth","1 tablespoon pickled jalapenos","1 cup 2 percent Greek yogurt","1/4 medium head red cabbage","1 medium Haas avocado","1 lime","1/2 cup loosely packed fresh cilantro","Eight 6-inch corn tortillas, warmed"],"directions":["\n              Puree the tomatoes, onions, garlic, chipotle and adobo sauce in a food processor until completely smooth.\n            ","\n              Heat the oil in a large Dutch oven or pot over medium-high heat until nearly smoking. Add the pork in a single layer, season with 1 teaspoon salt and 1/2 teaspoon pepper and cook, undisturbed, until beginning to brown, about 2 minutes. Turn the pieces and cook until brown, about 1 minute more. Dust the meat with the chili powder, and add the tomato puree, sweet potatoes, chicken broth, 1/4 teaspoon salt and a few grinds of pepper. Bring to a boil, reduce the heat to medium, cover and gently simmer until the meat is cooked through and the potatoes are tender, about 15 minutes.\n            ","\n              Meanwhile, prepare the toppings: Chop the jalapenos, and whisk together with the yogurt in a small bowl. Shred the cabbage, cut the avocado into chunks and cut the lime into wedges.\n            ","\n              Ladle the stew into large, deep bowls. Top with the yogurt mixture, garnish with the cabbage, avocado, lime and cilantro and serve with the tortillas.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-spicy-pork-and-sweet-potato-stew-3362961"},{"name":"\n  \n    30-Minute Turkey Chili\n  \n","ingredients":["3 tablespoons extra-virgin olive oil","1 medium yellow onion, chopped","5 cloves garlic, chopped","Kosher salt","2 teaspoons chili powder","1 teaspoon dried oregano","1 tablespoon tomato paste","1 chipotle chile en adobo, coarsely chopped, with 1 tablespoon sauce","1 pound ground turkey","1 (12-ounce) Mexican lager-style beer","1 (14 12-ounce) can whole peeled tomatoes, with their juice","1 (15 12-ounce) can kidney beans, rinsed and drained","Sliced scallions, cilantro sprigs, avocado, sour cream, grated Monterey Jack cheese, and/or tortilla chips, for garnish, optional"],"directions":["\n              1. Heat olive oil in a large, heavy skillet over medium-high heat. Add onion, garlic, 1 tablespoon salt, chili powder, and oregano and cook, stirring, until fragrant, about 3 minutes.\n            ","\n              2. Stir in tomato paste and chipotle chile and sauce; cook 1 minute more. Add turkey, breaking it up with a wooden spoon, and cook until meat begins to brown, about 3 minutes. Add beer and simmer until reduced by about half, about 8 minutes. Add tomatoes-crushing them through your fingers into skillet-along with their juices and beans; bring to a boil. Cook, uncovered and stirring occasionally, until thickened, about 10 minutes.\n            ","\n              3. Ladle chili into bowls and serve with garnishes of your choice.\n            ","\n              Calories: 400\n            ","\n              Total Fat: 13 grams\n            ","\n              Saturated Fat: 1.5 grams\n            ","\n              Total Carbohydrate: 34 grams\n            ","\n              Protein: 38 grams\n            ","\n              Sodium: 510 milligrams\n            ","\n              Cholesterol: 45 milligrams\n            ","\n              Fiber: 12 grams\n            "],"source":"https://www.foodnetwork.com/recipes/30-minute-turkey-chili-2105986"},{"name":"\n  \n    30-Minute Turkey Chili\n  \n","ingredients":["3 tablespoons extra-virgin olive oil","1 medium yellow onion, chopped","5 cloves garlic, chopped","1 tablespoon kosher salt","2 teaspoons chili powder","1 teaspoon dried oregano","1 tablespoon tomato paste","1 chipotle chile en adobo, coarsely chopped, with 1 tablespoon sauce","1 pound ground turkey or 12 ounces soy crumbles","One 12-ounce Mexican lager-style beer","One 14 1/2-ounce can whole peeled tomatoes, with their juice","One 15 1/2-ounce can kidney beans, rinsed and drained","Optional garnishes: Sliced scallions, cilantro sprigs, avocado, sour cream, grated Monterey jack cheese, and/or tortilla chips"],"directions":["\n              Heat the olive oil in a large, heavy skillet over medium-high heat. Add the onion, garlic, salt, chili powder, and oregano and cook, stirring, until fragrant, about 3 minutes. Stir in the tomato paste and the chipotle chile and sauce; cook 1 minute more. Add the turkey, breaking it up with a wooden spoon, and cook until the meat loses its raw color, about 3 minutes. Add the beer and simmer until reduced by about half, about 8 minutes. Add the tomatoes--crushing them through your fingers into the skillet--along with their juices and the beans; bring to a boil. Cook, uncovered, stirring occasionally, until thick, about 10 minutes. \n            ","\n              Ladle the chili into bowls and serve with the garnishes of your choice.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/30-minute-turkey-chili-recipe-2009060"},{"name":"\n  \n    30-Second Chocolate Cake\n  \n","ingredients":["4 oz chocolate (bittersweet preferably)","4 large eggs","6 tablespoons sugar","3 tablespoons flour","Powdered sugar for dusting"],"directions":["\n              In a microwave-safe bowl, melt the chocolate. Add and thoroughly whisk together the eggs, sugar, and flour. Pass the mixture through a strainer to remove any lumps and to filter out the chalazaes (the little white strands that attach the yolk to the egg white). Transfer to whipper and pressurize. Spray mixture into a greased glass, ramekin, or whatever microwave-safe container you will cook it in, leaving at least the top third of the container empty. (A clear glass is nice to use, as you can can see the cake rise and fall as it cooks.) Microwave for 30 seconds or until the foam has set. Flip onto a plate and dust with powdered sugar. (For better-tasting results, try adding Nutella or Fluff: Spray a thin layer of cake batter, drop a spoonful of filling into the center, and then spray more cake batter on top of and around the filling.)\n            "],"source":"https://www.foodnetwork.com/recipes/30-second-chocolate-cake-2010435"},{"name":"\n  \n    36 individual puddings\n  \n","ingredients":["1 (2 1/2 pound) cabbage, preferably with dark-green outer leaves intact","1 pound parsnips (about 3 large)","1 onion (about 1/2 pound)","1 pound russet baking potatoes (about 2 medium)","3 1/2 tablespoons unsalted butter","2 teaspoons salt","Freshly grated nutmeg","5 ounces (about 1/2 cup) fresh robiola or mascarpone"],"directions":["\n              Keeping cabbage whole, cut out and discard core and any discolored outer leaves. Beginning at top of head and working with 1 leaf at a time, remove 6 outer leaves, rolling each one back on itself until it can be loosened intact from head and reserve. Cut remaining cabbage head into 8 wedges and cut each wedge crosswise into 3 pieces. Separate layers of cabbage pieces. Peel parsnips and diagonally cut into 1/8-inch-thick slices.\n            ","\n              Bring a large kettle of salted water to boil and cook reserved cabbage leaves until just tender, 3 to 5 minutes. With a slotted spoon, transfer cabbage leaves to a kitchen towel to drain. Add cabbage pieces to boiling water and cook until crisp-tender, about 3 minutes. With slotted spoon transfer pieces to colander to drain and transfer to a bowl. Add potatoes to boiling water and cook just tender, about 4 minutes. With slotted spoon transfer potatoes to colander to drain and transfer to another bowl. Add parsnips to boiling water and cook until just tender, about 3 minutes. Drain parsnips in colander.\n            ","\n              In a 12-inch heavy skillet cook onion in 3 tablespoons butter over moderately low heat, stirring, until softened. Add cabbage pieces, salt, nutmeg, and pepper to taste and cook mixture over moderate heat, stirring occasionally, until cabbage is tender, about 10 minutes. If any liquid remains in skillet, cook mixture over high heat until liquid is evaporated, about 1 minute.\n            ","\n              If using robiola, cut into pieces. Stir robiola or mascarpone into cabbage mixture and cook over moderate heat, stirring until cheese is melted.\n            ","\n              Preheat oven to 375 degrees F.\n            ","\n              Butter a 2-quart ovenproof round serving dish (about 8 1/2 to 9 inches across and 2 1/2 inches deep) and line with cabbage leaves, letting leaves overhang 1 to 2 inches. Arrange half of potatoes in serving dish and season with salt and pepper. Top potatoes in dish with half of cabbage mixture and arrange half of parsnips over cabbage. Repeat layering with remaining potatoes, cabbage mixture, and parsnips, arranging last layer of parsnips decoratively around edge of casserole and leaving cabbage exposed in center. Dot parsnips with remaining 1/2 tablespoon butter. Fold cabbage leaves over parsnips and cover tightly with a double layer of foil. Casserole may be prepared up to this point 1 day ahead and chilled. Bring casserole to room temperature before proceeding. Bake casserole until heated through and bubbling, about 1 hour.\n            ","\n              Let casserole stand 10 minutes before serving.\n            "],"source":"https://www.foodnetwork.com/recipes/36-individual-puddings-1911027"},{"name":"\n  \n    4 Cheese Souffle\n  \n","ingredients":["1 onion, diced","4 tablespoons butter","4 tablespoons all-purpose flour","1 cup whole milk","1/2 cup shredded Cheddar","1/2 cup shredded Swiss cheese","1/4 cup shredded Monterey Jack","1/4 cup shredded Muenster","Salt and pepper","5 eggs, separated"],"directions":["\n              Preheat oven to 350 degrees F.\n            ","\n              Saute onion in butter until translucent. Whisk in flour to form a roux. Gradually whisk in milk until thickened. Add cheeses and season. Remove from heat and beat in yolks. Allow to cool.\n            ","\n              While egg yolks are cooling, beat whites to stiff peak. Gently fold in whites to cheese mixture. Add to buttered 1 1/2-quart casserole dish and bake for 35 to 40 minutes.\n            ","\n              Serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/paula-deen/4-cheese-souffle-recipe-1946285"},{"name":"\n  \n    4 Cheese Stuffed Shells\n  \n","ingredients":["Salt","8 pieces jumbo pasta shells","1 1/2 pounds ricotta cheese or part skim ricotta cheese","1 pound mozzarella, diced","1/2 cup grated Parmigiano-Reggiano","1 cup shredded Asiago","1/4 cup chopped flat-leaf parsley","2 tablespoons extra-virgin olive oil, 2 turns of the pan","3 cloves garlic, chopped","1 small onion, finely chopped","1 can (28 ounces) crushed tomatoes","Salt and freshly ground black pepper","6 or 7 leaves fresh basil, torn or shredded"],"directions":["\n              Preheat oven or broiler to 450 degrees F.\n            ","\n              Bring a large pot of water to a boil. Salt water and add pasta. Cook shells 12 to 15 minutes, they should be softened but still undercooked at the center. Drain pasta and cool.\n            ","\n              Combine ricotta, 1/2 of the diced mozzarella, a couple of handfuls of Parmigiano and 1/2 of the Asiago. Add parsley to the cheeses and stir to combine.\n            ","\n              To a small saucepot over moderate heat add oil, garlic and onions. Saute onions and garlic 5 minutes. Add tomatoes and season sauce with salt and pepper. Simmer sauce 5 minutes and stir in basil leaves\n            ","\n              Pour a little sauce into the bottom of a shallow medium sized flameproof casserole dish. Fill shells with rounded spoonfuls of cheese mixture and arrange them seam side down in casserole dish. Top shells with remaining sauce and remaining mozzarella and Asiago cheeses. Place shells in very hot oven or 8 inches from hot broiler and cook 6 to 8 minutes to melt cheeses and bubble sauce.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/4-cheese-stuffed-shells-recipe-1913472"},{"name":"\n  \n    4 Layer Cheesecake\n  \n","ingredients":["1/2 cup salted butter, softened, plus more for greasing","1 cup sugar","1 teaspoon Mexican vanilla extract","3 eggs","1/2 cup all-purpose flour","1/3 cup Dutch process baking cocoa","8 ounces cream cheese, softened","1/2 cup ricotta cheese","3/4 cup sugar","1 ounce unsweetened chocolate, melted and cooled (or packaged pre-melted)","2 eggs","1 tablespoon all-purpose flour","1 1/2 cups heavy cream","8 ounces cream cheese","1/2 cup sugar","2 teaspoons Mexican vanilla extract","10 ounces dark chocolate, chopped or about 1 1/2 cups dark chocolate chips","1 cup heavy whipping cream","2 tablespoons butter","1/4 cup white chocolate chips","1 1/2 cups mini chocolate chips, for garnish"],"directions":["\n              For the chocolate cake \"crust\": Preheat the oven to 350 degrees F. Lightly grease the bottom only of a 9-inch springform pan that has been lined with parchment paper.\n            ","\n              In a medium bowl, cream together the butter and sugar. Add the extract and eggs, beating well after each addition. Add the flour and cocoa and mix well to combine. The batter will be stiff. Spread in the pan. Set aside.\n            ","\n              For the baked chocolate cheesecake: In a large bowl, cream the cream cheese and ricotta with the sugar until smooth. Add a small amount of the cheese mixture to the melted chocolate and combine well. Once the little bit of cheese mixture and chocolate is mixed well, add it back to the rest of the cheese mixture and beat until well combined. Add the eggs and flour and beat well. Smooth over the top of the cake batter in the pan. Bake until the cheesecake is set in the center, 25 to 30 minutes. Cover with foil during last 10 minutes to prevent over browning. Remove from the oven and cool.\n            ","\n              A cheesecake is not like a regular cake. It is considered set when the center is still wobbly. After you chill the cheesecake, it will set without wobbling. At this point let the cake cool. Once it is cool, you need to chill the cake for an hour or two.\n            ","\n              For the vanilla cream cheese mousse: Once your chocolate and cheesecake base has been chilled, you can start making the third layer.\n            ","\n              Beat the heavy whipping cream until stiff and set aside. In separate bowl, beat the cream cheese, sugar and vanilla with a mixer in large bowl until well blended. Fold the whipped cream into cheese mixture until just combined. Spread the mixture over the baked cheesecake layer and chill well (freezing the cake at this point works well and makes spreading the final layer easier). Make sure you chill for several hours to make sure all the layers are set.\n            ","\n              For the dark chocolate/white chocolate ganache: Place the chopped dark chocolate in a large bowl. Heat the cream and butter over low heat until just boiling. Reserve 2 tablespoons of the cream mixture. Pour the rest of the cream mixture over the chocolate and let set about 2 minutes, or until it begins to melt. Stir to combine. Repeat for the white chips using the reserved cream mixture. Let cool slightly until spreading consistency.\n            ","\n              Using a sharp knife, gently run the blade around the edge of the cake to loosen. Remove the cake sides from the pan and place the bottom with cake on a serving plate or stand. Spread the frosting over the top and sides.\n            ","\n              Drizzle the white chocolate lightly over the top. Using a knife or toothpick, run it lightly over the top to swirl to create desired effect. At this point, I would place the white chocolate ganache in a pastry bag and use a small round tip to decorate the top of the cake instead of trying to just drizzle it on top. You have more control.\n            ","\n              Press the mini chips (regular size works too) into the frosting on sides until completely coated to create a \"crust.\" Place the cake in the fridge to chill while preparing the final frosting.\n            "],"source":"https://www.foodnetwork.com/recipes/4-layer-cheesecake-recipe-2126532"},{"name":"\n  \n    4 Minute Spicy Garlic Shrimp\n  \n","ingredients":["2 tablespoons extra virgin olive oil, 2 turns of the pan","4 cloves garlic, crushed away from skin","1/2 teaspoon crushed red pepper flakes","24 jumbo shrimp, peeled and deveined, tails in tact, ask for easy peels at your fish counter","2 teaspoons grill or steak seasoning blend (recommended: Montreal Seasoning by McCormick) or coarse salt and pepper","1 lemon, zested and juiced","2 tablespoons chopped parsley leaves, a handful"],"directions":["\n              Heat a large skillet over medium high heat. Add extra-virgin olive oil, 2 turns of the pan, garlic, red pepper flakes and shrimp. Season with grill seasoning or salt and pepper and cook shrimp 3 minutes or until just pink. Toss with lemon zest, juice and chopped parsley. Remove shrimp to a serving platter leaving the garlic cloves in the pan.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/4-minute-spicy-garlic-shrimp-recipe-1915190"},{"name":"\n  \n    4# Apple Pie\n  \n","ingredients":["2 cups all-purpose flour","1 teaspoon salt","3/4 cup cold butter, cut in chucks","1/3 cup cold water","3 1/4 pounds apples, peeled and sliced ","2 tablespoons lemon juice","1 1/2 cups Apple Pie Mix, recipe follows"," 4 1/2 cups sugar"," 4 1/2 cups brown sugar"," 2 cups all-purpose flour"," 3 tablespoons ground cinnamon"," 1 teaspoon ground nutmeg"],"directions":["\n              Preheat oven to 400 degrees F. \n            ","\n              To make the crust: Blend flour, salt, and butter in food processor until butter is pea sized, about 15 pulses. Add cold water and blend until dough forms a ball, about 20 seconds. Form into a ball and divide in half. Roll half of the dough out to make pie bottom. Place pie bottom in a 10-inch deep dish pie pan. \n            ","\n              Fill bottom crust with the apples. Sprinkle lemon juice over the apples and top with apple pie mix in the center of the pie. Roll out the other piece of dough and place on top over the pie mix. \n            ","\n              Move oven rack to the middle of the oven. Cover crust edges tightly with 3 strips of aluminum foil. Cover top of pie loosely with a 12 by 12-inch square piece of foil. Place pie on cookie sheet. Bake 1 hour and 15 minutes. Remove large piece of foil, leaving strips in place, and bake until well browned, about 10 to 15 minutes. Strips may be removed the last 5 minutes, if necessary, to brown crust.\n            ","\n               Blend all ingredients together.\n            "],"source":"https://www.foodnetwork.com/recipes/4-apple-pie-recipe-2115535"},{"name":"\n  \n    4-Bean Relish\n  \n","ingredients":["1/3 cup red wine vinegar","4 tablespoons balsamic vinegar","1/4 cup extra-virgin olive oil","Salt and freshly cracked black pepper","1/4 cup scallions, sliced","3/4 cup red onions, finely diced","1/4 cup peppadew peppers (sweet red peppers) or roasted red bell peppers, finely diced","1/2 teaspoon sea salt","3 tablespoons honey","1 (12-ounce) can white beans, drained","1 (12-ounce) can chick peas, garbanzo beans, drained","1 (12-ounce) can pinto beans, drained","1 (12-ounce) can black beans, drained"],"directions":["\n              Mix all ingredients together and let sit in the refrigerator for at least 1 hour for the flavors to blend. Mix thoroughly before service.\n            "],"source":"https://www.foodnetwork.com/recipes/guy-fieri/4-bean-relish-recipe-1952603"},{"name":"\n  \n    4-Cheese Mac and Cheese with Spicy Chili Crust\n  \n","ingredients":["1 cup heavy cream","1 cup diced or grated cheeses (equal parts parmesan reggiano, mezze secco, hard provolone and manchego)","1 pinch black pepper","1 splash truffle oil, to taste","1 pound elbow macaroni, partially cooked","1/4 cup toasted panko bread crumbs mixed with a pinch of red pepper (ancho, aleppo, or urfa all work very well)"],"directions":["\n              In a medium saucepan over high heat, bring the cream to a boil and then reduce the heat to a simmer. Slowly whisk in the mixed cheeses until smooth. Add the pepper and truffle oil. Add the partially cooked pasta letting it finish cooking in the cheese mix, about 2 to 3 minutes. Spoon into ramekins or other serving dish and top with the bread crumbs.\n            "],"source":"https://www.foodnetwork.com/recipes/4-cheese-mac-and-cheese-with-spicy-chili-crust-recipe-1944894"},{"name":"\n  \n    4-Flavor Ice Cube Tray Appetizers\n  \n","ingredients":["All-purpose flour, for dusting","2 frozen puff pastry sheets (from a 17.3-ounce box), thawed ","Three 1-inch long cornichons, halved length-wise ","Six 1-inch square pieces ham steak (about 1 1/2 ounces) ","1 1/2 ounces shredded gruyere cheese (about 1/2 cup)","18 mozzarella pearls","3 teaspoons prepared pesto ","18 slices sun-dried tomatoes, from 3 to 4 tomatoes","6 whole candied pecans ","6 small red grapes, halved ","Six 1-inch square pieces brie cheese, about 1/2-inch-thick (about 1 ounce)","Kosher salt and freshly ground black pepper","1/4 cup cream cheese, at room temperature ","1 scallion, thinly sliced ","Zest of 1 medium lemon (about 1 teaspoon) ","Six extra-small (91/110) cooked shrimp, tails removed","1 large egg, beaten"],"directions":["\n              Lightly flour a work surface and roll out both puff pastry sheets into 12-inch squares. Lay half of 1 piece of pastry over a 12-compartment ice cube tray (the remaining half of the pastry will hang off the tray) then gently use the back of your fingers (or the handle of a wooden spoon) to press the dough down into each compartment of the tray. Repeat with the remaining pastry and tray.\n            ","\n              Fill 6 of the ice cube compartments in the same row each with 1 piece of cornichon, 1 piece of ham and 1 tablespoon gruyere cheese. Fill the next 6 ice cube compartments in the same row each with 3 mozzarella pearls, 1/2 teaspoon pesto and 2 slices sun-dried tomatoes. Fill the next 6 ice cube compartments in the same row each with 1 candied pecan, 2 red grape halves, 1 piece of brie and a pinch of black pepper. Stir together the cream cheese, scallion, 1/2 teaspoon lemon zest and a pinch of salt and pepper in a small bowl and stir until completely combined. Fill the last 6 ice cube compartments in the same row each with 1 shrimp then a spoonful of the cream cheese mixture.\n            ","\n              Brush the edges of the puff pastry with the beaten egg then fold the puff pastry over the ice cube tray so that it completely covers the filling. Cut the excess puff pastry from around the upper edges of the ice cube trays then use your fingers to press the dough together so that it is sealed. Put the ice cube trays in the freezer for 15 minutes.\n            ","\n              Position a rack in the center and preheat the oven to 400 degrees F. \n            ","\n              Use your fingers to gently loosen the puff pastry from the ice cube trays then flip out onto a cutting board. Use a knife to trim the edges of the dough to 1/4-inch-wide. Cut in between each ice cube compartment to free each filled compartment. Use a fork to crimp the edges of all the ice cube bites, making sure to keep the flavors separate. \n            ","\n              Line a large baking sheet with parchment. Put the ice cube bites on the baking sheet, keeping the flavors separate). Brush the beaten egg on top of the puff pastry then sprinkle the ham bites with the remaining gruyere cheese, lay a slice of sun-dried tomato on top of the pesto bites, sprinkle black pepper on the brie bites. \n            ","\n              Bake, rotating the baking sheet about halfway, until the bites are puffed and golden brown, about 25 minutes.\n            ","\n              Cool for 5 minutes on the baking sheet then transfer to a serving platter. Top the shrimp bites with the remaining lemon zest.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-flavor-ice-cube-tray-appetizers-5238243"},{"name":"\n  \n    4-Hour Lamb\n  \n","ingredients":["One 6- to 7-pound leg of lamb (see Cook's Note)","Good olive oil","1 tablespoon kosher salt","2 teaspoons freshly ground black pepper","One 750-ml bottle dry white wine","2 heads of garlic, broken apart but not peeled","15 large sprigs fresh rosemary","15 large sprigs fresh thyme","6 bay leaves"],"directions":["\n              Preheat the oven to 300 degrees F. \n            ","\n              Rub the lamb all over with olive oil and season all over with salt and pepper. Heat a very large Dutch oven such as Le Creuset over medium-high heat until its hot. Add the lamb and sear on all sides for about 12 minutes, until its browned all over. Remove the lamb to a plate. \n            ","\n              Add the wine and 2 cups of water to the pan and cook for a minute or two, scraping up all the brown bits in the bottom. Add the garlic, rosemary, thyme, and bay leaves and the lamb on top. Place the lid on the pot and bake in the oven for 4 hours, basting occasionally. (If you dont have a lid, you can cover it tightly with 2 layers of aluminum foil.) \n            ","\n              After 4 hours, the lamb should be incredibly tender and falling off the bone. Remove the lamb to a plate, cover it tightly with foil and allow it to rest. Strain the sauce into a saucepan and bring to a boil. Lower the heat and simmer for 10 minutes to reduce. The lamb will be too tender to slice; serve it warm with spoons and the sauce.\n            "],"source":"https://www.foodnetwork.com/recipes/ina-garten/4-hour-lamb-recipe-2105155"},{"name":"\n  \n    4-Ingredient Blueberry Pie\n  \n","ingredients":["2 refrigerated rolled pie crusts (homemade or store-bought)","3/4 cup sugar","6 cups blueberries","3 tablespoons all-purpose flour "],"directions":["\n              Adjust 2 racks to the top and bottom thirds of the oven and preheat to 425 degrees F. Put a baking sheet or pizza stone on the bottom rack.\n            ","\n              Combine the sugar with 4 cups of the blueberries in a medium saucepan. Bring to a simmer over medium heat, crushing up the berries with a wooden spoon to release their juices, and cook, stirring occasionally, until thick and reduced by half, 15 to 20 minutes. Remove from the heat and stir in the flour and the remaining 2 cups blueberries. Transfer to a bowl and cool completely, about 45 minutes.\n            ","\n              Meanwhile, fit one of the pie crusts into a 9-inch pie plate and fold and crimp the edges as desired. Refrigerate while you wait for the filling to cool.\n            ","\n              Line a baking sheet with parchment. Cut out as many stars as you can from the second pie crust. Arrange on the baking sheet. Bake on the upper rack until golden, about 10 minutes. Set aside to cool.\n            ","\n              Stir the cooled filling once and pour into the dough-lined pie plate; spread it out into an even layer. Place the pie on the preheated baking sheet, turn the oven down to 375 degrees F and bake until the crust in golden and the edge of the filling is bubbly, 55 to 60 minutes. Remove to a rack to cool. Press the stars into the filling, standing them up slightly. Let cool at least 2 hours before serving.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-blueberry-pie-3364545"},{"name":"\n  \n    4-Ingredient Coconut-Lime Pie\n  \n","ingredients":["One 15-ounce can cream of coconut","8 small limes, 2 zested and all juiced (about 1 cup juice)","8 small limes, 2 zested and all juiced (about 1 cup juice) ","One 9-inch prepared graham cracker crust","1 ounce dark chocolate"],"directions":["\n              Combine the cream of coconut, lime juice and half of the zest in a blender and blend until combined. Pour into the crust and freeze until solid, about 4 hours.\n            ","\n              Put the chocolate in a small microwave-safe bowl and heat for 30-second increments, stirring after each, until melted and very thin. Dip a fork into the chocolate and drizzle over the frozen pie. Sprinkle the remaining zest on top. Cover loosely with plastic wrap and freeze until the chocolate sets, then slice and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-coconut-lime-pie-3364946"},{"name":"\n  \n    4-Ingredient Cookies and Cream Pie\n  \n","ingredients":["One 9-inch prepared chocolate cookie crust","1 1/2 cups heavy cream","1/2 cup confectioners' sugar","15 chocolate-and-cream sandwich cookies"],"directions":["\n              Cut 10 of the cookie sandwiches in half and arrange in the bottom of the pie crust.\n            ","\n              Whip the cream and sugar together in a medium bowl with an electric mixer on medium-high speed until it holds stiff peaks. Pour the cream into the pie crust and smooth out into an even layer with decorate swirls on top (the back of a spoon works nicely). Crumble the remaining 5 cookies and sprinkle over the top. Cover loosely with plastic wrap and refrigerate overnight, to soften the cookies.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-cookies-and-cream-pie-3364950"},{"name":"\n  \n    4-Ingredient Frozen Lemonade Pie\n  \n","ingredients":["1 cup lemon sorbet","3/4 cup sweetened condensed milk","2/3 cup heavy cream","One 9-inch graham cracker pie crust"],"directions":["\n              Put the sorbet in a medium microwave-safe bowl and heat until melted. Stir in the condensed milk and let cool.\n            ","\n              Put the cream in another medium bowl and beat with an electric mixer until it is thick and holds a ribbony shape when you run the beaters through it (do not let it form soft peaks), 2 to 3 minutes. Gently stir the thickened cream into the lemon sorbet mixture and pour into the pie crust. Smooth out into an even layer. Cover loosely with plastic wrap and freeze until set, about 2 hours or up to overnight.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-frozen-lemonade-pie-3365016"},{"name":"\n  \n    4-Ingredient Peaches and Cream Pie\n  \n","ingredients":["1 refrigerated rolled pie crust (homemade or store-bought)","Two 8-ounce blocks cream cheese, at room temperature","1 cup confectioners' sugar","3 to 4 very ripe peaches, halved, pitted and cut into wedges"],"directions":["\n              Preheat an oven to 350 degrees F. Fit the pie crust into a 9-inch pie plate and fold and crimp the edges as desired. Lay a large piece of foil over the dough and fill with pie weights or raw rice. Bake until the dough begins to dry and set but is still very pale, about 12 minutes. Remove the weights and foil and continue to bake until the dough is golden brown, 15 to 20 minutes more. Set aside to cool completely on a rack.\n            ","\n              Put the cream cheese, sugar and 1/4 cup water in a large bowl. With an electric mixer, beat on medium-high until light and smooth, about 2 minutes. Pour into the cooled pie crust and smooth out into an even layer. Top with the peach slices, loosely cover with plastic wrap and refrigerate until chilled, about 2 hours or up to overnight.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-peaches-and-cream-pie-3364851"},{"name":"\n  \n    4-Ingredient Peanut Butter-Strawberry Ice Cream Pie\n  \n","ingredients":["2 cups strawberry ice cream","3/4 cup smooth peanut butter","2 1/2 cups crispy rice cereal","6 strawberries, hulled and quartered or sliced"],"directions":["\n              Let the ice cream sit at room temperature to soften, about 20 minutes.\n            ","\n              Meanwhile, put 1/2 cup of the peanut butter in a medium microwave-safe bowl and heat for 30 second increments, stirring after each, until warm and very loose, about 2 minutes. Add the cereal and stir and toss until combined. Transfer to a 9-inch pie plate and press into an even layer along the bottom and up the sides, using the flat bottom of a measuring cup to help. (The mixture will still be a bit crumbly.)\n            ","\n              Scoop the ice cream into the peanut butter crust and smooth out into an even layer. Heat the remaining 1/4 cup peanut butter in the microwave until warm and loose, about 1 minute. Dip a fork into the peanut butter and drizzle it over the pie. Loosely cover with plastic wrap and freeze until set, at least 2 hours or up to overnight. Decorate with a ring of strawberries before serving.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-peanut-butter-strawberry-ice-cream-pie-3364663"},{"name":"\n  \n    4-Ingredient S'mores Pie\n  \n","ingredients":["14 ounces milk chocolate chips","3/4 cup heavy cream","One 9-inch prepared graham cracker crust","15 marshmallows"],"directions":["\n              Combine the chocolate chips and cream in a large microwave-safe bowl and heat for 2 1/2 minutes. Stir until completely smooth (the chocolate may appear separated at first, but just keep stirring). Pour into the prepared pie crust, loosely cover with plastic wrap and refrigerate until set, about 4 hours or up to overnight.\n            ","\n              Preheat the broiler.\n            ","\n              Use kitchen shears to cut each marshmallow in half, on a bias, from one corner to the opposite corner. Arrange the marshmallow halves, cut-side down, on top of the chilled pie. Broil until golden, watching closely and rotating the pan as needed, about 1 minute. Let the pie cool completely, then cover loosely with plastic wrap and return to the fridge until the ganache sets again, 1 to 2 hours.\n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/4-ingredient-smores-pie-3364596"},{"name":"\n  \n    4-Pepper Deviled Eggs\n  \n","ingredients":["6 hard boiled eggs, cooled and peeled","1 teaspoon whole pink peppercorns, divided","1/2 teaspoon whole white peppercorns","1/2 teaspoon whole black peppercorns","1/2 teaspoon whole green peppercorns","1/2 teaspoon caper liquid","1/4 cup mayonnaise","1 teaspoon Dijon mustard","1/4 teaspoon kosher salt","Pinch sugar"],"directions":["\n              Slice the eggs in half from top to bottom. Scoop the yolks into a medium mixing bowl and lay the whites aside. Place all of the peppercorns, except 1/2 teaspoon of the pink peppercorns, into a spice grinder and process until ground well. Add the ground peppers, caper liquid, mayonnaise, mustard, salt and sugar to the egg yolks and using a fork, stir to thoroughly combine. Place the mixture into a zip-top plastic bag and cut a small hole at one of the corners. Pipe the mixture into each of the white halves. Coarsely grind the remaining 1/2 teaspoon of pink peppercorns and use to garnish the top of each egg.\n            ","\n              Chill for at least 1 hour in the refrigerator before serving.\n            "],"source":"https://www.foodnetwork.com/recipes/alton-brown/4-pepper-deviled-eggs-recipe-1917393"},{"name":"\n  \n    4-Square Family Pizza\n  \n","ingredients":["Cornmeal, if desired","1 can (13.8 ounce) Pillsbury® refrigerated classic pizza crust","2 teaspoons olive oil","1/2 cup shredded Cheddar cheese (2 ounce)","1 1/2 cups shredded mozzarella cheese (6 ounce)","1tablespoon chopped red onion","1/2 cup refrigerated honey hickory barbecue sauce with shredded chicken, large pieces cut up","1 tablespoon shredded fresh Parmesan cheese","4 to 5 (1/4-inch-thick) slices plum (Roma) tomato (about 1 large tomato)","1 tablespoon thin fresh basil strips","2 tablespoons pizza sauce","2 slices Canadian bacon, quartered","1/4 cup pineapple tidbits, well drained (from 8 ounce can)","2 tablespoons pizza sauce","8 to 10 slices pepperoni (from 3 ounce package)"],"directions":["\n              Heat oven to 425 degrees F. Spray cookie sheet with cooking spray; sprinkle with cornmeal. Unroll dough; place on cookie sheet. Starting at center, press out dough into 14x12-inch rectangle. Brush dough with olive oil.\n            ","\n              Bake 6 to 8 minutes. Sprinkle Cheddar cheese in the shape of a \"plus sign\" on crust, dividing the crust into four squares. Top each square with 1 of the 4 variations listed above to make 4 different squares; if desired, on the Pepperoni Pizza Square, arrange the pepperoni to make a happy face. Top entire pizza with mozzarella cheese.\n            ","\n              Bake 10 to 13 minutes longer or until crust is deep golden brown and cheese is melted and bubbly. Cut pizza into 4 squares; cut each square into 4 squares to make a total of 16 squares.\n            ","\n              This recipe lends itself well to other variations. Get creative and add your family's favorite toppings!\n            ","\n              For a perfect party pizza, follow Steps 1 and 2, dividing the crust into four squares with lines of shredded Cheddar cheese as described. Then provide toppings (meats, cheeses, sauces, fruits, etc.), allowing guests to complete a square with the ingredients of their choice.\n            ","\n              Wonderful for a teen sleepover party!\n            "],"source":"https://www.foodnetwork.com/recipes/4-square-family-pizza-recipe-2010434"},{"name":"\n  \n    4-Step Chicken Marengo\n  \n","ingredients":["3 large chicken cutlets, sliced into thin paillards (slice while partially frozen)","Kosher salt and freshly ground black pepper","1/2 cup all-purpose flour","3 tablespoons vegetable oil","1 medium sweet onion, sliced","1/2 pound mushrooms, sliced","1 yellow bell pepper, seeded and julienned","2 tablespoons tomato paste","1/2 cup white wine","1/2 cup beef broth","One 14-ounce can chopped tomatoes","1/2 tablespoon butter"],"directions":["\n              Season the chicken with salt and pepper, to taste, and lightly dredge in flour. In a large saute pan, heat the oil over medium-high heat and add the chicken. Brown on both sides, until nicely golden, about 3 minutes per side. Remove from the pan and set aside on a plate. In the same pan, add more oil, if needed, along with the onion, mushrooms and peppers and saute until softened and fragrant, but not limp, about 5 minutes. Season with salt and pepper, to taste. Stir in the tomato paste and cook a few minutes to cook out the raw flavor. Turn up the heat, and add the wine/wine to deglaze the pan and let it reduce for 2 or 3 minutes. Add the beef broth and tomatoes. Once the mixture begins to bubble, add the browned paillards and any juices from the chicken and reduce the heat to a simmer. Cook until the chicken is warmed through, about 3 minutes. Turn the heat off and stir in the butter. Transfer to a serving platter and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/melissa-darabian/4-step-chicken-marengo-recipe-1949194"},{"name":"\n  \n    40 Cloves and a Chicken\n  \n","ingredients":["1 whole chicken (broiler/fryer) cut into 8 pieces","1/2 cup plus 2 tablespoons olive oil","10 sprigs fresh thyme","40 peeled cloves garlic","Salt and pepper"],"directions":["\n              Preheat oven to 350 degrees F.\n            ","\n              Season chicken with salt and pepper. Toss with a 2 tablespoons olive oil and brown on both sides in a wide fry pan or skillet over high heat. Remove from heat, add oil, thyme, and garlic cloves. Cover and bake for 1 1/2 hours.\n            ","\n              Remove chicken from the oven, let rest for 5 to 10 minutes, carve, and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/alton-brown/40-cloves-and-a-chicken-recipe-1910661"},{"name":"\n  \n    40-Cloves-of-Garlic Chicken Alfredo\n  \n","ingredients":["Kosher salt and freshly ground black pepper","40 cloves garlic (about 3 heads), peeled and trimmed ","Vegetable oil, for cooking","4 tablespoons unsalted butter","2 boneless skinless chicken thighs (about 8 ounces), trimmed and cut into bite-size pieces ","1/4 cup dry white wine","1 cup heavy cream","8 ounces dried fettuccine","1/2 cup grated Parmesan","2 tablespoons chopped fresh Italian parsley"],"directions":["\n              Bring a large pot of salted water to boil for the pasta.\n            ","\n              Thinly slice 5 garlic cloves. Heat about a 1/2 inch vegetable oil in a small skillet over medium heat, then add 1 slice of garlic. Cook until the garlic is at a lively sizzle, then sprinkle in the rest of the garlic. Cook, stirring, until the garlic is just golden and crisp (don't overcook or it will be bitter), about 1 minute. Drain on paper towels and sprinkle with salt. \n            ","\n              Melt 2 tablespoons butter in a large skillet over medium-high heat. Add the chicken and whole garlic cloves and sprinkle with salt and pepper. Cook, tossing occasionally, until both the chicken and garlic are golden brown, 7 to 8 minutes. Add the wine and adjust the heat so the sauce is simmering, then cover and cook until the chicken and garlic are tender, about 10 minutes.\n            ","\n              Uncover and adjust the heat so the sauce reduces and is syrupy, about 1 minute. Add the cream and simmer until slightly thickened, 2 to 3 minutes; reduce the heat to low and keep warm. \n            ","\n              Meanwhile, cook the pasta until al dente according to the package directions. Drain the pasta, reserving 1/2 cup pasta water. Add the pasta to the simmering sauce and toss to coat, adding a little pasta water if it seems dry. Remove the skillet from the heat, then stir in the Parmesan and remaining 2 tablespoons butter. Sprinkle with the parsley and serve in pasta bowls topped with the garlic chips. \n            "],"source":"https://www.foodnetwork.com/recipes/food-network-kitchen/40-clove-of-garlic-chicken-alfredo-5435381"},{"name":"\n  \n    40-Second Omelet\n  \n","ingredients":["2 eggs","2 tablespoons water","1 tablespoon butter, or 1 teaspoon oil"],"directions":["\n              Beat together eggs and water until blended. In a 10-inch omelet pan heat butter until just hot enough to sizzle a drop of water. Pour in egg mixture. Mixture should set immediately at edges. With an inverted pancake turner, carefully push cooked portions at edges toward center so uncooked portions can reach hot pan surface, tilting pan and moving as necessary. Continue until the egg is set and will not flow.\n            ","\n              Fill the omelet with 1/2 cup of desired mixture. With a pancake turner, fold omelet in half. Invert onto plate and serve immediately.\n            "],"source":"https://www.foodnetwork.com/recipes/40-second-omelet-recipe-2011135"},{"name":"\n  \n    40/40 Martini\n  \n","ingredients":["Chocolate syrup, for swirling","2 ounces vanilla vodka, such as Smirnoff","1 1/2 ounces white chocolate liqueur, such as Godiva","Maraschino cherry, for garnish"],"directions":["\n              Swirl the chocolate on the inside of a chilled martini glass. Combine the vanilla vodka and white chocolate liqueur in a cocktail shaker filled with ice. Shake and pour into the prepared martini glass. Garnish with a cherry.\n            "],"source":"https://www.foodnetwork.com/recipes/4040-martini-2109582"},{"name":"\n  \n    44646\n  \n","ingredients":["1 cup sugar"],"directions":[],"source":"https://www.foodnetwork.com/recipes/44646-2121709"},{"name":"\n  \n    4th of July Berry Tart\n  \n","ingredients":["1/4 cup almond meal","1 1/4 cups all-purpose flour","1/2 cup confectioners' sugar","1/4 teaspoon salt","9 tablespoons unsalted butter, at room temperature","1 large egg yolk","3 tablespoons cornstarch","1/2 cup sugar","4 large egg yolks","1 1/2 cups whole milk","1/2 vanilla bean","Pinch salt","1 tablespoon unsalted butter","2 1/2 ounces white chocolate, finely chopped","1 1/2 cups fresh blueberries","2 cups fresh raspberries","Confectioners' sugar for dusting the top"],"directions":["\n              To make the tart dough: In a food processor combine the almond meal, flour, confectioners' sugar and salt. Pulse several times to combine. Add the butter and egg yolk, process just until the dough comes together. Distribute the dough into the 13-by-4-inch tart pan (or 10-inch round).\n            ","\n              Lay plastic wrap over the dough and press it into the pan so that it is an even thickness. Remove the plastic and freeze the dough until it is firm, about 20 minutes.\n            ","\n              Preheat the oven to 350 degrees F. Cover the dough with foil and fill with pie weights or beans. This will keep the dough from slouching in the pan. Bake for 25 minutes, then remove the foil and beans, bake for an additional 5 to 10 minutes or until the crust is a light golden color. Allow to cool to room temperature.\n            ","\n              Prepare the pastry cream: Whisk together the cornstarch and 1/4 cup of sugar. Add the egg yolks to the cornstarch and mix into a smooth paste. Set aside.\n            ","\n              Bring the milk, remaining 1/4 cup of the sugar, vanilla bean, and salt to a gentle simmer in a medium saucepan. Slowly, and in small amounts, whisk the hot milk into the egg mixture. Once the egg mixture is warm to the touch, pour it back into the milk in the pan.\n            ","\n              Bring the custard to a gentle boil, whisking continuously for 2 to 3 minutes. The pastry cream will thicken almost immediately, but it is important to cook the starch until it isn't grainy. When the pastry cream is done it will be smooth and glossy.\n            ","\n              Remove from the heat and add the butter and white chocolate to the pastry cream. Allow to sit for 3 minutes, then gently whisk them together. Pour the pastry cream into a shallow container. Cover with plastic wrap, pressed directly on the surface of the cream to prevent a skin from forming. Set the container in the freezer for 15 minutes (this cools down the eggs quickly) and then refrigerate for up to a few days.\n            ","\n              Fill the cooled tart shell with the pastry cream. Decorate the top with the berries and refrigerate until ready to serve. Dust with confectioners' sugar right before slicing and serving.\n            "],"source":"https://www.foodnetwork.com/recipes/4th-of-july-berry-tart-2108000"},{"name":"\n  \n    5 Alarm Sauce\n  \n","ingredients":["2 cups red hot sauce (use your favorite)","1 stick margarine or butter, softened","2 1/2 tablespoons cayenne pepper","2 1/2 tablespoons crushed red chile flakes","2 1/2 tablespoons prepared horseradish","2 tablespoons minced fresh jalapeno","1 tablespoon minced fresh habanero","1 tablespoon plus 1 teaspoon ground cumin","1 tablespoon plus 1 teaspoon garlic powder","1 tablespoon plus 1 teaspoon onion powder","1 tablespoon plus 1 teaspoon coarsely ground black pepper","Hot chicken wings, for serving"],"directions":["\n              Combine the hot sauce, margarine or butter, cayenne pepper, chile flakes, horseradish, jalapenoes, habaneros, cumin, garlic, onion and black pepper in a food processor and mix on medium speed until all the ingredients are well mixed. Reserve the hot sauce to toss with chicken wings.\n            ","\n              Cook's Note: Be sure to wear gloves when cutting the jalapeno and habanero and do not touch your face after handling the seeds or cut up peppers to avoid irritation!\n            "],"source":"https://www.foodnetwork.com/recipes/5-alarm-sauce-recipe-1925323"},{"name":"\n  \n    5 Bean Chili\n  \n","ingredients":["1 pound ground chuck","1 cup diced yellow onion","1 cup diced green bell pepper","3 cloves garlic, minced","1 1/2 tablespoons Mexican style chili powder","2 teaspoons salt","1 1/2 teaspoons ground cumin","1 teaspoon freshly ground black pepper","1/2 teaspoon cayenne pepper","1/8 teaspoon ground coriander","1/8 teaspoon ground cinnamon","1 (28-ounce) can whole peeled tomatoes, broken up with your hands","3 cups beef stock or canned low-sodium beef broth","2 bay leaves","1 1/2 cups cooked and drained great Northern beans","1 1/2 cups cooked and drained pinto beans","1 1/2 cups cooked and drained kidney beans","1 1/2 cups cooked and drained black beans","1 1/2 cups cooked and drained navy beans"],"directions":["\n              In a Dutch oven, over medium-high heat, cook the meat until well browned, 4 to 6 minutes. Add the onions, bell pepper, garlic, chili powder, salt, cumin, black pepper, cayenne pepper, coriander, and cinnamon, and cook until vegetables are soft, 4 to 6 minutes. Add the tomatoes, stock, and bay leaves; bring the mixture to a simmer, partially cover, and cook for about 40 minutes, stirring occasionally. Add the beans, stir to combine, and continue to cook another 20 to 30 minutes, or until the flavors have come together and the chili has a nice, thick consistency. Taste and adjust the seasoning, if necessary.\n            "],"source":"https://www.foodnetwork.com/recipes/5-bean-chili-3644530"},{"name":"\n  \n    5 Bean Chili\n  \n","ingredients":["1 1/2 pounds lean ground beef","2 cups chopped onion","1 (15-ounce) can light red kidney beans, drained","1 (15-ounce) can dark red kidney beans, drained","1 (15-ounce) can cannellini beans, drained","1 (15-ounce) can butter beans, drained","1 (15-ounce) can pinto beans, drained","2 (14 1/2-ounce) cans diced tomatoes with jalapenos","2 (1 1/4 ounce) packets chili seasoning mix","1 (8-ounce) can tomato sauce","1 cup water","Salt and pepper","Suggested servings: cornbread, sour cream, cheese, chips, and fresh cilantro"],"directions":["\n              In a skillet over medium-high heat, brown ground beef with the onions. Be sure to break up clumps as much as possible. Put the mixture in a slow cooker.\n            ","\n              Add remaining ingredients and stir together. Cover and cook on high setting for 4 hours or on low for 7 to 8 hours.\n            ","\n              Ladle into bowls and serve with your favorite chili fixings.\n            "],"source":"https://www.foodnetwork.com/recipes/sandra-lee/5-bean-chili-recipe-1945302"},{"name":"\n  \n    5 Ingredient Bacon Burgers with Cheddar and Red Onion with Parmesan Popcorn Black-Eyed Peas\n  \n","ingredients":["Nonstick cooking spray","1 1/2 pounds lean ground beef","6 strips bacon, cooked until crisp in a skillet or microwave and crumbled","Salt","Freshly ground black pepper","4 rounds sliced red onion (about 1/4-inch thick)","4 slices sharp Cheddar (about 6 to 8 ounces total)","4 Kaiser rolls","2 teaspoons olive oil","1 (14-ounce) can black-eyed peas, drained","Salt","Freshly ground black pepper","1 tablespoon grated Parmesan","1 tablespoon freshly chopped parsley leaves"],"directions":["\n              For the burgers: Coat a stove-top grill pan or griddle with cooking spray and set over medium-high heat to preheat. In a large bowl, combine beef, bacon, salt, and black pepper. Mix well and shape mixture into 4 patties, each about 1-inch thick. Place burgers on hot pan and cook 3 to 5 minutes per side, for medium. Arrange onions alongside burgers and grill 1 minute per side, until just golden. Place cheese on burgers and cook 1 minute, until cheese melts. Serve burgers on rolls with onions on top.\n            ","\n              For the black-eyed peas: Heat oil in a large skillet over medium-high heat. Add peas and cook 3 to 5 minutes, until golden brown. Add salt and black pepper, to taste, and stir to coat. Remove from heat and stir in Parmesan and parsley. Serve alongside burgers.\n            "],"source":"https://www.foodnetwork.com/recipes/robin-miller/5-ingredient-bacon-burgers-with-cheddar-and-red-onion-with-parmesan-popcorn-black-eyed-peas-recipe-1937266"},{"name":"\n  \n    5 Ingredient Pan-Seared Halibut with Artichoke Hearts and Saffron Broth\n  \n","ingredients":["4 halibut fillets (about 5 ounces each)","Salt","Freshly ground black pepper","1 tablespoon olive oil","1 (14-ounce) can artichoke hearts, drained and chopped","3/4 cup reduced-sodium chicken broth","1 teaspoon saffron threads"],"directions":["\n              Season both sides of halibut with salt and black pepper.\n            ","\n              Heat oil in a large skillet over medium-high heat. Add halibut and cook 2 minutes per side, until golden brown.\n            ","\n              Remove fish from pan and set aside.\n            ","\n              To the same pan, add artichoke hearts, broth and saffron. Bring to a simmer. Return fish to pan and simmer 2 minutes, until fish is fork-tender.\n            ","\n              Transfer to a serving platter and is usually served with couscous.\n            "],"source":"https://www.foodnetwork.com/recipes/robin-miller/5-ingredient-pan-seared-halibut-with-artichoke-hearts-and-saffron-broth-recipe-1937670"},{"name":"\n  \n    5 Ingredient Sauteed Chicken and Broccoli Rabe with Black Olives, Sundried Tomatoes and Feta\n  \n","ingredients":["1 cup diced oil-packed sun-dried tomatoes, plus 1 tablespoon oil from jar","1 pound boneless skinless chicken breast halves, cut into 2-inch pieces","1 bunch broccoli rabe, chopped","1/2 cup sliced pitted black olives","1/4 cup water","Salt","Freshly ground black pepper","1/3 cup crumbled feta cheese"],"directions":["\n              Heat the oil from sun-dried tomatoes in a large skillet over medium-high heat. Add chicken and cook 3 to 5 minutes, until golden brown on all sides. Add tomatoes, broccoli rabe, olives, and 1/4 cup water, season with salt and pepper, cover and cook 3 minutes, until broccoli rabe wilts and chicken is cooked through. Remove from heat, transfer to a serving plate and top with feta cheese. Usually served with capellini pasta or rice.\n            "],"source":"https://www.foodnetwork.com/recipes/robin-miller/5-ingredient-sauteed-chicken-and-broccoli-rabe-with-black-olives-sundried-tomatoes-and-feta-recipe-2013064"},{"name":"\n  \n    5 Minute Bread Pudding\n  \n","ingredients":["1 loaf store bought frosted or unfrosted cinnamon raisin bread, unsliced","1/2 stick butter, softened","1 can sweetened condensed or reduced fat sweetened condensed milk","2 jiggers brandy","Whipped cream in spray top canister from your dairy aisle","Ground or grated nutmeg, for garnish"],"directions":["\n              Heat a griddle pan over medium heat. Cut 4 thick slices of cinnamon raisin bread. Butter both sides of the bread slices with softened butter. Grill bread until brown and crispy on both sides, 2 minutes on each side.\n            ","\n              While bread grills, in a small saucepot, heat sweetened condensed milk or reduced fat sweetened condensed milk over medium low heat for 4 minutes. Remove from heat and stir in brandy.\n            ","\n              Cut each grilled slice of bread into quarters and pile into 4 dessert cups. Top bread with a few spoonfuls of hard sauce of sweetened condensed milk and brandy and a generous swirl of whipped cream. Garnish cream with a sprinkle of nutmeg and serve.\n            "],"source":"https://www.foodnetwork.com/recipes/rachael-ray/5-minute-bread-pudding-recipe-1940874"}]